blog/content/post/rag02.org
*** Armadilha 1: A Falsa Sensação de Relevância

Uma busca por vizinhos mais próximos sempre retornará algum resultado, mas como saber se é realmente útil? Alguns documentos podem parecer relevantes com base na similaridade vetorial, mas não fornecem o contexto adequado para responder à pergunta do usuário.

#+BEGIN_QUOTE
/Solução/: Implementar verificação de relevância pós-recuperação usando [[https://huggingface.co/cross-encoder][cross-encoders]] ou filtros baseados em regras. No [[https://www.postgresql.org/][PostgreSQL]], podemos fazer isso com:
#+END_QUOTE

#+BEGIN_SRC sql
-- Primeiro recuperamos candidatos usando busca vetorial
WITH candidatos AS (
  SELECT id, titulo, conteudo, embedding <=> query_embedding AS distancia
  FROM documentos_embeddings
  ORDER BY distancia
  LIMIT 20
),
-- Depois aplicamos filtro secundário para verificar relevância real
filtrados AS (
  SELECT id, titulo, conteudo, distancia
  FROM candidatos
  WHERE 
    -- Filtro baseado em regras (exemplo: deve conter palavras-chave)
    conteudo ILIKE '%' || 'palavra_chave' || '%'
    -- Ou usar um modelo secundário para avaliar relevância
    -- ai.evaluate_relevance(conteudo, 'consulta_original') > 0.7  -- ⚠️ Nota: Função experimental no pgai
)
SELECT * FROM filtrados ORDER BY distancia LIMIT 5;
#+END_SRC

Este código SQL demonstra uma abordagem de duas fases para melhorar a qualidade da recuperação em sistemas RAG. Na primeira fase, utilizamos a [[https://en.wikipedia.org/wiki/Vector_database][busca vetorial]] para recuperar 20 candidatos iniciais ordenados por [[https://en.wikipedia.org/wiki/Vector_database][similaridade vetorial]] (usando o operador ~<=>~ do [[https://en.wikipedia.org/wiki/Vector_database][pgvector]] para calcular a distância entre embeddings). Esta etapa prioriza a velocidade e a amplitude da recuperação.

Na segunda fase, aplicamos filtros mais refinados para verificar a relevância real dos documentos recuperados. Isso pode incluir filtros baseados em regras (como busca por palavras-chave usando ~ILIKE~) ou até mesmo modelos secundários de avaliação de relevância (como sugerido no comentário sobre a função experimental do [[https://github.com/timescale/pgai][pgai]]). Esta abordagem em duas etapas equilibra eficiência e precisão, permitindo que o sistema primeiro capture um conjunto amplo de candidatos potenciais e depois refine os resultados para apresentar apenas os documentos verdadeiramente relevantes para a consulta do usuário.


*** Armadilha 2: Tamanho Inadequado de Chunks

Dividir documentos em chunks menores é uma prática padrão, mas qual é o tamanho ideal?

- Chunks muito pequenos perdem contexto crucial
- Chunks muito grandes diluem a recuperação com detalhes irrelevantes

#+BEGIN_QUOTE
/Solução/: Adaptar a estratégia de chunking ao tipo de conteúdo. No nosso [[/post/semantic-postgresql/][PostgreSQL RAG]], usamos chunking recursivo:
#+END_QUOTE

#+BEGIN_SRC sql
-- Podemos ajustar os parâmetros de chunking para diferentes tipos de documentos
SELECT ai.create_vectorizer(
   'documentos_tecnicos'::regclass,
   destination => 'embeddings_tecnicos',
   embedding => ai.embedding_ollama('nomic-embed-text', 768),
   -- Chunks maiores para documentos técnicos que precisam de mais contexto
   chunking => ai.chunking_recursive_character_text_splitter('conteudo', 
                                                           chunk_size => 1500, 
                                                           chunk_overlap => 200)
);
#+END_SRC

Para documentos técnicos, que geralmente contêm informações densas e interconectadas, configuramos chunks maiores (1500 caracteres) com uma sobreposição significativa (200 caracteres). 

Isso permite preservar mais contexto dentro de cada chunk, o que é crucial para a compreensão de conceitos técnicos complexos. O uso do ~chunking_recursive_character_text_splitter~ implementa uma estratégia de divisão recursiva que respeita a estrutura natural do texto, enquanto o modelo de embedding ~nomic-embed-text~ com 768 dimensões captura as nuances semânticas do conteúdo técnico. Esta [[https://en.wikipedia.org/wiki/Chunking_(data_storage][abordagem adaptativa de chunking]]) é fundamental para equilibrar a granularidade da recuperação com a preservação do contexto necessário para respostas precisas em sistemas [[https://en.wikipedia.org/wiki/Retrieval-augmented_generation][RAG]].


