rag02/index.html
<div id="outline-container-headline-4" class="outline-4">
<h4 id="headline-4">
Armadilha 1: A Falsa Sensação de Relevância
</h4>
<div id="outline-text-headline-4" class="outline-text-4">
<p>
Uma busca por vizinhos mais próximos sempre retornará algum resultado, mas como saber se é realmente útil? Alguns documentos podem parecer relevantes com base na similaridade vetorial, mas não fornecem o contexto adequado para responder à pergunta do usuário.</p>
<blockquote>
<p><em>Solução</em>: Implementar verificação de relevância pós-recuperação usando <a href="https://huggingface.co/cross-encoder">cross-encoders</a> ou filtros baseados em regras. No <a href="https://www.postgresql.org/">PostgreSQL</a>, podemos fazer isso com:</p>
</blockquote>
<div class="src src-sql">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-sql" data-lang="sql"><span class="line"><span class="cl"><span class="c1">-- Primeiro recuperamos candidatos usando busca vetorial
</span></span></span><span class="line"><span class="cl"><span class="k">WITH</span><span class="w"> </span><span class="n">candidatos</span><span class="w"> </span><span class="k">AS</span><span class="w"> </span><span class="p">(</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">  </span><span class="k">SELECT</span><span class="w"> </span><span class="n">id</span><span class="p">,</span><span class="w"> </span><span class="n">titulo</span><span class="p">,</span><span class="w"> </span><span class="n">conteudo</span><span class="p">,</span><span class="w"> </span><span class="n">embedding</span><span class="w"> </span><span class="o">&lt;=&gt;</span><span class="w"> </span><span class="n">query_embedding</span><span class="w"> </span><span class="k">AS</span><span class="w"> </span><span class="n">distancia</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">  </span><span class="k">FROM</span><span class="w"> </span><span class="n">documentos_embeddings</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">  </span><span class="k">ORDER</span><span class="w"> </span><span class="k">BY</span><span class="w"> </span><span class="n">distancia</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">  </span><span class="k">LIMIT</span><span class="w"> </span><span class="mi">20</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="p">),</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="c1">-- Depois aplicamos filtro secundário para verificar relevância real
</span></span></span><span class="line"><span class="cl"><span class="n">filtrados</span><span class="w"> </span><span class="k">AS</span><span class="w"> </span><span class="p">(</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">  </span><span class="k">SELECT</span><span class="w"> </span><span class="n">id</span><span class="p">,</span><span class="w"> </span><span class="n">titulo</span><span class="p">,</span><span class="w"> </span><span class="n">conteudo</span><span class="p">,</span><span class="w"> </span><span class="n">distancia</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">  </span><span class="k">FROM</span><span class="w"> </span><span class="n">candidatos</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">  </span><span class="k">WHERE</span><span class="w"> 
</span></span></span><span class="line"><span class="cl"><span class="w">    </span><span class="c1">-- Filtro baseado em regras (exemplo: deve conter palavras-chave)
</span></span></span><span class="line"><span class="cl"><span class="w">    </span><span class="n">conteudo</span><span class="w"> </span><span class="k">ILIKE</span><span class="w"> </span><span class="s1">&#39;%&#39;</span><span class="w"> </span><span class="o">||</span><span class="w"> </span><span class="s1">&#39;palavra_chave&#39;</span><span class="w"> </span><span class="o">||</span><span class="w"> </span><span class="s1">&#39;%&#39;</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">    </span><span class="c1">-- Ou usar um modelo secundário para avaliar relevância
</span></span></span><span class="line"><span class="cl"><span class="w">    </span><span class="c1">-- ai.evaluate_relevance(conteudo, &#39;consulta_original&#39;) &gt; 0.7  -- ⚠️ Nota: Função experimental no pgai
</span></span></span><span class="line"><span class="cl"><span class="p">)</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="k">SELECT</span><span class="w"> </span><span class="o">*</span><span class="w"> </span><span class="k">FROM</span><span class="w"> </span><span class="n">filtrados</span><span class="w"> </span><span class="k">ORDER</span><span class="w"> </span><span class="k">BY</span><span class="w"> </span><span class="n">distancia</span><span class="w"> </span><span class="k">LIMIT</span><span class="w"> </span><span class="mi">5</span><span class="p">;</span></span></span></code></pre></div>
</div>
<p>
Este código SQL demonstra uma abordagem de duas fases para melhorar a qualidade da recuperação em sistemas RAG. Na primeira fase, utilizamos a <a href="https://en.wikipedia.org/wiki/Vector_database">busca vetorial</a> para recuperar 20 candidatos iniciais ordenados por <a href="https://en.wikipedia.org/wiki/Vector_database">similaridade vetorial</a> (usando o operador <code>&lt;=&gt;</code> do <a href="https://en.wikipedia.org/wiki/Vector_database">pgvector</a> para calcular a distância entre embeddings). Esta etapa prioriza a velocidade e a amplitude da recuperação.</p>
<p>
Na segunda fase, aplicamos filtros mais refinados para verificar a relevância real dos documentos recuperados. Isso pode incluir filtros baseados em regras (como busca por palavras-chave usando <code>ILIKE</code>) ou até mesmo modelos secundários de avaliação de relevância (como sugerido no comentário sobre a função experimental do <a href="https://github.com/timescale/pgai">pgai</a>). Esta abordagem em duas etapas equilibra eficiência e precisão, permitindo que o sistema primeiro capture um conjunto amplo de candidatos potenciais e depois refine os resultados para apresentar apenas os documentos verdadeiramente relevantes para a consulta do usuário.</p>
</div>
</div>
<div id="outline-container-headline-5" class="outline-4">
<h4 id="headline-5">
Armadilha 2: Tamanho Inadequado de Chunks
</h4>
<div id="outline-text-headline-5" class="outline-text-4">
<p>
Dividir documentos em chunks menores é uma prática padrão, mas qual é o tamanho ideal?</p>
<ul>
<li>Chunks muito pequenos perdem contexto crucial</li>
<li>Chunks muito grandes diluem a recuperação com detalhes irrelevantes</li>
</ul>
<blockquote>
<p><em>Solução</em>: Adaptar a estratégia de chunking ao tipo de conteúdo. No nosso <a href="/post/semantic-postgresql/">PostgreSQL RAG</a>, usamos chunking recursivo:</p>
</blockquote>
<div class="src src-sql">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-sql" data-lang="sql"><span class="line"><span class="cl"><span class="c1">-- Podemos ajustar os parâmetros de chunking para diferentes tipos de documentos
</span></span></span><span class="line"><span class="cl"><span class="k">SELECT</span><span class="w"> </span><span class="n">ai</span><span class="p">.</span><span class="n">create_vectorizer</span><span class="p">(</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">   </span><span class="s1">&#39;documentos_tecnicos&#39;</span><span class="p">::</span><span class="n">regclass</span><span class="p">,</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">   </span><span class="n">destination</span><span class="w"> </span><span class="o">=&gt;</span><span class="w"> </span><span class="s1">&#39;embeddings_tecnicos&#39;</span><span class="p">,</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">   </span><span class="n">embedding</span><span class="w"> </span><span class="o">=&gt;</span><span class="w"> </span><span class="n">ai</span><span class="p">.</span><span class="n">embedding_ollama</span><span class="p">(</span><span class="s1">&#39;nomic-embed-text&#39;</span><span class="p">,</span><span class="w"> </span><span class="mi">768</span><span class="p">),</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">   </span><span class="c1">-- Chunks maiores para documentos técnicos que precisam de mais contexto
</span></span></span><span class="line"><span class="cl"><span class="w">   </span><span class="n">chunking</span><span class="w"> </span><span class="o">=&gt;</span><span class="w"> </span><span class="n">ai</span><span class="p">.</span><span class="n">chunking_recursive_character_text_splitter</span><span class="p">(</span><span class="s1">&#39;conteudo&#39;</span><span class="p">,</span><span class="w"> 
</span></span></span><span class="line"><span class="cl"><span class="w">                                                           </span><span class="n">chunk_size</span><span class="w"> </span><span class="o">=&gt;</span><span class="w"> </span><span class="mi">1500</span><span class="p">,</span><span class="w"> 
</span></span></span><span class="line"><span class="cl"><span class="w">                                                           </span><span class="n">chunk_overlap</span><span class="w"> </span><span class="o">=&gt;</span><span class="w"> </span><span class="mi">200</span><span class="p">)</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="p">);</span></span></span></code></pre></div>
</div>
<p>
Para documentos técnicos, que geralmente contêm informações densas e interconectadas, configuramos chunks maiores (1500 caracteres) com uma sobreposição significativa (200 caracteres). </p>
<p>
Isso permite preservar mais contexto dentro de cada chunk, o que é crucial para a compreensão de conceitos técnicos complexos. O uso do <code>chunking_recursive_character_text_splitter</code> implementa uma estratégia de divisão recursiva que respeita a estrutura natural do texto, enquanto o modelo de embedding <code>nomic-embed-text</code> com 768 dimensões captura as nuances semânticas do conteúdo técnico. Esta <a href="https://en.wikipedia.org/wiki/Chunking_(data_storage">abordagem adaptativa de chunking</a>) é fundamental para equilibrar a granularidade da recuperação com a preservação do contexto necessário para respostas precisas em sistemas <a href="https://en.wikipedia.org/wiki/Retrieval-augmented_generation">RAG</a>.</p>
</div>
</div>
