rag02/index.html
<div id="outline-container-headline-9" class="outline-4">
<h4 id="headline-9">
Re-ranqueamento de Chunks
</h4>
<div id="outline-text-headline-9" class="outline-text-4">
<div class="src src-mermaid">
<pre tabindex="0"><code class="language-mermaid" data-lang="mermaid">flowchart LR
    subgraph &#34;Primeira Fase&#34;
        Q[Consulta] --&gt; EMB[Embedding da Consulta]
        EMB --&gt; SIM[Busca por Similaridade Vetorial]
        DB[(Base Vetorial)] --&gt; SIM
        SIM --&gt; IC[Chunks Iniciais]
    end
    
    subgraph &#34;Re-ranqueamento&#34;
        IC --&gt; PAIR[Pares Consulta-Chunk]
        Q2[Consulta Original] --&gt; PAIR
        PAIR --&gt; CENC[Cross-Encoder]
        CENC --&gt; SCORE[Scores de Relevância]
        SCORE --&gt; SORT[Ordenação por Relevância]
        SORT --&gt; RC[Chunks Re-ranqueados]
    end
    
    IC -.-&gt; |Top-K Chunks| PAIR
    RC --&gt; GEN[Geração de Resposta]
    
    style Q fill:#f9f,stroke:#333,stroke-width:2px
    style Q2 fill:#f9f,stroke:#333,stroke-width:2px
    style CENC fill:#ffc,stroke:#333,stroke-width:2px
    style RC fill:#9f9,stroke:#333,stroke-width:2px
    style GEN fill:#99f,stroke:#333,stroke-width:2px</code></pre>
</div>
<p>
O diagrama acima ilustra o processo de re-ranqueamento em um sistema RAG, dividido em duas fases principais: </p>
<ol>
<li>Na &#34;Primeira Fase&#34;, o fluxo começa com a consulta do usuário que é transformada em um embedding vetorial. Este embedding é então utilizado para realizar uma busca por <a href="https://en.wikipedia.org/wiki/Vector_database">similaridade vetorial</a> na base de dados vetoriais, resultando em um conjunto inicial de chunks relevantes.</li>
<li>A segunda fase, &#34;Re-ranqueamento&#34;, representa o refinamento desses resultados iniciais. Os chunks recuperados são combinados com a consulta original para formar pares consulta-chunk. Estes pares são processados por um <a href="https://en.wikipedia.org/wiki/Cross-encoder">cross-encoder</a>, um modelo especializado que avalia a relevância contextual entre a consulta e cada chunk. O cross-encoder gera scores de relevância que permitem uma ordenação mais precisa, resultando em chunks re-ranqueados que são finalmente utilizados para a geração da resposta final.</li>
</ol>
<p>Esta abordagem em duas etapas combina a eficiência computacional dos embeddings (que permitem busca rápida em grandes bases de dados) com a precisão dos cross-encoders (que capturam melhor as relações semânticas entre consulta e documento), superando as limitações de cada método quando usado isoladamente. Abordagem conceitual de como implementar re-ranqueamento com cross-encoder em Clojure:</p>
<div class="src src-clojure">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-clojure" data-lang="clojure"><span class="line"><span class="cl"><span class="c1">;; Exemplo conceitual de como implementar re-ranqueamento com cross-encoder</span>
</span></span><span class="line"><span class="cl"><span class="p">(</span><span class="kd">defn </span><span class="nv">rerank-results</span>
</span></span><span class="line"><span class="cl">  <span class="s">&#34;Re-classifica resultados usando cross-encoder para melhorar a precisão&#34;</span>
</span></span><span class="line"><span class="cl">  <span class="p">[</span><span class="nv">query</span> <span class="nv">initial-results</span> <span class="nv">n</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">  <span class="p">(</span><span class="k">let </span><span class="p">[</span><span class="c1">;; Em um cenário real, usaríamos uma biblioteca Clojure para acessar modelos</span>
</span></span><span class="line"><span class="cl">        <span class="c1">;; Como o clj-huggingface ou wrapper Java para transformers</span>
</span></span><span class="line"><span class="cl">        <span class="nv">cross-encoder</span> <span class="p">(</span><span class="nf">load-cross-encoder</span> <span class="s">&#34;cross-encoder/ms-marco-MiniLM-L-6-v2&#34;</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        
</span></span><span class="line"><span class="cl">        <span class="c1">;; Preparar pares de consulta-documento para avaliação</span>
</span></span><span class="line"><span class="cl">        <span class="nv">pairs</span> <span class="p">(</span><span class="nb">map </span><span class="p">(</span><span class="k">fn </span><span class="p">[</span><span class="nv">doc</span><span class="p">]</span> <span class="p">[</span><span class="nv">query</span> <span class="p">(</span><span class="ss">:conteudo</span> <span class="nv">doc</span><span class="p">)])</span> <span class="nv">initial-results</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        
</span></span><span class="line"><span class="cl">        <span class="c1">;; Obter scores de relevância do cross-encoder</span>
</span></span><span class="line"><span class="cl">        <span class="nv">scores</span> <span class="p">(</span><span class="nf">predict-with-cross-encoder</span> <span class="nv">cross-encoder</span> <span class="nv">pairs</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        
</span></span><span class="line"><span class="cl">        <span class="c1">;; Associar scores aos resultados originais</span>
</span></span><span class="line"><span class="cl">        <span class="nv">results-with-scores</span> <span class="p">(</span><span class="nf">map-indexed</span> 
</span></span><span class="line"><span class="cl">                              <span class="p">(</span><span class="k">fn </span><span class="p">[</span><span class="nv">idx</span> <span class="nv">doc</span><span class="p">]</span> 
</span></span><span class="line"><span class="cl">                                <span class="p">(</span><span class="nb">assoc doc </span><span class="ss">:relevance_score</span> <span class="p">(</span><span class="nb">nth </span><span class="nv">scores</span> <span class="nv">idx</span><span class="p">)))</span>
</span></span><span class="line"><span class="cl">                              <span class="nv">initial-results</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        
</span></span><span class="line"><span class="cl">        <span class="c1">;; Ordenar por score de relevância (do maior para o menor)</span>
</span></span><span class="line"><span class="cl">        <span class="nv">reranked-results</span> <span class="p">(</span><span class="nb">sort-by </span><span class="ss">:relevance_score</span> <span class="nb">&gt; </span><span class="nv">results-with-scores</span><span class="p">)]</span>
</span></span><span class="line"><span class="cl">    
</span></span><span class="line"><span class="cl">    <span class="c1">;; Retornar apenas os top-n resultados</span>
</span></span><span class="line"><span class="cl">    <span class="p">(</span><span class="nb">take </span><span class="nv">n</span> <span class="nv">reranked-results</span><span class="p">)))</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1">;; Funções auxiliares (implementações dependeriam da biblioteca específica usada)</span>
</span></span><span class="line"><span class="cl"><span class="p">(</span><span class="kd">defn </span><span class="nv">load-cross-encoder</span> <span class="p">[</span><span class="nv">model-name</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">  <span class="c1">;; Carregar modelo cross-encoder usando Java interop ou biblioteca específica</span>
</span></span><span class="line"><span class="cl">  <span class="p">(</span><span class="nb">println </span><span class="s">&#34;Carregando modelo&#34;</span> <span class="nv">model-name</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">  <span class="p">{</span><span class="ss">:model-name</span> <span class="nv">model-name</span><span class="p">})</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="p">(</span><span class="kd">defn </span><span class="nv">predict-with-cross-encoder</span> <span class="p">[</span><span class="nv">model</span> <span class="nv">pairs</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">  <span class="c1">;; Executar predição do cross-encoder nos pares consulta-documento</span>
</span></span><span class="line"><span class="cl">  <span class="c1">;; Retorna um vetor de scores de relevância</span>
</span></span><span class="line"><span class="cl">  <span class="p">(</span><span class="nb">println </span><span class="s">&#34;Avaliando&#34;</span> <span class="p">(</span><span class="nb">count </span><span class="nv">pairs</span><span class="p">)</span> <span class="s">&#34;pares com&#34;</span> <span class="p">(</span><span class="ss">:model-name</span> <span class="nv">model</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">  <span class="p">(</span><span class="nf">vec</span> <span class="p">(</span><span class="nf">repeatedly</span> <span class="p">(</span><span class="nb">count </span><span class="nv">pairs</span><span class="p">)</span> <span class="o">#</span><span class="p">(</span><span class="nf">rand</span><span class="p">))))</span></span></span></code></pre></div>
</div>
<p>
No contexto do <a href="/post/semantic-postgresql/">DocAI com PostgreSQL</a>, podemos implementar isso como:</p>
<div class="src src-clojure">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-clojure" data-lang="clojure"><span class="line"><span class="cl"><span class="c1">;; Exemplo de implementação de re-ranqueamento em Clojure para DocAI</span>
</span></span><span class="line"><span class="cl"><span class="p">(</span><span class="kd">defn </span><span class="nv">rerank-results</span>
</span></span><span class="line"><span class="cl">  <span class="s">&#34;Re-classifica resultados usando cross-encoder&#34;</span>
</span></span><span class="line"><span class="cl">  <span class="p">[</span><span class="nv">query</span> <span class="nv">initial-results</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">  <span class="p">(</span><span class="k">let </span><span class="p">[</span><span class="nv">conn</span> <span class="p">(</span><span class="nf">jdbc/get-connection</span> <span class="nv">db-spec</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="c1">;; Construir array de IDs para consulta SQL</span>
</span></span><span class="line"><span class="cl">        <span class="nv">ids</span> <span class="p">(</span><span class="nf">str/join</span> <span class="s">&#34;,&#34;</span> <span class="p">(</span><span class="nb">map </span><span class="ss">:id</span> <span class="nv">initial-results</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">        <span class="c1">;; Consulta SQL que utiliza função do pgai para re-classificação</span>
</span></span><span class="line"><span class="cl">        <span class="nv">sql</span> <span class="p">(</span><span class="nb">str </span><span class="s">&#34;SELECT d.id, d.titulo, d.conteudo, 
</span></span></span><span class="line"><span class="cl"><span class="s">                 ai.relevance_score(&#39;&#34;</span> <span class="nv">query</span> <span class="s">&#34;&#39;, d.conteudo) AS relevance  -- ⚠️ Nota: Função experimental no pgai
</span></span></span><span class="line"><span class="cl"><span class="s">                 FROM documentos d 
</span></span></span><span class="line"><span class="cl"><span class="s">                 WHERE d.id IN (&#34;</span> <span class="nv">ids</span> <span class="s">&#34;) 
</span></span></span><span class="line"><span class="cl"><span class="s">                 ORDER BY relevance DESC&#34;</span><span class="p">)]</span>
</span></span><span class="line"><span class="cl">    <span class="p">(</span><span class="nf">jdbc/execute!</span> <span class="nv">conn</span> <span class="p">[</span><span class="nv">sql</span><span class="p">])))</span></span></span></code></pre></div>
</div>
<p>
O primeiro código demonstra uma implementação conceitual de re-ranqueamento usando um cross-encoder em Clojure. Ele recebe uma consulta e resultados iniciais, utiliza um modelo cross-encoder para avaliar a relevância de cada documento em relação à consulta, e então reordena os resultados com base nos scores obtidos. As funções auxiliares simulam a integração com modelos de machine learning, embora em um cenário real seria necessário utilizar bibliotecas específicas para acessar modelos de linguagem.</p>
<p>
O segundo exemplo mostra uma implementação mais prática no contexto de um sistema <a href="/post/semantic-postgresql/">DocAI integrado com PostgreSQL</a>. Neste caso, o re-ranqueamento é delegado a uma função SQL (<code>ai.relevance_score</code>) que avalia a relevância entre a consulta e o conteúdo do documento diretamente no banco de dados. Esta abordagem aproveita as capacidades de IA incorporadas no PostgreSQL através de extensões como pgai, simplificando a arquitetura ao mover o processamento de relevância para o banco de dados.</p>
<p>
Ambas as implementações ilustram diferentes estratégias para melhorar a precisão dos resultados em sistemas RAG. A primeira abordagem oferece mais controle e flexibilidade ao processar o re-ranqueamento na aplicação, enquanto a segunda aproveita as capacidades do banco de dados para simplificar a arquitetura e potencialmente melhorar o desempenho ao reduzir a transferência de dados entre a aplicação e o banco de dados. A escolha entre estas abordagens dependerá dos requisitos específicos do sistema, incluindo considerações de desempenho, escalabilidade e facilidade de manutenção.</p>
<hr>
</div>
</div>
