blog/content/post/rag02.org
*** Estratégias de Chunking Dinâmico

Em vez de usar um tamanho fixo para todos os chunks, podemos implementar estratégias dinâmicas que se adaptam ao conteúdo:

- /Chunking Semântico/: Dividir o texto em unidades semanticamente coerentes
- /Chunking Hierárquico/: Manter múltiplas granularidades do mesmo conteúdo
- /Chunking Adaptativo/: Ajustar tamanho com base em características do documento

#+BEGIN_SRC clojure
;; Função conceitual para chunking hierárquico
(defn create-hierarchical-chunks
  "Cria chunks em múltiplos níveis de granularidade"
  [document]
  (let [;; Divisão em parágrafos
        paragraphs (split-paragraphs document)
        ;; Divisão em seções
        sections (split-sections document)
        ;; Documento completo
        full-doc [{:content document :level "document"}]
        ;; Combinar todos os níveis
        all-chunks (concat full-doc
                          (map #(hash-map :content % :level "section") sections)
                          (map #(hash-map :content % :level "paragraph") paragraphs))]
    ;; Inserir no PostgreSQL com metadados sobre o nível
    (doseq [chunk all-chunks]
      (jdbc/execute! db-spec
                    ["INSERT INTO documentos_hierarquicos 
                     (conteudo, nivel_granularidade) VALUES (?, ?)"
                     (:content chunk) (:level chunk)]))))
#+END_SRC

O código acima implementa uma estratégia de [[https://en.wikipedia.org/wiki/Chunking_(data_storage][chunking hierárquico]]) em [[https://clojure.org/][Clojure]], uma técnica avançada para sistemas [[https://en.wikipedia.org/wiki/Retrieval-augmented_generation][RAG]] que mantém múltiplas representações do mesmo conteúdo em diferentes níveis de granularidade. A função ~create-hierarchical-chunks~ divide um documento em três níveis: documento completo, seções e parágrafos, preservando assim tanto o contexto amplo quanto os detalhes específicos. 

Esta abordagem permite que o sistema de recuperação escolha a granularidade mais apropriada dependendo da consulta, oferecendo flexibilidade que um chunking de tamanho fixo não consegue proporcionar.

A implementação utiliza funções auxiliares como ~split-paragraphs~ e ~split-sections~ (não mostradas no código) para segmentar o documento de forma inteligente, respeitando a estrutura semântica do texto. Cada [[https://en.wikipedia.org/wiki/Chunk_(data_storage][chunk]]) é armazenado no [[https://www.postgresql.org/][PostgreSQL]] junto com metadados sobre seu nível de granularidade, permitindo consultas que podem priorizar diferentes níveis dependendo do tipo de pergunta. 

Esta técnica é particularmente valiosa para documentos longos e estruturados, como artigos técnicos ou documentação, onde tanto o contexto geral quanto detalhes específicos podem ser relevantes dependendo da natureza da consulta do usuário.

-----

