rag02/index.html
<div id="outline-container-headline-10" class="outline-4">
<h4 id="headline-10">
Estratégias de Chunking Dinâmico
</h4>
<div id="outline-text-headline-10" class="outline-text-4">
<p>
Em vez de usar um tamanho fixo para todos os chunks, podemos implementar estratégias dinâmicas que se adaptam ao conteúdo:</p>
<ul>
<li><em>Chunking Semântico</em>: Dividir o texto em unidades semanticamente coerentes</li>
<li><em>Chunking Hierárquico</em>: Manter múltiplas granularidades do mesmo conteúdo</li>
<li><em>Chunking Adaptativo</em>: Ajustar tamanho com base em características do documento</li>
</ul>
<div class="src src-clojure">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-clojure" data-lang="clojure"><span class="line"><span class="cl"><span class="c1">;; Função conceitual para chunking hierárquico</span>
</span></span><span class="line"><span class="cl"><span class="p">(</span><span class="kd">defn </span><span class="nv">create-hierarchical-chunks</span>
</span></span><span class="line"><span class="cl">  <span class="s">&#34;Cria chunks em múltiplos níveis de granularidade&#34;</span>
</span></span><span class="line"><span class="cl">  <span class="p">[</span><span class="nv">document</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">  <span class="p">(</span><span class="k">let </span><span class="p">[</span><span class="c1">;; Divisão em parágrafos</span>
</span></span><span class="line"><span class="cl">        <span class="nv">paragraphs</span> <span class="p">(</span><span class="nf">split-paragraphs</span> <span class="nv">document</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="c1">;; Divisão em seções</span>
</span></span><span class="line"><span class="cl">        <span class="nv">sections</span> <span class="p">(</span><span class="nf">split-sections</span> <span class="nv">document</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="c1">;; Documento completo</span>
</span></span><span class="line"><span class="cl">        <span class="nv">full-doc</span> <span class="p">[{</span><span class="ss">:content</span> <span class="nv">document</span> <span class="ss">:level</span> <span class="s">&#34;document&#34;</span><span class="p">}]</span>
</span></span><span class="line"><span class="cl">        <span class="c1">;; Combinar todos os níveis</span>
</span></span><span class="line"><span class="cl">        <span class="nv">all-chunks</span> <span class="p">(</span><span class="nb">concat </span><span class="nv">full-doc</span>
</span></span><span class="line"><span class="cl">                          <span class="p">(</span><span class="nb">map </span><span class="o">#</span><span class="p">(</span><span class="nb">hash-map </span><span class="ss">:content</span> <span class="nv">%</span> <span class="ss">:level</span> <span class="s">&#34;section&#34;</span><span class="p">)</span> <span class="nv">sections</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">                          <span class="p">(</span><span class="nb">map </span><span class="o">#</span><span class="p">(</span><span class="nb">hash-map </span><span class="ss">:content</span> <span class="nv">%</span> <span class="ss">:level</span> <span class="s">&#34;paragraph&#34;</span><span class="p">)</span> <span class="nv">paragraphs</span><span class="p">))]</span>
</span></span><span class="line"><span class="cl">    <span class="c1">;; Inserir no PostgreSQL com metadados sobre o nível</span>
</span></span><span class="line"><span class="cl">    <span class="p">(</span><span class="nb">doseq </span><span class="p">[</span><span class="nv">chunk</span> <span class="nv">all-chunks</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">      <span class="p">(</span><span class="nf">jdbc/execute!</span> <span class="nv">db-spec</span>
</span></span><span class="line"><span class="cl">                    <span class="p">[</span><span class="s">&#34;INSERT INTO documentos_hierarquicos 
</span></span></span><span class="line"><span class="cl"><span class="s">                     (conteudo, nivel_granularidade) VALUES (?, ?)&#34;</span>
</span></span><span class="line"><span class="cl">                     <span class="p">(</span><span class="ss">:content</span> <span class="nv">chunk</span><span class="p">)</span> <span class="p">(</span><span class="ss">:level</span> <span class="nv">chunk</span><span class="p">)]))))</span></span></span></code></pre></div>
</div>
<p>
O código acima implementa uma estratégia de <a href="https://en.wikipedia.org/wiki/Chunking_(data_storage">chunking hierárquico</a>) em <a href="https://clojure.org/">Clojure</a>, uma técnica avançada para sistemas <a href="https://en.wikipedia.org/wiki/Retrieval-augmented_generation">RAG</a> que mantém múltiplas representações do mesmo conteúdo em diferentes níveis de granularidade. A função <code>create-hierarchical-chunks</code> divide um documento em três níveis: documento completo, seções e parágrafos, preservando assim tanto o contexto amplo quanto os detalhes específicos. </p>
<p>
Esta abordagem permite que o sistema de recuperação escolha a granularidade mais apropriada dependendo da consulta, oferecendo flexibilidade que um chunking de tamanho fixo não consegue proporcionar.</p>
<p>
A implementação utiliza funções auxiliares como <code>split-paragraphs</code> e <code>split-sections</code> (não mostradas no código) para segmentar o documento de forma inteligente, respeitando a estrutura semântica do texto. Cada <a href="https://en.wikipedia.org/wiki/Chunk_(data_storage">chunk</a>) é armazenado no <a href="https://www.postgresql.org/">PostgreSQL</a> junto com metadados sobre seu nível de granularidade, permitindo consultas que podem priorizar diferentes níveis dependendo do tipo de pergunta. </p>
<p>
Esta técnica é particularmente valiosa para documentos longos e estruturados, como artigos técnicos ou documentação, onde tanto o contexto geral quanto detalhes específicos podem ser relevantes dependendo da natureza da consulta do usuário.</p>
<hr>
</div>
</div>
