blog/content/post/rag02.org
*** Workflows com Agentes para Consultas Complexas

Para consultas que exigem raciocínio em várias etapas, podemos implementar agentes que decompõem o problema:

#+BEGIN_SRC mermaid
flowchart TB
    Q[Consulta Original] --> AN[Analisador de Consulta]
    AN --> SQ1[Sub-questão 1]
    AN --> SQ2[Sub-questão 2]
    AN --> SQ3[Sub-questão 3]
    
    SQ1 --> R1[RAG Específico 1]
    SQ2 --> R2[RAG Específico 2]
    SQ3 --> R3[RAG Específico 3]
    
    R1 --> A1[Resposta Parcial 1]
    R2 --> A2[Resposta Parcial 2]
    R3 --> A3[Resposta Parcial 3]
    
    A1 --> S[Sintetizador]
    A2 --> S
    A3 --> S
    
    S --> FR[Resposta Final]
    
    style Q fill:#f9f,stroke:#333,stroke-width:2px
    style S fill:#bbf,stroke:#333,stroke-width:2px
    style FR fill:#bfb,stroke:#333,stroke-width:2px
#+END_SRC

Este diagrama ilustra uma arquitetura de [[https://en.wikipedia.org/wiki/Workflow][workflow]] baseada em agentes para processamento de consultas complexas em sistemas [[https://en.wikipedia.org/wiki/Retrieval-augmented_generation][RAG]]. O fluxo começa com uma consulta do usuário que é analisada por um componente [[https://en.wikipedia.org/wiki/Query_parser][Analisador]], responsável por decompor a pergunta original em sub-questões mais específicas e gerenciáveis. Cada sub-questão é então direcionada para um pipeline [[https://en.wikipedia.org/wiki/Retrieval-augmented_generation][RAG]] especializado, permitindo recuperações contextuais mais precisas.

A abordagem [[https://en.wikipedia.org/wiki/Divide_and_conquer_algorithm][divide-e-conquista]] demonstrada no diagrama permite que o sistema lide com perguntas que exigiriam conhecimento de diferentes domínios ou documentos. Cada [[https://en.wikipedia.org/wiki/Retrieval-augmented_generation][RAG]] especializado pode utilizar diferentes bases de conhecimento, estratégias de recuperação ou até mesmo modelos de linguagem otimizados para domínios específicos, resultando em respostas parciais de alta qualidade para cada aspecto da consulta.

O componente Sintetizador atua como o elemento integrador final, combinando as respostas parciais em uma resposta coerente e abrangente. Esta arquitetura modular não apenas melhora a precisão das respostas para consultas complexas, mas também oferece maior transparência no processo de raciocínio, permitindo identificar quais fontes contribuíram para cada parte da resposta final. O resultado é um sistema RAG mais robusto, capaz de lidar com consultas que exigem raciocínio em múltiplas etapas e integração de informações de diversas fontes.

#+BEGIN_SRC clojure
(defn agent-rag-workflow
  "Implementa um workflow de agente para consultas complexas"
  [query]
  (let [;; Passo 1: Analisar a consulta e identificar sub-questões
        sub-questions (analyze-query query)
        ;; Passo 2: Buscar informações para cada sub-questão
        sub-answers (map #(retrieve-and-generate %) sub-questions)
        ;; Passo 3: Sintetizar respostas parciais em uma resposta final
        final-context (str/join "\n\n" sub-answers)
        final-prompt (str "Com base nas seguintes informações:\n\n" 
                         final-context 
                         "\n\nResponda à pergunta original: " query)
        final-answer (generate-response final-prompt)]
    final-answer))

(defn analyze-query
  "Divide uma consulta complexa em sub-questões"
  [query]
  (let [prompt (str "Divida a seguinte pergunta em sub-questões independentes:\n\n" query)
        response (call-ollama-api prompt)
        ;; Parsear a resposta para extrair as sub-questões
        sub-questions (parse-sub-questions response)]
    sub-questions))
#+END_SRC

Uma implementação mais robusta de workflows com agentes envolve várias etapas adicionais. Trataremos deste assunto em um próximo artigo.

-----

