rag02/index.html
<div id="outline-container-headline-11" class="outline-4">
<h4 id="headline-11">
Workflows com Agentes para Consultas Complexas
</h4>
<div id="outline-text-headline-11" class="outline-text-4">
<p>
Para consultas que exigem raciocínio em várias etapas, podemos implementar agentes que decompõem o problema:</p>
<div class="src src-mermaid">
<pre tabindex="0"><code class="language-mermaid" data-lang="mermaid">flowchart TB
    Q[Consulta Original] --&gt; AN[Analisador de Consulta]
    AN --&gt; SQ1[Sub-questão 1]
    AN --&gt; SQ2[Sub-questão 2]
    AN --&gt; SQ3[Sub-questão 3]
    
    SQ1 --&gt; R1[RAG Específico 1]
    SQ2 --&gt; R2[RAG Específico 2]
    SQ3 --&gt; R3[RAG Específico 3]
    
    R1 --&gt; A1[Resposta Parcial 1]
    R2 --&gt; A2[Resposta Parcial 2]
    R3 --&gt; A3[Resposta Parcial 3]
    
    A1 --&gt; S[Sintetizador]
    A2 --&gt; S
    A3 --&gt; S
    
    S --&gt; FR[Resposta Final]
    
    style Q fill:#f9f,stroke:#333,stroke-width:2px
    style S fill:#bbf,stroke:#333,stroke-width:2px
    style FR fill:#bfb,stroke:#333,stroke-width:2px</code></pre>
</div>
<p>
Este diagrama ilustra uma arquitetura de <a href="https://en.wikipedia.org/wiki/Workflow">workflow</a> baseada em agentes para processamento de consultas complexas em sistemas <a href="https://en.wikipedia.org/wiki/Retrieval-augmented_generation">RAG</a>. O fluxo começa com uma consulta do usuário que é analisada por um componente <a href="https://en.wikipedia.org/wiki/Query_parser">Analisador</a>, responsável por decompor a pergunta original em sub-questões mais específicas e gerenciáveis. Cada sub-questão é então direcionada para um pipeline <a href="https://en.wikipedia.org/wiki/Retrieval-augmented_generation">RAG</a> especializado, permitindo recuperações contextuais mais precisas.</p>
<p>
A abordagem <a href="https://en.wikipedia.org/wiki/Divide_and_conquer_algorithm">divide-e-conquista</a> demonstrada no diagrama permite que o sistema lide com perguntas que exigiriam conhecimento de diferentes domínios ou documentos. Cada <a href="https://en.wikipedia.org/wiki/Retrieval-augmented_generation">RAG</a> especializado pode utilizar diferentes bases de conhecimento, estratégias de recuperação ou até mesmo modelos de linguagem otimizados para domínios específicos, resultando em respostas parciais de alta qualidade para cada aspecto da consulta.</p>
<p>
O componente Sintetizador atua como o elemento integrador final, combinando as respostas parciais em uma resposta coerente e abrangente. Esta arquitetura modular não apenas melhora a precisão das respostas para consultas complexas, mas também oferece maior transparência no processo de raciocínio, permitindo identificar quais fontes contribuíram para cada parte da resposta final. O resultado é um sistema RAG mais robusto, capaz de lidar com consultas que exigem raciocínio em múltiplas etapas e integração de informações de diversas fontes.</p>
<div class="src src-clojure">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-clojure" data-lang="clojure"><span class="line"><span class="cl"><span class="p">(</span><span class="kd">defn </span><span class="nv">agent-rag-workflow</span>
</span></span><span class="line"><span class="cl">  <span class="s">&#34;Implementa um workflow de agente para consultas complexas&#34;</span>
</span></span><span class="line"><span class="cl">  <span class="p">[</span><span class="nv">query</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">  <span class="p">(</span><span class="k">let </span><span class="p">[</span><span class="c1">;; Passo 1: Analisar a consulta e identificar sub-questões</span>
</span></span><span class="line"><span class="cl">        <span class="nv">sub-questions</span> <span class="p">(</span><span class="nf">analyze-query</span> <span class="nv">query</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="c1">;; Passo 2: Buscar informações para cada sub-questão</span>
</span></span><span class="line"><span class="cl">        <span class="nv">sub-answers</span> <span class="p">(</span><span class="nb">map </span><span class="o">#</span><span class="p">(</span><span class="nf">retrieve-and-generate</span> <span class="nv">%</span><span class="p">)</span> <span class="nv">sub-questions</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="c1">;; Passo 3: Sintetizar respostas parciais em uma resposta final</span>
</span></span><span class="line"><span class="cl">        <span class="nv">final-context</span> <span class="p">(</span><span class="nf">str/join</span> <span class="s">&#34;\n\n&#34;</span> <span class="nv">sub-answers</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="nv">final-prompt</span> <span class="p">(</span><span class="nb">str </span><span class="s">&#34;Com base nas seguintes informações:\n\n&#34;</span> 
</span></span><span class="line"><span class="cl">                         <span class="nv">final-context</span> 
</span></span><span class="line"><span class="cl">                         <span class="s">&#34;\n\nResponda à pergunta original: &#34;</span> <span class="nv">query</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="nv">final-answer</span> <span class="p">(</span><span class="nf">generate-response</span> <span class="nv">final-prompt</span><span class="p">)]</span>
</span></span><span class="line"><span class="cl">    <span class="nv">final-answer</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="p">(</span><span class="kd">defn </span><span class="nv">analyze-query</span>
</span></span><span class="line"><span class="cl">  <span class="s">&#34;Divide uma consulta complexa em sub-questões&#34;</span>
</span></span><span class="line"><span class="cl">  <span class="p">[</span><span class="nv">query</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">  <span class="p">(</span><span class="k">let </span><span class="p">[</span><span class="nv">prompt</span> <span class="p">(</span><span class="nb">str </span><span class="s">&#34;Divida a seguinte pergunta em sub-questões independentes:\n\n&#34;</span> <span class="nv">query</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="nv">response</span> <span class="p">(</span><span class="nf">call-ollama-api</span> <span class="nv">prompt</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="c1">;; Parsear a resposta para extrair as sub-questões</span>
</span></span><span class="line"><span class="cl">        <span class="nv">sub-questions</span> <span class="p">(</span><span class="nf">parse-sub-questions</span> <span class="nv">response</span><span class="p">)]</span>
</span></span><span class="line"><span class="cl">    <span class="nv">sub-questions</span><span class="p">))</span></span></span></code></pre></div>
</div>
<p>
Uma implementação mais robusta de workflows com agentes envolve várias etapas adicionais. Trataremos deste assunto em um próximo artigo.</p>
<hr>
