blog/content/post/rag02.org
**** Casos de Uso para Workflows de Agentes

Os workflows com agentes são particularmente úteis em cenários como:

- /Pesquisa Científica/: Onde diversas fontes precisam ser consultadas e relacionadas
- /Diagnóstico de Problemas/: Quando é necessário seguir uma árvore de decisão
- /Análise de Documentos Complexos/: Como contratos ou documentação técnica
- /Planejamento Estratégico/: Onde múltiplas dimensões precisam ser consideradas

-----

*** Pipelines Multimodais

Integrar entradas multimodais (texto, imagens, tabelas) em um pipeline RAG pode enriquecer significativamente o contexto:

#+BEGIN_SRC mermaid
flowchart LR
    subgraph "Documento Misto"
    TXT[Texto]
    IMG[Imagens]
    TBL[Tabelas]
    end
    
    subgraph "Processadores Específicos"
    TXT --> TXT_P[Processador de Texto]
    IMG --> IMG_P[Processador de Imagem]
    TBL --> TBL_P[Processador de Tabela]
    end
    
    subgraph "Embeddings"
    TXT_P --> TXT_E[Embedding de Texto]
    IMG_P --> IMG_E[Embedding de Imagem]
    TBL_P --> TBL_E[Embedding de Tabela]
    end
    
    TXT_E --> FUS[Fusão de Representações]
    IMG_E --> FUS
    TBL_E --> FUS
    
    FUS --> DB[(Base de Dados Multimodal)]
    Q[Consulta do Usuário] --> Q_PROC[Processador de Consulta]
    Q_PROC --> RAG[Motor RAG]
    DB --> RAG
    RAG --> RES[Resposta Multimodal]
    
    style TXT fill:#f9f,stroke:#333,stroke-width:2px
    style IMG fill:#9cf,stroke:#333,stroke-width:2px
    style TBL fill:#fcf,stroke:#333,stroke-width:2px
    style FUS fill:#ff9,stroke:#333,stroke-width:2px
    style DB fill:#9f9,stroke:#333,stroke-width:2px
    style RES fill:#f99,stroke:#333,stroke-width:2px
#+END_SRC

O diagrama acima ilustra uma arquitetura de pipeline multimodal para sistemas [[https://en.wikipedia.org/wiki/Retrieval-augmented_generation][RAG]], demonstrando como diferentes tipos de conteúdo (texto, imagens e tabelas) podem ser processados e integrados em um único sistema de recuperação. O fluxo começa com a extração desses diferentes elementos de um documento misto, cada um seguindo para processadores especializados que compreendem as características únicas de cada modalidade.

Na camada de embeddings, cada tipo de conteúdo é transformado em representações vetoriais específicas para sua modalidade - textos são processados por modelos de linguagem, imagens por modelos de visão computacional, e tabelas por processadores estruturados. O componente de fusão de representações é crucial nesta arquitetura, pois combina estas diferentes representações vetoriais em um formato unificado que pode ser armazenado e consultado eficientemente na base de dados multimodal.

Quando uma consulta do usuário é recebida, ela passa pelo processador de consulta que determina quais modalidades são relevantes para a pergunta, e o motor [[https://en.wikipedia.org/wiki/Retrieval-augmented_generation][RAG]] recupera as informações apropriadas da base de dados multimodal. Esta abordagem permite que o sistema forneça respostas enriquecidas que incorporam conhecimento de múltiplas modalidades, resultando em uma experiência mais completa e contextualmente relevante para o usuário, especialmente para consultas que se beneficiam de informações visuais ou estruturadas além do texto puro.

#+BEGIN_SRC clojure
(defn process-multimodal-document
  "Processa um documento que contém texto e imagens"
  [doc-path]
  (let [;; Extrair texto
        text-content (extract-text doc-path)
        ;; Identificar e extrair imagens
        image-paths (extract-images doc-path)
        ;; Gerar descrições para as imagens usando um modelo de visão
        image-descriptions (map #(describe-image %) image-paths)
        ;; Combinar texto e descrições de imagens
        enriched-content (str text-content "\n\n"
                             "O documento contém as seguintes imagens:\n"
                             (str/join "\n" image-descriptions))]
    ;; Inserir no banco de dados
    (jdbc/execute! db-spec
                  ["INSERT INTO documentos (titulo, conteudo) VALUES (?, ?)"
                   (extract-title doc-path) enriched-content])))
#+END_SRC

-----

