rag02/index.html
<div id="outline-container-headline-13" class="outline-5">
<h5 id="headline-13">
Casos de Uso para Workflows de Agentes
</h5>
<div id="outline-text-headline-13" class="outline-text-5">
<p>
Os workflows com agentes são particularmente úteis em cenários como:</p>
<ul>
<li><em>Pesquisa Científica</em>: Onde diversas fontes precisam ser consultadas e relacionadas</li>
<li><em>Diagnóstico de Problemas</em>: Quando é necessário seguir uma árvore de decisão</li>
<li><em>Análise de Documentos Complexos</em>: Como contratos ou documentação técnica</li>
<li><em>Planejamento Estratégico</em>: Onde múltiplas dimensões precisam ser consideradas</li>
</ul>
<hr>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-14" class="outline-4">
<h4 id="headline-14">
Pipelines Multimodais
</h4>
<div id="outline-text-headline-14" class="outline-text-4">
<p>
Integrar entradas multimodais (texto, imagens, tabelas) em um pipeline RAG pode enriquecer significativamente o contexto:</p>
<div class="src src-mermaid">
<pre tabindex="0"><code class="language-mermaid" data-lang="mermaid">flowchart LR
    subgraph &#34;Documento Misto&#34;
    TXT[Texto]
    IMG[Imagens]
    TBL[Tabelas]
    end
    
    subgraph &#34;Processadores Específicos&#34;
    TXT --&gt; TXT_P[Processador de Texto]
    IMG --&gt; IMG_P[Processador de Imagem]
    TBL --&gt; TBL_P[Processador de Tabela]
    end
    
    subgraph &#34;Embeddings&#34;
    TXT_P --&gt; TXT_E[Embedding de Texto]
    IMG_P --&gt; IMG_E[Embedding de Imagem]
    TBL_P --&gt; TBL_E[Embedding de Tabela]
    end
    
    TXT_E --&gt; FUS[Fusão de Representações]
    IMG_E --&gt; FUS
    TBL_E --&gt; FUS
    
    FUS --&gt; DB[(Base de Dados Multimodal)]
    Q[Consulta do Usuário] --&gt; Q_PROC[Processador de Consulta]
    Q_PROC --&gt; RAG[Motor RAG]
    DB --&gt; RAG
    RAG --&gt; RES[Resposta Multimodal]
    
    style TXT fill:#f9f,stroke:#333,stroke-width:2px
    style IMG fill:#9cf,stroke:#333,stroke-width:2px
    style TBL fill:#fcf,stroke:#333,stroke-width:2px
    style FUS fill:#ff9,stroke:#333,stroke-width:2px
    style DB fill:#9f9,stroke:#333,stroke-width:2px
    style RES fill:#f99,stroke:#333,stroke-width:2px</code></pre>
</div>
<p>
O diagrama acima ilustra uma arquitetura de pipeline multimodal para sistemas <a href="https://en.wikipedia.org/wiki/Retrieval-augmented_generation">RAG</a>, demonstrando como diferentes tipos de conteúdo (texto, imagens e tabelas) podem ser processados e integrados em um único sistema de recuperação. O fluxo começa com a extração desses diferentes elementos de um documento misto, cada um seguindo para processadores especializados que compreendem as características únicas de cada modalidade.</p>
<p>
Na camada de embeddings, cada tipo de conteúdo é transformado em representações vetoriais específicas para sua modalidade - textos são processados por modelos de linguagem, imagens por modelos de visão computacional, e tabelas por processadores estruturados. O componente de fusão de representações é crucial nesta arquitetura, pois combina estas diferentes representações vetoriais em um formato unificado que pode ser armazenado e consultado eficientemente na base de dados multimodal.</p>
<p>
Quando uma consulta do usuário é recebida, ela passa pelo processador de consulta que determina quais modalidades são relevantes para a pergunta, e o motor <a href="https://en.wikipedia.org/wiki/Retrieval-augmented_generation">RAG</a> recupera as informações apropriadas da base de dados multimodal. Esta abordagem permite que o sistema forneça respostas enriquecidas que incorporam conhecimento de múltiplas modalidades, resultando em uma experiência mais completa e contextualmente relevante para o usuário, especialmente para consultas que se beneficiam de informações visuais ou estruturadas além do texto puro.</p>
<div class="src src-clojure">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-clojure" data-lang="clojure"><span class="line"><span class="cl"><span class="p">(</span><span class="kd">defn </span><span class="nv">process-multimodal-document</span>
</span></span><span class="line"><span class="cl">  <span class="s">&#34;Processa um documento que contém texto e imagens&#34;</span>
</span></span><span class="line"><span class="cl">  <span class="p">[</span><span class="nv">doc-path</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">  <span class="p">(</span><span class="k">let </span><span class="p">[</span><span class="c1">;; Extrair texto</span>
</span></span><span class="line"><span class="cl">        <span class="nv">text-content</span> <span class="p">(</span><span class="nf">extract-text</span> <span class="nv">doc-path</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="c1">;; Identificar e extrair imagens</span>
</span></span><span class="line"><span class="cl">        <span class="nv">image-paths</span> <span class="p">(</span><span class="nf">extract-images</span> <span class="nv">doc-path</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="c1">;; Gerar descrições para as imagens usando um modelo de visão</span>
</span></span><span class="line"><span class="cl">        <span class="nv">image-descriptions</span> <span class="p">(</span><span class="nb">map </span><span class="o">#</span><span class="p">(</span><span class="nf">describe-image</span> <span class="nv">%</span><span class="p">)</span> <span class="nv">image-paths</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="c1">;; Combinar texto e descrições de imagens</span>
</span></span><span class="line"><span class="cl">        <span class="nv">enriched-content</span> <span class="p">(</span><span class="nb">str </span><span class="nv">text-content</span> <span class="s">&#34;\n\n&#34;</span>
</span></span><span class="line"><span class="cl">                             <span class="s">&#34;O documento contém as seguintes imagens:\n&#34;</span>
</span></span><span class="line"><span class="cl">                             <span class="p">(</span><span class="nf">str/join</span> <span class="s">&#34;\n&#34;</span> <span class="nv">image-descriptions</span><span class="p">))]</span>
</span></span><span class="line"><span class="cl">    <span class="c1">;; Inserir no banco de dados</span>
</span></span><span class="line"><span class="cl">    <span class="p">(</span><span class="nf">jdbc/execute!</span> <span class="nv">db-spec</span>
</span></span><span class="line"><span class="cl">                  <span class="p">[</span><span class="s">&#34;INSERT INTO documentos (titulo, conteudo) VALUES (?, ?)&#34;</span>
</span></span><span class="line"><span class="cl">                   <span class="p">(</span><span class="nf">extract-title</span> <span class="nv">doc-path</span><span class="p">)</span> <span class="nv">enriched-content</span><span class="p">])))</span></span></span></code></pre></div>
</div>
<hr>
