rag02/index.html
<div id="outline-container-headline-15" class="outline-5">
<h5 id="headline-15">
Arquitetura Multimodal Completa
</h5>
<div id="outline-text-headline-15" class="outline-text-5">
<p>
Uma implementação mais completa de pipelines multimodais requer vários componentes especializados:</p>
<div class="src src-mermaid">
<pre tabindex="0"><code class="language-mermaid" data-lang="mermaid">flowchart TD
    DOC[Documento Multimodal] --&gt; DETECT[Detector de Tipo]
    DETECT --&gt; EXTRACT[Extração de Componentes]
    
    EXTRACT --&gt; TX[Componentes de Texto]
    EXTRACT --&gt; IMG[Componentes de Imagem]
    EXTRACT --&gt; TBL[Componentes de Tabela]
    EXTRACT --&gt; AUD[Componentes de Áudio]
    
    TX --&gt; TX_PROC[Processador de Texto]
    IMG --&gt; IMG_PROC[Processador de Imagem]
    TBL --&gt; TBL_PROC[Processador de Tabela]
    AUD --&gt; AUD_PROC[Processador de Áudio]
    
    TX_PROC --&gt; TX_EMB[Embedding de Texto]
    IMG_PROC --&gt; IMG_EMB[Embedding de Imagem]
    TBL_PROC --&gt; TBL_EMB[Embedding de Tabela]
    AUD_PROC --&gt; AUD_EMB[Embedding de Áudio]
    
    TX_EMB --&gt; FUSION[Fusão de Representações]
    IMG_EMB --&gt; FUSION
    TBL_EMB --&gt; FUSION
    AUD_EMB --&gt; FUSION
    
    FUSION --&gt; META[Adição de Metadados]
    META --&gt; STORE[Armazenamento em PostgreSQL]
    
    subgraph &#34;Modelos Específicos&#34;
        TX_PROC -.- TEXT_MODEL[Modelo de Texto]
        IMG_PROC -.- CLIP[CLIP]
        TBL_PROC -.- TABLE_MODEL[Modelo de Tabela]
        AUD_PROC -.- AUDIO_MODEL[Modelo de Áudio]
        FUSION -.- FLAMINGO[Flamingo]
    end
    
    style DOC fill:#f9f,stroke:#333,stroke-width:2px
    style FUSION fill:#ff9,stroke:#333,stroke-width:2px
    style META fill:#9cf,stroke:#333,stroke-width:2px
    style STORE fill:#9f9,stroke:#333,stroke-width:2px</code></pre>
</div>
<p>
O diagrama acima ilustra uma arquitetura para <a href="https://en.wikipedia.org/wiki/Multimodal_AI">processamento de documentos multimodais</a> em sistemas RAG avançados. O fluxo começa com um documento multimodal que passa por um <a href="https://en.wikipedia.org/wiki/Type_detection">detector de tipo</a>, seguido pela <a href="https://en.wikipedia.org/wiki/Component_extraction">extração de componentes</a> que separa o conteúdo em diferentes modalidades: texto, imagem, tabela e áudio. Cada tipo de componente é então direcionado para um processador especializado, projetado para extrair informações significativas específicas daquela modalidade.</p>
<p>
Após o processamento inicial, cada componente é transformado em uma <a href="https://en.wikipedia.org/wiki/Embedding_model">representação vetorial (embedding)</a> usando modelos especializados para cada modalidade - <a href="https://en.wikipedia.org/wiki/Text_embedding">modelos de texto para componentes textuais</a>, <a href="https://en.wikipedia.org/wiki/CLIP">CLIP para imagens</a>, <a href="https://en.wikipedia.org/wiki/Table_embedding">modelos específicos para tabelas</a> e <a href="https://en.wikipedia.org/wiki/Audio_embedding">áudio</a>. Estes embeddings são então combinados através de um processo de fusão de representações, que cria uma compreensão unificada e coerente do documento multimodal, potencialmente utilizando modelos como o <a href="https://www.deepmind.com/blog/tackling-multiple-tasks-with-a-single-visual-language-model">Flamingo</a> que são projetados para integração multimodal.</p>
<p>
A etapa final do pipeline envolve a adição de <a href="https://en.wikipedia.org/wiki/Metadata">metadados estruturados</a> à <a href="https://en.wikipedia.org/wiki/Unified_representation">representação unificada</a> e seu armazenamento em um banco de dados <a href="https://www.postgresql.org/">PostgreSQL</a> otimizado para <a href="https://en.wikipedia.org/wiki/Vector_database">busca vetorial</a> com <a href="https://github.com/pgvector/pgvector">pgvector</a>. </p>
<p>
Esta arquitetura modular permite que o sistema <a href="https://en.wikipedia.org/wiki/Retrieval-augmented_generation">RAG</a> processe eficientemente documentos complexos contendo múltiplos tipos de mídia, mantendo as relações semânticas entre diferentes componentes e possibilitando recuperação mais precisa quando consultado. Os modelos específicos destacados no diagrama (<code>TEXT_MODEL</code>, <code>CLIP</code>, <code>TABLE_MODEL</code>, <code>AUDIO_MODEL</code> e <code>FLAMINGO</code>) representam as tecnologias de ponta que podem ser empregadas em cada etapa do processamento.</p>
<p>
O código abaixo implementa um pipeline avançado para processamento de documentos multimodais em <a href="https://clojure.org/">Clojure</a>, demonstrando uma abordagem sofisticada para lidar com conteúdo heterogêneo em sistemas <a href="https://en.wikipedia.org/wiki/Retrieval-augmented_generation">RAG</a>:</p>
<div class="src src-clojure">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-clojure" data-lang="clojure"><span class="line"><span class="cl"><span class="c1">;; Exemplo de pipeline multimodal mais elaborado</span>
</span></span><span class="line"><span class="cl"><span class="p">(</span><span class="kd">defn </span><span class="nv">advanced-multimodal-processor</span>
</span></span><span class="line"><span class="cl">  <span class="s">&#34;Pipeline completo para processamento multimodal&#34;</span>
</span></span><span class="line"><span class="cl">  <span class="p">[</span><span class="nv">document-path</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">  <span class="p">(</span><span class="k">let </span><span class="p">[</span><span class="c1">;; Determinar tipo de documento</span>
</span></span><span class="line"><span class="cl">        <span class="nv">doc-type</span> <span class="p">(</span><span class="nf">detect-document-type</span> <span class="nv">document-path</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        
</span></span><span class="line"><span class="cl">        <span class="c1">;; Extrair componentes por tipo</span>
</span></span><span class="line"><span class="cl">        <span class="nv">components</span> <span class="p">(</span><span class="nf">case</span> <span class="nv">doc-type</span>
</span></span><span class="line"><span class="cl">                     <span class="ss">:pdf</span> <span class="p">(</span><span class="nf">extract-pdf-components</span> <span class="nv">document-path</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">                     <span class="ss">:doc</span> <span class="p">(</span><span class="nf">extract-doc-components</span> <span class="nv">document-path</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">                     <span class="ss">:webpage</span> <span class="p">(</span><span class="nf">extract-webpage-components</span> <span class="nv">document-path</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">                     <span class="p">(</span><span class="nf">extract-text-components</span> <span class="nv">document-path</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">        
</span></span><span class="line"><span class="cl">        <span class="c1">;; Processar cada componente com seu processador especializado</span>
</span></span><span class="line"><span class="cl">        <span class="nv">processed-components</span> <span class="p">(</span><span class="nb">map </span><span class="nv">process-component</span> <span class="nv">components</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        
</span></span><span class="line"><span class="cl">        <span class="c1">;; Gerar embeddings multimodais</span>
</span></span><span class="line"><span class="cl">        <span class="nv">embeddings</span> <span class="p">(</span><span class="nb">map </span><span class="o">#</span><span class="p">(</span><span class="nf">generate-multimodal-embedding</span> <span class="nv">%</span> <span class="nv">doc-type</span><span class="p">)</span> <span class="nv">processed-components</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        
</span></span><span class="line"><span class="cl">        <span class="c1">;; Criar representação unificada</span>
</span></span><span class="line"><span class="cl">        <span class="nv">unified-representation</span> <span class="p">{</span><span class="ss">:components</span> <span class="nv">processed-components</span>
</span></span><span class="line"><span class="cl">                               <span class="ss">:embeddings</span> <span class="nv">embeddings</span>
</span></span><span class="line"><span class="cl">                               <span class="ss">:metadata</span> <span class="p">{</span><span class="ss">:doc-type</span> <span class="nv">doc-type</span>
</span></span><span class="line"><span class="cl">                                         <span class="ss">:path</span> <span class="nv">document-path</span>
</span></span><span class="line"><span class="cl">                                         <span class="ss">:extracted-at</span> <span class="p">(</span><span class="nf">java.util.Date.</span><span class="p">)}}]</span>
</span></span><span class="line"><span class="cl">    
</span></span><span class="line"><span class="cl">    <span class="c1">;; Armazenar no PostgreSQL com schema adequado para multimodalidade</span>
</span></span><span class="line"><span class="cl">    <span class="p">(</span><span class="nf">store-multimodal-document</span> <span class="nv">unified-representation</span><span class="p">)))</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="p">(</span><span class="kd">defn </span><span class="nv">process-component</span>
</span></span><span class="line"><span class="cl">  <span class="s">&#34;Processa um componente baseado em seu tipo&#34;</span>
</span></span><span class="line"><span class="cl">  <span class="p">[</span><span class="nv">component</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">  <span class="p">(</span><span class="nf">case</span> <span class="p">(</span><span class="ss">:type</span> <span class="nv">component</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="ss">:text</span> <span class="p">(</span><span class="nf">process-text</span> <span class="p">(</span><span class="ss">:content</span> <span class="nv">component</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">    <span class="ss">:image</span> <span class="p">(</span><span class="nf">process-image</span> <span class="p">(</span><span class="ss">:content</span> <span class="nv">component</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">    <span class="ss">:table</span> <span class="p">(</span><span class="nf">process-table</span> <span class="p">(</span><span class="ss">:content</span> <span class="nv">component</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">    <span class="ss">:chart</span> <span class="p">(</span><span class="nf">process-chart</span> <span class="p">(</span><span class="ss">:content</span> <span class="nv">component</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">    <span class="ss">:audio</span> <span class="p">(</span><span class="nf">process-audio</span> <span class="p">(</span><span class="ss">:content</span> <span class="nv">component</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">    <span class="p">(</span><span class="ss">:content</span> <span class="nv">component</span><span class="p">)))</span> <span class="c1">;; Fallback para tipos desconhecidos</span></span></span></code></pre></div>
</div>
<p>
A função principal <code>advanced-multimodal-processor</code> orquestra todo o fluxo, começando pela detecção do tipo de documento, seguida pela extração de componentes específicos para cada formato (PDF, DOC, páginas web), processamento especializado de cada componente, geração de embeddings multimodais e finalmente o armazenamento da representação unificada no PostgreSQL. Esta arquitetura modular permite que o sistema processe de forma inteligente diferentes tipos de mídia dentro do mesmo documento.</p>
<p>
A função auxiliar <code>process-component</code> exemplifica o tratamento especializado para cada modalidade, direcionando o conteúdo para processadores específicos com base no tipo do componente (texto, imagem, tabela, gráfico ou áudio). Esta abordagem granular garante que cada tipo de conteúdo receba o tratamento mais apropriado, maximizando a qualidade da informação extraída e sua representação vetorial. </p>
<p>
O resultado é um sistema <a href="https://en.wikipedia.org/wiki/Retrieval-augmented_generation">RAG</a> verdadeiramente <a href="https://en.wikipedia.org/wiki/Multimodal_AI">multimodal</a>, capaz de compreender e recuperar informações de documentos complexos que combinam texto, elementos visuais e dados estruturados, proporcionando respostas mais completas e contextualmente ricas para as consultas dos usuários.</p>
<hr>
</div>
</div>
