blog/content/post/rag02.org
**** Esquema PostgreSQL para Dados Multimodais

Para armazenar e recuperar eficientemente dados multimodais no PostgreSQL:

#+BEGIN_SRC sql
-- Tabela principal para documentos multimodais
CREATE TABLE documentos_multimodais (
    id SERIAL PRIMARY KEY,
    titulo TEXT NOT NULL,
    doc_type TEXT,
    metadata JSONB,
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP
);

-- Tabela para componentes específicos
CREATE TABLE componentes_documento (
    id SERIAL PRIMARY KEY,
    documento_id INTEGER REFERENCES documentos_multimodais(id) ON DELETE CASCADE,
    tipo_componente TEXT NOT NULL,
    conteudo TEXT,
    posicao INTEGER,
    metadados JSONB
);

-- Tabela para embeddings de texto
CREATE TABLE embeddings_texto (
    id SERIAL PRIMARY KEY,
    componente_id INTEGER REFERENCES componentes_documento(id) ON DELETE CASCADE,
    embedding VECTOR(768)
);

-- Tabela para embeddings de imagem
CREATE TABLE embeddings_imagem (
    id SERIAL PRIMARY KEY,
    componente_id INTEGER REFERENCES componentes_documento(id) ON DELETE CASCADE,
    embedding VECTOR(512)
);
#+END_SRC

Este esquema (scheme) [[https://en.wikipedia.org/wiki/SQL][SQL]] estabelece uma estrutura robusta para armazenar e gerenciar documentos multimodais no [[https://www.postgresql.org/][PostgreSQL]]. A arquitetura é composta por quatro tabelas interconectadas: uma tabela principal (~documentos_multimodais~) que armazena metadados gerais dos documentos, uma tabela para componentes específicos (~componentes_documento~) que fragmenta cada documento em suas partes constituintes (texto, imagens, etc.), e duas tabelas especializadas para armazenar embeddings vetoriais de diferentes modalidades (~embeddings_texto~ e ~embeddings_imagem~). Esta estrutura relacional permite uma organização hierárquica do conteúdo, mantendo a integridade referencial através de chaves estrangeiras.

A separação dos [[https://en.wikipedia.org/wiki/Embedding_model][embeddings]] por tipo de modalidade é particularmente importante, pois diferentes tipos de conteúdo geralmente requerem modelos de embedding distintos com dimensionalidades variadas (768 para texto e 512 para imagens no exemplo). Esta abordagem modular facilita a implementação de consultas multimodais eficientes, permitindo buscas por similaridade em cada modalidade separadamente ou de forma combinada. 

Além disso, o uso de campos [[https://www.postgresql.org/docs/current/datatype-json.html][JSONB]] para metadados oferece flexibilidade para armazenar informações adicionais sem necessidade de alterar o esquema, tornando o sistema adaptável a diferentes tipos de documentos e requisitos de aplicação. Para implementações detalhadas de [[https://en.wikipedia.org/wiki/Retrieval-augmented_generation][RAG]] multimodal, consulte:

- [[https://docs.llamaindex.ai/en/stable/examples/multi_modal/][MultiModal RAG com LlamaIndex]]
- [[https://towardsdatascience.com/a-comprehensive-guide-to-multimodal-rag-ea72c387c6e8][Comprehensive Guide to MultiModal RAG]]
- [[https://huggingface.co/blog/idefics][Projeto IDEFICS para RAG Multimodal]]
- [[https://supabase.com/blog/image-search-using-ai-embeddings][Supabase - Image Search com pgvector]]

-----

**** Desafios de Implementação Multimodal

A implementação de pipelines multimodais traz desafios específicos:

1. /Alinhamento de Representações/: Garantir que diferentes modalidades possam ser comparadas
2. /Gerenciamento de Recursos/: Modelos multimodais são computacionalmente exigentes
3. /Estratégias de Fusão/: Decidir quando fundir informações de diferentes modalidades
   - Fusão Precoce: Combinar antes do embedding
   - Fusão Tardia: Manter embeddings separados e combinar apenas no ranking final

#+BEGIN_QUOTE
No próximo artigo, exploraremos em profundidade como expandir o DocAI para oferecer suporte total a conteúdo multimodal, com exemplos práticos de implementação e otimização de desempenho.
#+END_QUOTE

-----

