blog/content/post/rag02.org
*** Estratégias de Cache

Implementar caching pode reduzir drasticamente a latência e os custos:

#+BEGIN_SRC mermaid
flowchart TD
    Q[Consulta] --> CH1{Cache L1?}
    CH1 -->|Sim| RES1[Resposta do Cache L1]
    CH1 -->|Não| CH2{Cache L2?}
    
    CH2 -->|Sim| RES2[Resposta do Cache L2]
    CH2 -->|Não| CH3{Cache L3?}
    
    CH3 -->|Sim| RES3[Resposta do Cache L3]
    CH3 -->|Não| PROC[Processamento RAG Completo]
    
    PROC --> RES4[Nova Resposta]
    RES4 --> STORE[Armazenar em Cache]
    STORE --> RES[Resposta Final]
    
    RES1 --> RES
    RES2 --> RES
    RES3 --> RES
    
    subgraph "Camadas de Cache"
    CH1
    CH2
    CH3
    end
    
    style Q fill:#f9f,stroke:#333,stroke-width:2px
    style PROC fill:#ffc,stroke:#333,stroke-width:2px
    style RES fill:#9f9,stroke:#333,stroke-width:2px
    style STORE fill:#9cf,stroke:#333,stroke-width:2px
#+END_SRC

O diagrama acima ilustra uma estratégia de cache em múltiplas camadas para sistemas RAG, uma técnica fundamental para otimizar tanto a latência quanto os custos operacionais. A arquitetura implementa três níveis de cache ~(L1, L2 e L3)~, cada um representando diferentes compromissos entre velocidade e abrangência. O cache ~L1~ tipicamente armazena respostas exatas para consultas idênticas, oferecendo resposta instantânea quando há correspondência perfeita. O cache ~L2~ pode armazenar respostas para consultas semanticamente similares, enquanto o cache ~L3~ pode conter resultados parciais como embeddings pré-calculados ou chunks recuperados anteriormente.

Esta abordagem em cascata permite que o sistema evite o processamento [[https://en.wikipedia.org/wiki/Retrieval-Augmented_Generation][RAG]] completo sempre que possível, reduzindo significativamente o tempo de resposta e a carga computacional. Quando uma consulta não encontra correspondência em nenhum nível de cache, apenas então o sistema executa o fluxo completo de [[https://en.wikipedia.org/wiki/Retrieval-Augmented_Generation][RAG]], que inclui geração de embeddings, recuperação de contexto e inferência do [[https://en.wikipedia.org/wiki/Large_language_model][LLM]]. 

#+BEGIN_QUOTE
A nova resposta gerada é então armazenada no cache apropriado para uso futuro, criando um sistema que se torna progressivamente mais eficiente à medida que processa mais consultas. A implementação de uma estratégia de cache multicamada como esta pode reduzir custos operacionais em até 70% em sistemas de produção com padrões de consulta repetitivos.
#+END_QUOTE

Além da economia de recursos, a redução na latência melhora significativamente a experiência do usuário, com respostas quase instantâneas para consultas frequentes. Para maximizar a eficácia, é importante implementar políticas de expiração de cache e estratégias de invalidação para garantir que as informações permaneçam atualizadas, especialmente em domínios onde os dados subjacentes mudam com frequência. Abaixo, um exemplo de implementação de cache de dois níveis em Clojure:

#+BEGIN_SRC clojure
;; Implementação de cache de dois níveis em Clojure
(def embedding-cache (atom {}))
(def response-cache (atom {}))

(defn cached-embed
  "Gera embedding para texto com cache"
  [text]
  (if-let [cached (@embedding-cache text)]
    cached
    (let [embedding (generate-embedding text)]
      (swap! embedding-cache assoc text embedding)
      embedding)))

(defn cached-rag-query
  "Executa consulta RAG com cache"
  [query]
  (if-let [cached (@response-cache query)]
    (do
      (println "Cache hit for query!")
      cached)
    (let [;; Processo RAG normal
          response (full-rag-process query)]
      ;; Armazenar no cache apenas para consultas não-pessoais
      (when (not (personal-query? query))
        (swap! response-cache assoc query response))
      response)))
#+END_SRC

O código acima implementa uma estratégia de cache de dois níveis em [[https://clojure.org/][Clojure]] para otimizar sistemas [[https://en.wikipedia.org/wiki/Retrieval-augmented_generation][RAG]]. O primeiro nível (~embedding-cache~) armazena embeddings já calculados para textos, evitando a regeneração desses vetores que é computacionalmente intensiva. O segundo nível (~response-cache~) armazena respostas completas para consultas anteriores, permitindo retornar resultados instantaneamente quando uma consulta idêntica é feita novamente. 

A função ~cached-embed~ verifica primeiro se o embedding já existe no cache antes de gerá-lo, enquanto ~cached-rag-query~ implementa lógica similar para respostas completas, incluindo uma verificação inteligente para evitar o cache de consultas pessoais.

Em produção com maior escala, esta abordagem poderia ser estendida para utilizar [[https://redis.io/][Redis]] ou outras soluções de cache distribuído, mantendo os mesmos princípios fundamentais. Para o [[https://www.postgresql.org/][PostgreSQL]], podemos implementar [[https://www.postgresql.org/docs/current/pgvector-embeddings.html][cache de embeddings diretamente no banco]]:

#+BEGIN_SRC sql
-- Criar tabela de cache para embeddings de consultas frequentes
CREATE TABLE IF NOT EXISTS query_embedding_cache (
  query_text TEXT PRIMARY KEY,
  embedding VECTOR(768),
  created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
  hit_count INTEGER DEFAULT 1
);

-- Função para obter embedding com cache
CREATE OR REPLACE FUNCTION get_cached_embedding(query TEXT)
RETURNS VECTOR AS $$
DECLARE
  cached_embedding VECTOR(768);
BEGIN
  -- Verificar se existe no cache
  SELECT embedding INTO cached_embedding
  FROM query_embedding_cache
  WHERE query_text = query;
  
  -- Se existe, atualizar contador e retornar
  IF FOUND THEN
    UPDATE query_embedding_cache 
    SET hit_count = hit_count + 1 
    WHERE query_text = query;
    RETURN cached_embedding;
  ELSE
    -- Gerar novo embedding
    cached_embedding := ai.ollama_embed('nomic-embed-text', query);  -- ⚠️ Nota: Verifique a disponibilidade desta função na sua instalação
    
    -- Armazenar no cache
    INSERT INTO query_embedding_cache (query_text, embedding)
    VALUES (query, cached_embedding);
    
    RETURN cached_embedding;
  END IF;
END;
$$ LANGUAGE plpgsql;
#+END_SRC

Este código SQL implementa um sistema de cache para embeddings de consultas no PostgreSQL, otimizando significativamente o desempenho de sistemas RAG em produção. A tabela ~query_embedding_cache~ armazena o texto da consulta como chave primária, junto com seu [[https://www.postgresql.org/docs/current/pgvector-embeddings.html][embedding vetorial]], [[https://www.postgresql.org/docs/current/functions-datetime.html][timestamp de criação]] e um [[https://www.postgresql.org/docs/current/functions-math.html][contador de acessos]]. Esta estrutura não apenas evita o recálculo de embeddings para consultas repetidas, mas também fornece dados valiosos sobre padrões de uso através do campo ~hit_count~.

A função ~get_cached_embedding~ encapsula a lógica de cache com uma interface limpa: quando uma consulta é recebida, ela primeiro verifica se o embedding já existe no cache. Se encontrado, incrementa o contador de acessos e retorna imediatamente o embedding armazenado, economizando o custo computacional da geração de embeddings. Caso contrário, gera um novo embedding usando o modelo 'nomic-embed-text' via [[https://ollama.com/][Ollama]], armazena-o no cache para uso futuro e o retorna.

Esta implementação reduz significativamente a latência para consultas repetidas, diminui a carga nos serviços de embedding, e proporciona uma base para análises de desempenho e otimização contínua. A abordagem é particularmente eficaz em cenários onde os usuários tendem a fazer perguntas semelhantes ou quando o sistema processa grandes volumes de consultas, resultando em economia de recursos computacionais e melhoria na experiência do usuário com respostas mais rápidas.

