rag02/index.html
<div id="outline-container-headline-18" class="outline-4">
<h4 id="headline-18">
Estratégias de Cache
</h4>
<div id="outline-text-headline-18" class="outline-text-4">
<p>
Implementar caching pode reduzir drasticamente a latência e os custos:</p>
<div class="src src-mermaid">
<pre tabindex="0"><code class="language-mermaid" data-lang="mermaid">flowchart TD
    Q[Consulta] --&gt; CH1{Cache L1?}
    CH1 --&gt;|Sim| RES1[Resposta do Cache L1]
    CH1 --&gt;|Não| CH2{Cache L2?}
    
    CH2 --&gt;|Sim| RES2[Resposta do Cache L2]
    CH2 --&gt;|Não| CH3{Cache L3?}
    
    CH3 --&gt;|Sim| RES3[Resposta do Cache L3]
    CH3 --&gt;|Não| PROC[Processamento RAG Completo]
    
    PROC --&gt; RES4[Nova Resposta]
    RES4 --&gt; STORE[Armazenar em Cache]
    STORE --&gt; RES[Resposta Final]
    
    RES1 --&gt; RES
    RES2 --&gt; RES
    RES3 --&gt; RES
    
    subgraph &#34;Camadas de Cache&#34;
    CH1
    CH2
    CH3
    end
    
    style Q fill:#f9f,stroke:#333,stroke-width:2px
    style PROC fill:#ffc,stroke:#333,stroke-width:2px
    style RES fill:#9f9,stroke:#333,stroke-width:2px
    style STORE fill:#9cf,stroke:#333,stroke-width:2px</code></pre>
</div>
<p>
O diagrama acima ilustra uma estratégia de cache em múltiplas camadas para sistemas RAG, uma técnica fundamental para otimizar tanto a latência quanto os custos operacionais. A arquitetura implementa três níveis de cache <code>(L1, L2 e L3)</code>, cada um representando diferentes compromissos entre velocidade e abrangência. O cache <code>L1</code> tipicamente armazena respostas exatas para consultas idênticas, oferecendo resposta instantânea quando há correspondência perfeita. O cache <code>L2</code> pode armazenar respostas para consultas semanticamente similares, enquanto o cache <code>L3</code> pode conter resultados parciais como embeddings pré-calculados ou chunks recuperados anteriormente.</p>
<p>
Esta abordagem em cascata permite que o sistema evite o processamento <a href="https://en.wikipedia.org/wiki/Retrieval-Augmented_Generation">RAG</a> completo sempre que possível, reduzindo significativamente o tempo de resposta e a carga computacional. Quando uma consulta não encontra correspondência em nenhum nível de cache, apenas então o sistema executa o fluxo completo de <a href="https://en.wikipedia.org/wiki/Retrieval-Augmented_Generation">RAG</a>, que inclui geração de embeddings, recuperação de contexto e inferência do <a href="https://en.wikipedia.org/wiki/Large_language_model">LLM</a>. </p>
<blockquote>
<p>A nova resposta gerada é então armazenada no cache apropriado para uso futuro, criando um sistema que se torna progressivamente mais eficiente à medida que processa mais consultas. A implementação de uma estratégia de cache multicamada como esta pode reduzir custos operacionais em até 70% em sistemas de produção com padrões de consulta repetitivos.</p>
</blockquote>
<p>
Além da economia de recursos, a redução na latência melhora significativamente a experiência do usuário, com respostas quase instantâneas para consultas frequentes. Para maximizar a eficácia, é importante implementar políticas de expiração de cache e estratégias de invalidação para garantir que as informações permaneçam atualizadas, especialmente em domínios onde os dados subjacentes mudam com frequência. Abaixo, um exemplo de implementação de cache de dois níveis em Clojure:</p>
<div class="src src-clojure">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-clojure" data-lang="clojure"><span class="line"><span class="cl"><span class="c1">;; Implementação de cache de dois níveis em Clojure</span>
</span></span><span class="line"><span class="cl"><span class="p">(</span><span class="k">def </span><span class="nv">embedding-cache</span> <span class="p">(</span><span class="nf">atom</span> <span class="p">{}))</span>
</span></span><span class="line"><span class="cl"><span class="p">(</span><span class="k">def </span><span class="nv">response-cache</span> <span class="p">(</span><span class="nf">atom</span> <span class="p">{}))</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="p">(</span><span class="kd">defn </span><span class="nv">cached-embed</span>
</span></span><span class="line"><span class="cl">  <span class="s">&#34;Gera embedding para texto com cache&#34;</span>
</span></span><span class="line"><span class="cl">  <span class="p">[</span><span class="nv">text</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">  <span class="p">(</span><span class="nb">if-let </span><span class="p">[</span><span class="nv">cached</span> <span class="p">(</span><span class="o">@</span><span class="nv">embedding-cache</span> <span class="nv">text</span><span class="p">)]</span>
</span></span><span class="line"><span class="cl">    <span class="nv">cached</span>
</span></span><span class="line"><span class="cl">    <span class="p">(</span><span class="k">let </span><span class="p">[</span><span class="nv">embedding</span> <span class="p">(</span><span class="nf">generate-embedding</span> <span class="nv">text</span><span class="p">)]</span>
</span></span><span class="line"><span class="cl">      <span class="p">(</span><span class="nf">swap!</span> <span class="nv">embedding-cache</span> <span class="nb">assoc </span><span class="nv">text</span> <span class="nv">embedding</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">      <span class="nv">embedding</span><span class="p">)))</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="p">(</span><span class="kd">defn </span><span class="nv">cached-rag-query</span>
</span></span><span class="line"><span class="cl">  <span class="s">&#34;Executa consulta RAG com cache&#34;</span>
</span></span><span class="line"><span class="cl">  <span class="p">[</span><span class="nv">query</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">  <span class="p">(</span><span class="nb">if-let </span><span class="p">[</span><span class="nv">cached</span> <span class="p">(</span><span class="o">@</span><span class="nv">response-cache</span> <span class="nv">query</span><span class="p">)]</span>
</span></span><span class="line"><span class="cl">    <span class="p">(</span><span class="nf">do</span>
</span></span><span class="line"><span class="cl">      <span class="p">(</span><span class="nb">println </span><span class="s">&#34;Cache hit for query!&#34;</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">      <span class="nv">cached</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="p">(</span><span class="k">let </span><span class="p">[</span><span class="c1">;; Processo RAG normal</span>
</span></span><span class="line"><span class="cl">          <span class="nv">response</span> <span class="p">(</span><span class="nf">full-rag-process</span> <span class="nv">query</span><span class="p">)]</span>
</span></span><span class="line"><span class="cl">      <span class="c1">;; Armazenar no cache apenas para consultas não-pessoais</span>
</span></span><span class="line"><span class="cl">      <span class="p">(</span><span class="nb">when </span><span class="p">(</span><span class="nb">not </span><span class="p">(</span><span class="nf">personal-query?</span> <span class="nv">query</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">        <span class="p">(</span><span class="nf">swap!</span> <span class="nv">response-cache</span> <span class="nb">assoc </span><span class="nv">query</span> <span class="nv">response</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">      <span class="nv">response</span><span class="p">)))</span></span></span></code></pre></div>
</div>
<p>
O código acima implementa uma estratégia de cache de dois níveis em <a href="https://clojure.org/">Clojure</a> para otimizar sistemas <a href="https://en.wikipedia.org/wiki/Retrieval-augmented_generation">RAG</a>. O primeiro nível (<code>embedding-cache</code>) armazena embeddings já calculados para textos, evitando a regeneração desses vetores que é computacionalmente intensiva. O segundo nível (<code>response-cache</code>) armazena respostas completas para consultas anteriores, permitindo retornar resultados instantaneamente quando uma consulta idêntica é feita novamente. </p>
<p>
A função <code>cached-embed</code> verifica primeiro se o embedding já existe no cache antes de gerá-lo, enquanto <code>cached-rag-query</code> implementa lógica similar para respostas completas, incluindo uma verificação inteligente para evitar o cache de consultas pessoais.</p>
<p>
Em produção com maior escala, esta abordagem poderia ser estendida para utilizar <a href="https://redis.io/">Redis</a> ou outras soluções de cache distribuído, mantendo os mesmos princípios fundamentais. Para o <a href="https://www.postgresql.org/">PostgreSQL</a>, podemos implementar <a href="https://www.postgresql.org/docs/current/pgvector-embeddings.html">cache de embeddings diretamente no banco</a>:</p>
<div class="src src-sql">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-sql" data-lang="sql"><span class="line"><span class="cl"><span class="c1">-- Criar tabela de cache para embeddings de consultas frequentes
</span></span></span><span class="line"><span class="cl"><span class="k">CREATE</span><span class="w"> </span><span class="k">TABLE</span><span class="w"> </span><span class="k">IF</span><span class="w"> </span><span class="k">NOT</span><span class="w"> </span><span class="k">EXISTS</span><span class="w"> </span><span class="n">query_embedding_cache</span><span class="w"> </span><span class="p">(</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">  </span><span class="n">query_text</span><span class="w"> </span><span class="nb">TEXT</span><span class="w"> </span><span class="k">PRIMARY</span><span class="w"> </span><span class="k">KEY</span><span class="p">,</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">  </span><span class="n">embedding</span><span class="w"> </span><span class="n">VECTOR</span><span class="p">(</span><span class="mi">768</span><span class="p">),</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">  </span><span class="n">created_at</span><span class="w"> </span><span class="k">TIMESTAMP</span><span class="w"> </span><span class="k">DEFAULT</span><span class="w"> </span><span class="k">CURRENT_TIMESTAMP</span><span class="p">,</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">  </span><span class="n">hit_count</span><span class="w"> </span><span class="nb">INTEGER</span><span class="w"> </span><span class="k">DEFAULT</span><span class="w"> </span><span class="mi">1</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="p">);</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="c1">-- Função para obter embedding com cache
</span></span></span><span class="line"><span class="cl"><span class="k">CREATE</span><span class="w"> </span><span class="k">OR</span><span class="w"> </span><span class="k">REPLACE</span><span class="w"> </span><span class="k">FUNCTION</span><span class="w"> </span><span class="n">get_cached_embedding</span><span class="p">(</span><span class="n">query</span><span class="w"> </span><span class="nb">TEXT</span><span class="p">)</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="k">RETURNS</span><span class="w"> </span><span class="n">VECTOR</span><span class="w"> </span><span class="k">AS</span><span class="w"> </span><span class="err">$$</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="k">DECLARE</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">  </span><span class="n">cached_embedding</span><span class="w"> </span><span class="n">VECTOR</span><span class="p">(</span><span class="mi">768</span><span class="p">);</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="k">BEGIN</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">  </span><span class="c1">-- Verificar se existe no cache
</span></span></span><span class="line"><span class="cl"><span class="w">  </span><span class="k">SELECT</span><span class="w"> </span><span class="n">embedding</span><span class="w"> </span><span class="k">INTO</span><span class="w"> </span><span class="n">cached_embedding</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">  </span><span class="k">FROM</span><span class="w"> </span><span class="n">query_embedding_cache</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">  </span><span class="k">WHERE</span><span class="w"> </span><span class="n">query_text</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">query</span><span class="p">;</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">  
</span></span></span><span class="line"><span class="cl"><span class="w">  </span><span class="c1">-- Se existe, atualizar contador e retornar
</span></span></span><span class="line"><span class="cl"><span class="w">  </span><span class="k">IF</span><span class="w"> </span><span class="k">FOUND</span><span class="w"> </span><span class="k">THEN</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">    </span><span class="k">UPDATE</span><span class="w"> </span><span class="n">query_embedding_cache</span><span class="w"> 
</span></span></span><span class="line"><span class="cl"><span class="w">    </span><span class="k">SET</span><span class="w"> </span><span class="n">hit_count</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">hit_count</span><span class="w"> </span><span class="o">+</span><span class="w"> </span><span class="mi">1</span><span class="w"> 
</span></span></span><span class="line"><span class="cl"><span class="w">    </span><span class="k">WHERE</span><span class="w"> </span><span class="n">query_text</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">query</span><span class="p">;</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">    </span><span class="k">RETURN</span><span class="w"> </span><span class="n">cached_embedding</span><span class="p">;</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">  </span><span class="k">ELSE</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">    </span><span class="c1">-- Gerar novo embedding
</span></span></span><span class="line"><span class="cl"><span class="w">    </span><span class="n">cached_embedding</span><span class="w"> </span><span class="p">:</span><span class="o">=</span><span class="w"> </span><span class="n">ai</span><span class="p">.</span><span class="n">ollama_embed</span><span class="p">(</span><span class="s1">&#39;nomic-embed-text&#39;</span><span class="p">,</span><span class="w"> </span><span class="n">query</span><span class="p">);</span><span class="w">  </span><span class="c1">-- ⚠️ Nota: Verifique a disponibilidade desta função na sua instalação
</span></span></span><span class="line"><span class="cl"><span class="w">    
</span></span></span><span class="line"><span class="cl"><span class="w">    </span><span class="c1">-- Armazenar no cache
</span></span></span><span class="line"><span class="cl"><span class="w">    </span><span class="k">INSERT</span><span class="w"> </span><span class="k">INTO</span><span class="w"> </span><span class="n">query_embedding_cache</span><span class="w"> </span><span class="p">(</span><span class="n">query_text</span><span class="p">,</span><span class="w"> </span><span class="n">embedding</span><span class="p">)</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">    </span><span class="k">VALUES</span><span class="w"> </span><span class="p">(</span><span class="n">query</span><span class="p">,</span><span class="w"> </span><span class="n">cached_embedding</span><span class="p">);</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">    
</span></span></span><span class="line"><span class="cl"><span class="w">    </span><span class="k">RETURN</span><span class="w"> </span><span class="n">cached_embedding</span><span class="p">;</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="w">  </span><span class="k">END</span><span class="w"> </span><span class="k">IF</span><span class="p">;</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="k">END</span><span class="p">;</span><span class="w">
</span></span></span><span class="line"><span class="cl"><span class="err">$$</span><span class="w"> </span><span class="k">LANGUAGE</span><span class="w"> </span><span class="n">plpgsql</span><span class="p">;</span></span></span></code></pre></div>
</div>
<p>
Este código SQL implementa um sistema de cache para embeddings de consultas no PostgreSQL, otimizando significativamente o desempenho de sistemas RAG em produção. A tabela <code>query_embedding_cache</code> armazena o texto da consulta como chave primária, junto com seu <a href="https://www.postgresql.org/docs/current/pgvector-embeddings.html">embedding vetorial</a>, <a href="https://www.postgresql.org/docs/current/functions-datetime.html">timestamp de criação</a> e um <a href="https://www.postgresql.org/docs/current/functions-math.html">contador de acessos</a>. Esta estrutura não apenas evita o recálculo de embeddings para consultas repetidas, mas também fornece dados valiosos sobre padrões de uso através do campo <code>hit_count</code>.</p>
<p>
A função <code>get_cached_embedding</code> encapsula a lógica de cache com uma interface limpa: quando uma consulta é recebida, ela primeiro verifica se o embedding já existe no cache. Se encontrado, incrementa o contador de acessos e retorna imediatamente o embedding armazenado, economizando o custo computacional da geração de embeddings. Caso contrário, gera um novo embedding usando o modelo &#39;nomic-embed-text&#39; via <a href="https://ollama.com/">Ollama</a>, armazena-o no cache para uso futuro e o retorna.</p>
<p>
Esta implementação reduz significativamente a latência para consultas repetidas, diminui a carga nos serviços de embedding, e proporciona uma base para análises de desempenho e otimização contínua. A abordagem é particularmente eficaz em cenários onde os usuários tendem a fazer perguntas semelhantes ou quando o sistema processa grandes volumes de consultas, resultando em economia de recursos computacionais e melhoria na experiência do usuário com respostas mais rápidas.</p>
