rag02/index.html
<div id="outline-container-headline-19" class="outline-5">
<h5 id="headline-19">
Estratégias Avançadas de Cache para RAG
</h5>
<div id="outline-text-headline-19" class="outline-text-5">
<p>
Para sistemas RAG em produção, podemos implementar estratégias de cache mais sofisticadas:</p>
<ol>
<li>
<p><a href="https://en.wikipedia.org/wiki/Multilevel_cache"><em>Cache em Múltiplas Camadas</em></a>:</p>
<ul>
<li>L1: Cache em memória para consultas muito frequentes</li>
<li>L2: Cache em banco de dados para persistência entre reinicializações</li>
<li>L3: Cache distribuído (como <a href="https://redis.io/">Redis</a>) para sistemas escaláveis</li>
</ul>
</li>
<li>
<p><a href="https://en.wikipedia.org/wiki/Time_to_live"><em>Políticas de Expiração Inteligentes</em></a>:</p>
<ul>
<li>TTL (Time-to-Live) baseado na frequência de uso</li>
<li>Invalidação seletiva quando documentos relacionados são atualizados</li>
<li>Cache semântico que agrupa consultas similares</li>
</ul>
</li>
<li>
<p><em>Pré-Computação e Cache Preditivo</em>:</p>
<ul>
<li>Analisar padrões de consulta para pré-computar respostas prováveis</li>
<li>Gerar embeddings para variações comuns de consultas</li>
</ul>
</li>
</ol>
<div class="src src-clojure">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-clojure" data-lang="clojure"><span class="line"><span class="cl"><span class="c1">;; Exemplo de implementação de cache com Redis para alta disponibilidade</span>
</span></span><span class="line"><span class="cl"><span class="p">(</span><span class="kd">defn </span><span class="nv">distributed-cached-rag-query</span>
</span></span><span class="line"><span class="cl">  <span class="s">&#34;Executa consulta RAG com cache distribuído&#34;</span>
</span></span><span class="line"><span class="cl">  <span class="p">[</span><span class="nv">query</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">  <span class="p">(</span><span class="k">let </span><span class="p">[</span><span class="nv">cache-key</span> <span class="p">(</span><span class="nb">str </span><span class="s">&#34;rag:query:&#34;</span> <span class="p">(</span><span class="nf">digest/md5</span> <span class="nv">query</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">        <span class="c1">;; Verificar no Redis</span>
</span></span><span class="line"><span class="cl">        <span class="nv">cached-response</span> <span class="p">(</span><span class="nf">redis/get</span> <span class="nv">cache-key</span><span class="p">)]</span>
</span></span><span class="line"><span class="cl">    <span class="p">(</span><span class="k">if </span><span class="nv">cached-response</span>
</span></span><span class="line"><span class="cl">      <span class="c1">;; Usar resposta em cache</span>
</span></span><span class="line"><span class="cl">      <span class="p">(</span><span class="nf">do</span>
</span></span><span class="line"><span class="cl">        <span class="p">(</span><span class="nf">redis/incr</span> <span class="p">(</span><span class="nb">str </span><span class="nv">cache-key</span> <span class="s">&#34;:hits&#34;</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">        <span class="p">(</span><span class="nf">json/read-str</span> <span class="nv">cached-response</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">      <span class="c1">;; Gerar nova resposta</span>
</span></span><span class="line"><span class="cl">      <span class="p">(</span><span class="k">let </span><span class="p">[</span><span class="nv">response</span> <span class="p">(</span><span class="nf">full-rag-process</span> <span class="nv">query</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">            <span class="c1">;; Serializar e armazenar no Redis com TTL</span>
</span></span><span class="line"><span class="cl">            <span class="nv">_</span> <span class="p">(</span><span class="nf">redis/setex</span> <span class="nv">cache-key</span> 
</span></span><span class="line"><span class="cl">                          <span class="p">(</span><span class="nb">* </span><span class="mi">60</span> <span class="mi">60</span> <span class="mi">24</span><span class="p">)</span> <span class="c1">;; 24 horas</span>
</span></span><span class="line"><span class="cl">                          <span class="p">(</span><span class="nf">json/write-str</span> <span class="nv">response</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">            <span class="c1">;; Registrar metadados para análise</span>
</span></span><span class="line"><span class="cl">            <span class="nv">_</span> <span class="p">(</span><span class="nf">redis/hmset</span> <span class="p">(</span><span class="nb">str </span><span class="nv">cache-key</span> <span class="s">&#34;:meta&#34;</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">                          <span class="p">{</span><span class="s">&#34;timestamp&#34;</span> <span class="p">(</span><span class="nf">System/currentTimeMillis</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">                           <span class="s">&#34;query_length&#34;</span> <span class="p">(</span><span class="nb">count </span><span class="nv">query</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">                           <span class="s">&#34;query_type&#34;</span> <span class="p">(</span><span class="nf">determine-query-type</span> <span class="nv">query</span><span class="p">)})]</span>
</span></span><span class="line"><span class="cl">        <span class="nv">response</span><span class="p">))))</span></span></span></code></pre></div>
</div>
<p>
Para implementações detalhadas de estratégias de cache para RAG, consulte:</p>
<ul>
<li><a href="https://docs.llamaindex.ai/en/stable/module_guides/querying/query_engine/query_engine_caching">LlamaIndex - Query Engine Caching</a></li>
<li><a href="https://python.langchain.com/docs/modules/model_io/llms/llm_caching">LangChain - Caching para LLM Applications</a></li>
<li><a href="https://redis.io/docs/stack/search/reference/vectors/">Redis Vector Database for RAG</a></li>
</ul>
<hr>
</div>
</div>
</div>
</div>
</div>
</div>
