blog/content/post/rag02.org
** Monitoramento e Métricas: LLMOps na Prática

Para garantir que nosso sistema RAG continue funcionando bem em produção, precisamos monitorar métricas chave:

#+BEGIN_SRC mermaid
flowchart TB
    subgraph "Ciclo de Monitoramento RAG"
    direction TB
    LOG[Logs de Interações] --> METR[Cálculo de Métricas]
    METR --> ANOM[Detecção de Anomalias]
    ANOM --> ALER[Alertas e Relatórios]
    ALER --> OPT[Otimização do Sistema]
    OPT --> LOG
    end
    
    subgraph "Métricas RAG"
    direction LR
    METR_OP[Métricas Operacionais]
    METR_Q[Métricas de Qualidade]
    METR_F[Métricas de Feedback]
    end
    
    METR --- METR_OP
    METR --- METR_Q
    METR --- METR_F
    
    style LOG fill:#f9f,stroke:#333,stroke-width:2px
    style METR fill:#ffc,stroke:#333,stroke-width:2px
    style ANOM fill:#f99,stroke:#333,stroke-width:2px
    style OPT fill:#9f9,stroke:#333,stroke-width:2px
#+END_SRC

O diagrama acima ilustra o ciclo completo de [[https://en.wikipedia.org/wiki/Monitoring][monitoramento]] para [[https://en.wikipedia.org/wiki/Retrieval-augmented_generation][sistemas RAG]] em produção. No centro do processo estão os "[[https://en.wikipedia.org/wiki/Log_file][Logs de Interações]]", que capturam dados detalhados sobre cada [[https://en.wikipedia.org/wiki/Query][consulta]] processada pelo sistema, incluindo a pergunta original, os [[https://en.wikipedia.org/wiki/Information_retrieval][documentos recuperados]], a [[https://en.wikipedia.org/wiki/Natural_language_generation][resposta gerada]] e [[https://en.wikipedia.org/wiki/Performance_metric][métricas de desempenho]]. 

Estes logs alimentam o "[[https://en.wikipedia.org/wiki/Metric_(mathematics][Cálculo de Métricas]])", que transforma [[https://en.wikipedia.org/wiki/Raw_data][dados brutos]] em [[https://en.wikipedia.org/wiki/Key_performance_indicator][indicadores acionáveis]] distribuídos em três categorias principais: [[https://en.wikipedia.org/wiki/Operational_efficiency][operacionais]] ([[https://en.wikipedia.org/wiki/Latency_(engineering][latência]]), [[https://en.wikipedia.org/wiki/Throughput][throughput]]), [[https://en.wikipedia.org/wiki/Data_quality][qualidade]] ([[https://en.wikipedia.org/wiki/Precision_and_recall][precisão]], [[https://en.wikipedia.org/wiki/Relevance_(information_retrieval][relevância]])) e [[https://en.wikipedia.org/wiki/Feedback][feedback]] (avaliações dos usuários). A "[[https://en.wikipedia.org/wiki/Anomaly_detection][Detecção de Anomalias]]" monitora continuamente estas métricas para identificar desvios significativos dos padrões esperados, gerando "[[https://en.wikipedia.org/wiki/Alert_management][Alertas e Relatórios]]" que orientam a "[[https://en.wikipedia.org/wiki/System_optimization][Otimização do Sistema]]", fechando assim o ciclo de [[https://en.wikipedia.org/wiki/Continuous_improvement][melhoria contínua]].

Este fluxo de trabalho representa a essência do [[https://en.wikipedia.org/wiki/MLOps][LLMOps]] aplicado a sistemas RAG, onde o monitoramento não é apenas [[https://en.wikipedia.org/wiki/Reactive_programming][reativo]], mas [[https://en.wikipedia.org/wiki/Proactive][proativo]] na identificação de oportunidades de melhoria. A estrutura tripartite das métricas garante uma [[https://en.wikipedia.org/wiki/Holism][visão holística]] do desempenho: enquanto as métricas operacionais asseguram a [[https://en.wikipedia.org/wiki/Technical_efficiency][eficiência técnica]] do sistema, as métricas de qualidade avaliam a [[https://en.wikipedia.org/wiki/Semantic_similarity][precisão semântica]] das respostas, e as métricas de feedback incorporam a [[https://en.wikipedia.org/wiki/Human-centered_design][perspectiva humana]] na avaliação. 

Esta abordagem [[https://en.wikipedia.org/wiki/System_integration][integrada]] permite que [[https://en.wikipedia.org/wiki/Engineering_team][equipes de engenharia]] identifiquem rapidamente [[https://en.wikipedia.org/wiki/Bottleneck_(software][gargalos]]), ajustem [[https://en.wikipedia.org/wiki/Information_retrieval][parâmetros de recuperação]] e melhorem continuamente a [[https://en.wikipedia.org/wiki/User_experience][experiência do usuário]] final, mesmo à medida que o [[https://en.wikipedia.org/wiki/Big_data][volume de dados]] e a [[https://en.wikipedia.org/wiki/Query_complexity][complexidade das consultas]] aumentam. O código abaixo mostra como implementar o log e a avaliação de respostas em [[https://en.wikipedia.org/wiki/Clojure][Clojure]]:

#+BEGIN_SRC clojure
;; Estrutura para log e avaliação de respostas
(defn log-rag-interaction
  "Registra uma interação RAG para análise posterior"
  [query retrieved-docs response latency]
  (jdbc/execute! db-spec
                ["INSERT INTO rag_logs 
                 (query, retrieved_docs, response, latency_ms, timestamp)
                 VALUES (?, ?, ?, ?, CURRENT_TIMESTAMP)"
                 query
                 (json/write-str retrieved-docs)
                 response
                 latency]))

;; Função para calcular métricas de desempenho
(defn calculate-rag-metrics
  "Calcula métricas de desempenho para um período"
  [start-date end-date]
  (let [logs (jdbc/execute! db-spec
                           ["SELECT * FROM rag_logs 
                            WHERE timestamp BETWEEN ? AND ?"
                            start-date end-date])
        ;; Métricas de latência
        avg-latency (average-latency logs)
        p95-latency (percentile-latency logs 95)
        ;; Taxa de falhas (quando resposta contém erros específicos)
        failure-rate (failure-rate logs)
        ;; Distribuição de consultas por tópico
        topic-distribution (topic-distribution logs)]
    {:avg_latency avg-latency
     :p95_latency p95-latency
     :failure_rate failure-rate
     :topic_distribution topic-distribution}))
#+END_SRC

A função ~log-rag-interaction~ captura cada aspecto da interação desde a consulta original até os documentos recuperados, a resposta gerada e o tempo de latência armazenando-os em um banco de dados relacional para análise posterior. Esta abordagem permite rastrear o histórico completo de interações, criando um registro valioso para depuração, otimização e avaliação de desempenho ao longo do tempo.

A função ~calculate-rag-metrics~ complementa o sistema de logging ao transformar os dados brutos em métricas acionáveis, calculando indicadores críticos como latência média, percentil 95 de latência (importante para entender outliers), taxa de falhas e distribuição de consultas por tópico. 

Esta análise multidimensional permite que as equipes identifiquem não apenas problemas técnicos (como gargalos de desempenho), mas também padrões de uso e áreas temáticas que podem requerer otimização específica. A combinação destas duas funções estabelece um ciclo de feedback contínuo que é essencial para [[https://en.wikipedia.org/wiki/Retrieval-Augmented_Generation][sistemas RAG em produção]], permitindo melhorias iterativas baseadas em dados reais de uso.

