blog/content/post/rag02.org
*** Métricas de Qualidade Específicas para RAG

Além das métricas operacionais comuns (latência, disponibilidade), sistemas RAG requerem métricas específicas para avaliar a qualidade das respostas:

**** 1. Métricas de Relevância do Contexto

- /Precision@K/: Proporção de chunks recuperados que são realmente relevantes para a consulta
- /Recall@K/: Proporção de chunks relevantes na base de conhecimento que foram recuperados
- /NDCG (Normalized Discounted Cumulative Gain)/: Avalia se os chunks mais relevantes estão no topo da lista

Abaixo, um exemplo de implementação de métricas de relevância do contexto em Clojure:

#+BEGIN_SRC clojure
(defn calculate-precision-at-k
  "Calcula Precision@K para uma consulta e seus chunks recuperados"
  [query chunks k expert-judgments]
  (let [retrieved-top-k (take k chunks)
        relevant-count (count (filter #(is-chunk-relevant? % query expert-judgments) 
                                     retrieved-top-k))]
    (double (/ relevant-count (min k (count retrieved-top-k))))))

(defn calculate-recall-at-k
  "Calcula Recall@K para uma consulta"
  [query chunks k all-relevant-chunks expert-judgments]
  (let [retrieved-top-k (take k chunks)
        retrieved-relevant (filter #(is-chunk-relevant? % query expert-judgments) 
                                  retrieved-top-k)
        total-relevant-count (count all-relevant-chunks)]
    (if (pos? total-relevant-count)
      (double (/ (count retrieved-relevant) total-relevant-count))
      1.0))) ;; Se não há chunks relevantes, recall é 1
#+END_SRC

A função ~calculate-precision-at-k~ mede a proporção de chunks relevantes entre os ~k~ primeiros resultados recuperados, comparando-os com julgamentos de especialistas. Já a função ~calculate-recall-at-k~ avalia a proporção de chunks relevantes que foram efetivamente recuperados em relação ao total de chunks relevantes disponíveis. 

Ambas as métricas são fundamentais para entender a eficácia do sistema de recuperação: ~precision~ indica quão precisa é a recuperação (minimizando falsos positivos), enquanto ~recall~ mostra quão completa é a recuperação (minimizando falsos negativos). A implementação inclui tratamento para casos especiais, como quando não há chunks relevantes disponíveis, garantindo resultados matematicamente consistentes. 

