rag02/index.html
<div id="outline-container-headline-21" class="outline-4">
<h4 id="headline-21">
Métricas de Qualidade Específicas para RAG
</h4>
<div id="outline-text-headline-21" class="outline-text-4">
<p>
Além das métricas operacionais comuns (latência, disponibilidade), sistemas RAG requerem métricas específicas para avaliar a qualidade das respostas:</p>
<div id="outline-container-headline-22" class="outline-5">
<h5 id="headline-22">
1. Métricas de Relevância do Contexto
</h5>
<div id="outline-text-headline-22" class="outline-text-5">
<ul>
<li><em>Precision@K</em>: Proporção de chunks recuperados que são realmente relevantes para a consulta</li>
<li><em>Recall@K</em>: Proporção de chunks relevantes na base de conhecimento que foram recuperados</li>
<li><em>NDCG (Normalized Discounted Cumulative Gain)</em>: Avalia se os chunks mais relevantes estão no topo da lista</li>
</ul>
<p>Abaixo, um exemplo de implementação de métricas de relevância do contexto em Clojure:</p>
<div class="src src-clojure">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-clojure" data-lang="clojure"><span class="line"><span class="cl"><span class="p">(</span><span class="kd">defn </span><span class="nv">calculate-precision-at-k</span>
</span></span><span class="line"><span class="cl">  <span class="s">&#34;Calcula Precision@K para uma consulta e seus chunks recuperados&#34;</span>
</span></span><span class="line"><span class="cl">  <span class="p">[</span><span class="nv">query</span> <span class="nv">chunks</span> <span class="nv">k</span> <span class="nv">expert-judgments</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">  <span class="p">(</span><span class="k">let </span><span class="p">[</span><span class="nv">retrieved-top-k</span> <span class="p">(</span><span class="nb">take </span><span class="nv">k</span> <span class="nv">chunks</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="nv">relevant-count</span> <span class="p">(</span><span class="nb">count </span><span class="p">(</span><span class="nb">filter </span><span class="o">#</span><span class="p">(</span><span class="nf">is-chunk-relevant?</span> <span class="nv">%</span> <span class="nv">query</span> <span class="nv">expert-judgments</span><span class="p">)</span> 
</span></span><span class="line"><span class="cl">                                     <span class="nv">retrieved-top-k</span><span class="p">))]</span>
</span></span><span class="line"><span class="cl">    <span class="p">(</span><span class="nb">double </span><span class="p">(</span><span class="nb">/ </span><span class="nv">relevant-count</span> <span class="p">(</span><span class="nb">min </span><span class="nv">k</span> <span class="p">(</span><span class="nb">count </span><span class="nv">retrieved-top-k</span><span class="p">))))))</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="p">(</span><span class="kd">defn </span><span class="nv">calculate-recall-at-k</span>
</span></span><span class="line"><span class="cl">  <span class="s">&#34;Calcula Recall@K para uma consulta&#34;</span>
</span></span><span class="line"><span class="cl">  <span class="p">[</span><span class="nv">query</span> <span class="nv">chunks</span> <span class="nv">k</span> <span class="nv">all-relevant-chunks</span> <span class="nv">expert-judgments</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">  <span class="p">(</span><span class="k">let </span><span class="p">[</span><span class="nv">retrieved-top-k</span> <span class="p">(</span><span class="nb">take </span><span class="nv">k</span> <span class="nv">chunks</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="nv">retrieved-relevant</span> <span class="p">(</span><span class="nb">filter </span><span class="o">#</span><span class="p">(</span><span class="nf">is-chunk-relevant?</span> <span class="nv">%</span> <span class="nv">query</span> <span class="nv">expert-judgments</span><span class="p">)</span> 
</span></span><span class="line"><span class="cl">                                  <span class="nv">retrieved-top-k</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="nv">total-relevant-count</span> <span class="p">(</span><span class="nb">count </span><span class="nv">all-relevant-chunks</span><span class="p">)]</span>
</span></span><span class="line"><span class="cl">    <span class="p">(</span><span class="k">if </span><span class="p">(</span><span class="nb">pos? </span><span class="nv">total-relevant-count</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">      <span class="p">(</span><span class="nb">double </span><span class="p">(</span><span class="nb">/ </span><span class="p">(</span><span class="nb">count </span><span class="nv">retrieved-relevant</span><span class="p">)</span> <span class="nv">total-relevant-count</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">      <span class="mf">1.0</span><span class="p">)))</span> <span class="c1">;; Se não há chunks relevantes, recall é 1</span></span></span></code></pre></div>
</div>
<p>
A função <code>calculate-precision-at-k</code> mede a proporção de chunks relevantes entre os <code>k</code> primeiros resultados recuperados, comparando-os com julgamentos de especialistas. Já a função <code>calculate-recall-at-k</code> avalia a proporção de chunks relevantes que foram efetivamente recuperados em relação ao total de chunks relevantes disponíveis. </p>
<p>
Ambas as métricas são fundamentais para entender a eficácia do sistema de recuperação: <code>precision</code> indica quão precisa é a recuperação (minimizando falsos positivos), enquanto <code>recall</code> mostra quão completa é a recuperação (minimizando falsos negativos). A implementação inclui tratamento para casos especiais, como quando não há chunks relevantes disponíveis, garantindo resultados matematicamente consistentes. </p>
</div>
</div>
