blog/content/post/rag02.org
**** 2. Métricas de Qualidade da Resposta

Para avaliar a qualidade das respostas geradas por sistemas RAG, é essencial implementar métricas específicas que capturem diferentes dimensões de eficácia. Estas métricas vão além de simples avaliações binárias (correto/incorreto) e permitem uma análise nuançada da performance do sistema. Implementamos as seguintes métricas qualitativas em nosso framework de avaliação:

- /Faithfulness (Fidelidade)/: O grau em que a resposta é suportada pelo contexto fornecido, sem alucinações
- /Answer Relevancy (Relevância da Resposta)/: Quão bem a resposta aborda a consulta do usuário
- /Contextual Precision (Precisão Contextual)/: Proporção do contexto utilizado que foi relevante para a resposta
- /Helpfulness (Utilidade)/: Avaliação subjetiva de quão útil foi a resposta para o usuário

Abaixo, um exemplo de implementação de métricas de qualidade da resposta em Clojure:

#+BEGIN_SRC clojure
(defn evaluate-response-quality
  "Avalia métricas qualitativas de uma resposta RAG"
  [query context response]
  (let [;; Usar LLM como avaliador
        prompt-faithfulness (str "Avalie a fidelidade da seguinte resposta ao contexto fornecido.\n\n"
                                "Consulta: " query "\n\n"
                                "Contexto: " context "\n\n"
                                "Resposta: " response "\n\n"
                                "A resposta contém informações que não estão no contexto? "
                                "A resposta contradiz o contexto em algum ponto? "
                                "Atribua uma pontuação de 1 a 10, onde 10 significa perfeita fidelidade ao contexto.")
        
        prompt-relevancy (str "Avalie quão relevante é a resposta para a consulta.\n\n"
                             "Consulta: " query "\n\n"
                             "Resposta: " response "\n\n"
                             "A resposta aborda diretamente a consulta? "
                             "Alguma parte importante da consulta foi ignorada? "
                             "Atribua uma pontuação de 1 a 10, onde 10 significa perfeitamente relevante.")
        
        ;; Chamar LLM para avaliação
        faithfulness-result (parse-score (call-evaluation-llm prompt-faithfulness))
        relevancy-result (parse-score (call-evaluation-llm prompt-relevancy))]
    
    ;; Retornar resultados agregados
    {:faithfulness faithfulness-result
     :relevancy relevancy-result
     :composite_score (/ (+ faithfulness-result relevancy-result) 2.0)}))
#+END_SRC

A função recebe três parâmetros principais: a consulta original do usuário (~query~), o contexto recuperado pelo sistema (~context~) e a resposta gerada pelo modelo (~response~). Utilizando esses inputs, a função constrói dois prompts específicos para avaliar diferentes dimensões da qualidade da resposta.

O primeiro prompt avalia a "fidelidade" [[https://en.wikipedia.org/wiki/Faithfulness_(literary_theory][(faithfulness)]]) da resposta, verificando se ela se mantém fiel ao contexto fornecido sem adicionar informações não presentes ou contradizer o material de referência. O segundo prompt avalia a "relevância" [[https://en.wikipedia.org/wiki/Relevance_(information_retrieval][(relevancy)]]), analisando se a resposta aborda diretamente a consulta do usuário e se cobre todos os aspectos importantes da pergunta. Ambos os prompts são enviados para um [[https://github.com/langchain-ai/langchain/blob/main/libs/langchain-core/langchain_core/prompts/prompt.py][LLM avaliador através da função ~call-evaluation-llm~]], que retorna uma avaliação textual que é então convertida em uma pontuação numérica pela função ~parse-score~.

Por fim, a função agrega os resultados em um mapa contendo as pontuações individuais de fidelidade e relevância, além de calcular uma pontuação composta que é a média das duas métricas. Esta abordagem de "LLM como avaliador" representa uma técnica avançada no campo de RAG, permitindo avaliações automatizadas que capturam nuances qualitativas difíceis de medir com métricas puramente estatísticas. 

#+BEGIN_QUOTE
O código demonstra como implementar um sistema de avaliação que pode ser usado para monitoramento contínuo da qualidade das respostas e identificação de áreas para melhoria.
#+END_QUOTE

