rag02/index.html
<div id="outline-container-headline-23" class="outline-5">
<h5 id="headline-23">
2. Métricas de Qualidade da Resposta
</h5>
<div id="outline-text-headline-23" class="outline-text-5">
<p>
Para avaliar a qualidade das respostas geradas por sistemas RAG, é essencial implementar métricas específicas que capturem diferentes dimensões de eficácia. Estas métricas vão além de simples avaliações binárias (correto/incorreto) e permitem uma análise nuançada da performance do sistema. Implementamos as seguintes métricas qualitativas em nosso framework de avaliação:</p>
<ul>
<li><em>Faithfulness (Fidelidade)</em>: O grau em que a resposta é suportada pelo contexto fornecido, sem alucinações</li>
<li><em>Answer Relevancy (Relevância da Resposta)</em>: Quão bem a resposta aborda a consulta do usuário</li>
<li><em>Contextual Precision (Precisão Contextual)</em>: Proporção do contexto utilizado que foi relevante para a resposta</li>
<li><em>Helpfulness (Utilidade)</em>: Avaliação subjetiva de quão útil foi a resposta para o usuário</li>
</ul>
<p>Abaixo, um exemplo de implementação de métricas de qualidade da resposta em Clojure:</p>
<div class="src src-clojure">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-clojure" data-lang="clojure"><span class="line"><span class="cl"><span class="p">(</span><span class="kd">defn </span><span class="nv">evaluate-response-quality</span>
</span></span><span class="line"><span class="cl">  <span class="s">&#34;Avalia métricas qualitativas de uma resposta RAG&#34;</span>
</span></span><span class="line"><span class="cl">  <span class="p">[</span><span class="nv">query</span> <span class="nv">context</span> <span class="nv">response</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">  <span class="p">(</span><span class="k">let </span><span class="p">[</span><span class="c1">;; Usar LLM como avaliador</span>
</span></span><span class="line"><span class="cl">        <span class="nv">prompt-faithfulness</span> <span class="p">(</span><span class="nb">str </span><span class="s">&#34;Avalie a fidelidade da seguinte resposta ao contexto fornecido.\n\n&#34;</span>
</span></span><span class="line"><span class="cl">                                <span class="s">&#34;Consulta: &#34;</span> <span class="nv">query</span> <span class="s">&#34;\n\n&#34;</span>
</span></span><span class="line"><span class="cl">                                <span class="s">&#34;Contexto: &#34;</span> <span class="nv">context</span> <span class="s">&#34;\n\n&#34;</span>
</span></span><span class="line"><span class="cl">                                <span class="s">&#34;Resposta: &#34;</span> <span class="nv">response</span> <span class="s">&#34;\n\n&#34;</span>
</span></span><span class="line"><span class="cl">                                <span class="s">&#34;A resposta contém informações que não estão no contexto? &#34;</span>
</span></span><span class="line"><span class="cl">                                <span class="s">&#34;A resposta contradiz o contexto em algum ponto? &#34;</span>
</span></span><span class="line"><span class="cl">                                <span class="s">&#34;Atribua uma pontuação de 1 a 10, onde 10 significa perfeita fidelidade ao contexto.&#34;</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        
</span></span><span class="line"><span class="cl">        <span class="nv">prompt-relevancy</span> <span class="p">(</span><span class="nb">str </span><span class="s">&#34;Avalie quão relevante é a resposta para a consulta.\n\n&#34;</span>
</span></span><span class="line"><span class="cl">                             <span class="s">&#34;Consulta: &#34;</span> <span class="nv">query</span> <span class="s">&#34;\n\n&#34;</span>
</span></span><span class="line"><span class="cl">                             <span class="s">&#34;Resposta: &#34;</span> <span class="nv">response</span> <span class="s">&#34;\n\n&#34;</span>
</span></span><span class="line"><span class="cl">                             <span class="s">&#34;A resposta aborda diretamente a consulta? &#34;</span>
</span></span><span class="line"><span class="cl">                             <span class="s">&#34;Alguma parte importante da consulta foi ignorada? &#34;</span>
</span></span><span class="line"><span class="cl">                             <span class="s">&#34;Atribua uma pontuação de 1 a 10, onde 10 significa perfeitamente relevante.&#34;</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        
</span></span><span class="line"><span class="cl">        <span class="c1">;; Chamar LLM para avaliação</span>
</span></span><span class="line"><span class="cl">        <span class="nv">faithfulness-result</span> <span class="p">(</span><span class="nf">parse-score</span> <span class="p">(</span><span class="nf">call-evaluation-llm</span> <span class="nv">prompt-faithfulness</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">        <span class="nv">relevancy-result</span> <span class="p">(</span><span class="nf">parse-score</span> <span class="p">(</span><span class="nf">call-evaluation-llm</span> <span class="nv">prompt-relevancy</span><span class="p">))]</span>
</span></span><span class="line"><span class="cl">    
</span></span><span class="line"><span class="cl">    <span class="c1">;; Retornar resultados agregados</span>
</span></span><span class="line"><span class="cl">    <span class="p">{</span><span class="ss">:faithfulness</span> <span class="nv">faithfulness-result</span>
</span></span><span class="line"><span class="cl">     <span class="ss">:relevancy</span> <span class="nv">relevancy-result</span>
</span></span><span class="line"><span class="cl">     <span class="ss">:composite_score</span> <span class="p">(</span><span class="nb">/ </span><span class="p">(</span><span class="nb">+ </span><span class="nv">faithfulness-result</span> <span class="nv">relevancy-result</span><span class="p">)</span> <span class="mf">2.0</span><span class="p">)}))</span></span></span></code></pre></div>
</div>
<p>
A função recebe três parâmetros principais: a consulta original do usuário (<code>query</code>), o contexto recuperado pelo sistema (<code>context</code>) e a resposta gerada pelo modelo (<code>response</code>). Utilizando esses inputs, a função constrói dois prompts específicos para avaliar diferentes dimensões da qualidade da resposta.</p>
<p>
O primeiro prompt avalia a &#34;fidelidade&#34; <a href="https://en.wikipedia.org/wiki/Faithfulness_(literary_theory">(faithfulness)</a>) da resposta, verificando se ela se mantém fiel ao contexto fornecido sem adicionar informações não presentes ou contradizer o material de referência. O segundo prompt avalia a &#34;relevância&#34; <a href="https://en.wikipedia.org/wiki/Relevance_(information_retrieval">(relevancy)</a>), analisando se a resposta aborda diretamente a consulta do usuário e se cobre todos os aspectos importantes da pergunta. Ambos os prompts são enviados para um <a href="https://github.com/langchain-ai/langchain/blob/main/libs/langchain-core/langchain_core/prompts/prompt.py">LLM avaliador através da função <code>call-evaluation-llm</code></a>, que retorna uma avaliação textual que é então convertida em uma pontuação numérica pela função <code>parse-score</code>.</p>
<p>
Por fim, a função agrega os resultados em um mapa contendo as pontuações individuais de fidelidade e relevância, além de calcular uma pontuação composta que é a média das duas métricas. Esta abordagem de &#34;LLM como avaliador&#34; representa uma técnica avançada no campo de RAG, permitindo avaliações automatizadas que capturam nuances qualitativas difíceis de medir com métricas puramente estatísticas. </p>
<blockquote>
<p>O código demonstra como implementar um sistema de avaliação que pode ser usado para monitoramento contínuo da qualidade das respostas e identificação de áreas para melhoria.</p>
</blockquote>
</div>
</div>
