blog/content/post/rag02.org
**** 3. Métricas de Consenso entre Modelos

Uma técnica eficaz é comparar respostas de múltiplos modelos ou configurações:

- [[https://en.wikipedia.org/wiki/Model_agreement][/Model Agreement (Concordância de Modelos)/]]: Grau de concordância entre diferentes LLMs para a mesma consulta/contexto
- [[https://en.wikipedia.org/wiki/Embedding][/Embedding Stability (Estabilidade de Embeddings)/]]: Consistência de embeddings entre atualizações de modelos
- [[https://en.wikipedia.org/wiki/Context_utilization_variance][/Context Utilization Variance (Variância de Utilização de Contexto)/]]: Diferenças na forma como os modelos utilizam o contexto

Abaixo, um exemplo de implementação de métricas de consenso entre modelos em Clojure:

#+BEGIN_SRC clojure
(defn measure-model-agreement
  "Mede concordância entre diferentes modelos para mesma consulta"
  [query context models]
  (let [;; Gerar respostas de cada modelo
        responses (map #(generate-response-with-model % query context) models)
        
        ;; Calcular similaridade semântica entre cada par de respostas
        similarities (for [i (range (count responses))
                          j (range (inc i) (count responses))]
                      (calculate-semantic-similarity 
                        (nth responses i) 
                        (nth responses j)))
        
        ;; Média das similaridades como medida de concordância
        avg-similarity (if (seq similarities)
                         (/ (reduce + similarities) (count similarities))
                         1.0)]
    avg-similarity))
#+END_SRC

Esta função implementa uma métrica de concordância entre modelos, uma técnica valiosa para avaliar a robustez de sistemas RAG. Ao gerar respostas para a mesma consulta usando diferentes modelos, a função calcula a similaridade semântica entre cada par de respostas. Uma alta concordância (similaridade) entre modelos diversos sugere que a resposta é mais confiável, enquanto baixa concordância pode indicar ambiguidade nos dados ou questões com a recuperação de contexto.

A implementação utiliza uma abordagem de comparação par a par, onde cada resposta é comparada com todas as outras. A função ~calculate-semantic-similarity~ (não mostrada) provavelmente utiliza embeddings para medir quão semanticamente próximas estão duas respostas. O resultado final é uma pontuação média de similaridade que quantifica o nível geral de consenso entre os modelos. Esta métrica é particularmente útil para identificar consultas problemáticas onde diferentes modelos divergem significativamente, sinalizando potenciais áreas para melhoria no pipeline RAG.

