rag02/index.html
<div id="outline-container-headline-24" class="outline-5">
<h5 id="headline-24">
3. Métricas de Consenso entre Modelos
</h5>
<div id="outline-text-headline-24" class="outline-text-5">
<p>
Uma técnica eficaz é comparar respostas de múltiplos modelos ou configurações:</p>
<ul>
<li><a href="https://en.wikipedia.org/wiki/Model_agreement"><em>Model Agreement (Concordância de Modelos)</em></a>: Grau de concordância entre diferentes LLMs para a mesma consulta/contexto</li>
<li><a href="https://en.wikipedia.org/wiki/Embedding"><em>Embedding Stability (Estabilidade de Embeddings)</em></a>: Consistência de embeddings entre atualizações de modelos</li>
<li><a href="https://en.wikipedia.org/wiki/Context_utilization_variance"><em>Context Utilization Variance (Variância de Utilização de Contexto)</em></a>: Diferenças na forma como os modelos utilizam o contexto</li>
</ul>
<p>Abaixo, um exemplo de implementação de métricas de consenso entre modelos em Clojure:</p>
<div class="src src-clojure">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-clojure" data-lang="clojure"><span class="line"><span class="cl"><span class="p">(</span><span class="kd">defn </span><span class="nv">measure-model-agreement</span>
</span></span><span class="line"><span class="cl">  <span class="s">&#34;Mede concordância entre diferentes modelos para mesma consulta&#34;</span>
</span></span><span class="line"><span class="cl">  <span class="p">[</span><span class="nv">query</span> <span class="nv">context</span> <span class="nv">models</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">  <span class="p">(</span><span class="k">let </span><span class="p">[</span><span class="c1">;; Gerar respostas de cada modelo</span>
</span></span><span class="line"><span class="cl">        <span class="nv">responses</span> <span class="p">(</span><span class="nb">map </span><span class="o">#</span><span class="p">(</span><span class="nf">generate-response-with-model</span> <span class="nv">%</span> <span class="nv">query</span> <span class="nv">context</span><span class="p">)</span> <span class="nv">models</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        
</span></span><span class="line"><span class="cl">        <span class="c1">;; Calcular similaridade semântica entre cada par de respostas</span>
</span></span><span class="line"><span class="cl">        <span class="nv">similarities</span> <span class="p">(</span><span class="nb">for </span><span class="p">[</span><span class="nv">i</span> <span class="p">(</span><span class="nb">range </span><span class="p">(</span><span class="nb">count </span><span class="nv">responses</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">                          <span class="nv">j</span> <span class="p">(</span><span class="nb">range </span><span class="p">(</span><span class="nb">inc </span><span class="nv">i</span><span class="p">)</span> <span class="p">(</span><span class="nb">count </span><span class="nv">responses</span><span class="p">))]</span>
</span></span><span class="line"><span class="cl">                      <span class="p">(</span><span class="nf">calculate-semantic-similarity</span> 
</span></span><span class="line"><span class="cl">                        <span class="p">(</span><span class="nb">nth </span><span class="nv">responses</span> <span class="nv">i</span><span class="p">)</span> 
</span></span><span class="line"><span class="cl">                        <span class="p">(</span><span class="nb">nth </span><span class="nv">responses</span> <span class="nv">j</span><span class="p">)))</span>
</span></span><span class="line"><span class="cl">        
</span></span><span class="line"><span class="cl">        <span class="c1">;; Média das similaridades como medida de concordância</span>
</span></span><span class="line"><span class="cl">        <span class="nv">avg-similarity</span> <span class="p">(</span><span class="k">if </span><span class="p">(</span><span class="nb">seq </span><span class="nv">similarities</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">                         <span class="p">(</span><span class="nb">/ </span><span class="p">(</span><span class="nb">reduce + </span><span class="nv">similarities</span><span class="p">)</span> <span class="p">(</span><span class="nb">count </span><span class="nv">similarities</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">                         <span class="mf">1.0</span><span class="p">)]</span>
</span></span><span class="line"><span class="cl">    <span class="nv">avg-similarity</span><span class="p">))</span></span></span></code></pre></div>
</div>
<p>
Esta função implementa uma métrica de concordância entre modelos, uma técnica valiosa para avaliar a robustez de sistemas RAG. Ao gerar respostas para a mesma consulta usando diferentes modelos, a função calcula a similaridade semântica entre cada par de respostas. Uma alta concordância (similaridade) entre modelos diversos sugere que a resposta é mais confiável, enquanto baixa concordância pode indicar ambiguidade nos dados ou questões com a recuperação de contexto.</p>
<p>
A implementação utiliza uma abordagem de comparação par a par, onde cada resposta é comparada com todas as outras. A função <code>calculate-semantic-similarity</code> (não mostrada) provavelmente utiliza embeddings para medir quão semanticamente próximas estão duas respostas. O resultado final é uma pontuação média de similaridade que quantifica o nível geral de consenso entre os modelos. Esta métrica é particularmente útil para identificar consultas problemáticas onde diferentes modelos divergem significativamente, sinalizando potenciais áreas para melhoria no pipeline RAG.</p>
</div>
</div>
</div>
</div>
