blog/content/post/rag02.org
*** Automação da Avaliação com LLMs como Juízes

#+BEGIN_SRC mermaid
flowchart TD
    Q[Consulta do Usuário] --> RAG[Sistema RAG]
    CTX[Contexto Recuperado] --> RAG
    
    RAG --> RESP[Resposta Gerada]
    
    subgraph "Avaliação Automatizada"
        RESP --> JUDGE[LLM Avaliador]
        Q --> JUDGE
        CTX --> JUDGE
        CRIT[Critérios de Avaliação] --> JUDGE
        
        JUDGE --> EVAL[Avaliação Estruturada]
        EVAL --> DB[(Banco de Dados)]
        
        EVAL --> METRICS[Métricas de Qualidade]
        METRICS --> DASH[Dashboard]
        
        EVAL --> INSIGHT[Insights para Melhoria]
        INSIGHT --> REFINE[Refinamento do Sistema]
        REFINE -.-> RAG
    end
    
    style Q fill:#f9f,stroke:#333,stroke-width:2px
    style RESP fill:#9cf,stroke:#333,stroke-width:2px
    style JUDGE fill:#fc9,stroke:#333,stroke-width:2px
    style EVAL fill:#9f9,stroke:#333,stroke-width:2px
    style REFINE fill:#f99,stroke:#333,stroke-width:2px
#+END_SRC

O diagrama acima representando o fluxo desde a consulta do usuário até o refinamento contínuo do sistema. No centro do processo está o "LLM Avaliador" (JUDGE), que recebe três entradas cruciais: a consulta original do usuário, o contexto recuperado e a resposta gerada pelo sistema RAG. Adicionalmente, o avaliador utiliza critérios de avaliação predefinidos para realizar uma análise estruturada e imparcial.

O aspecto mais valioso deste fluxo é o ciclo de feedback que ele estabelece: a avaliação estruturada não apenas alimenta um banco de dados para registro histórico e gera métricas de qualidade para visualização em dashboards, mas também produz insights acionáveis que direcionam o refinamento do sistema. Esta abordagem cíclica permite que o sistema RAG evolua continuamente, aprendendo com suas próprias limitações e melhorando progressivamente a qualidade das respostas, sem necessidade de intervenção humana constante em cada etapa do processo de avaliação. Uma abordagem emergente é usar LLMs como "juízes" para avaliar automaticamente a qualidade das respostas:

#+BEGIN_SRC clojure
(defn llm-judge-evaluation
  "Utiliza LLM como juiz para avaliar respostas RAG"
  [query context response evaluation-criteria]
  (let [;; Construir prompt para avaliação
        evaluation-prompt (str "Você é um avaliador especializado em sistemas RAG. "
                              "Analise a seguinte interação e avalie de acordo com os critérios especificados.\n\n"
                              "Consulta do usuário: " query "\n\n"
                              "Contexto recuperado: " context "\n\n"
                              "Resposta gerada: " response "\n\n"
                              "Critérios de avaliação:\n"
                              evaluation-criteria "\n\n"
                              "Para cada critério, forneça:\n"
                              "1. Uma pontuação de 1-10\n"
                              "2. Justificativa para a pontuação\n"
                              "3. Sugestões específicas para melhoria\n"
                              "Formate sua resposta como JSON.")
        
        ;; Chamar LLM avaliador (preferivelmente um modelo diferente do usado para gerar a resposta para evitar viés de auto-avaliação)](https://en.wikipedia.org/wiki/Self-assessment)
        judge-response (call-evaluation-llm evaluation-prompt)
        
        ;; Parsear resposta estruturada
        evaluation-results (json/read-str judge-response)]
    
    ;; Registrar avaliação no banco de dados
    (log-evaluation query context response evaluation-results)
    
    ;; Retornar resultados estruturados
    evaluation-results))
#+END_SRC

A implementação segue um padrão elegante e prático: primeiro constrói um prompt detalhado que enquadra a tarefa de avaliação, depois chama um modelo [[https://en.wikipedia.org/wiki/Self-assessment][LLM dedicado (preferencialmente diferente do usado na geração da resposta para evitar viés de auto-avaliação)]], processa a resposta estruturada e finalmente registra os resultados para análise posterior. Esta abordagem permite avaliação contínua e escalável da qualidade do sistema RAG, fornecendo insights acionáveis para refinamento do pipeline sem necessidade de intervenção humana constante. 

A função representa uma evolução importante nas práticas de avaliação de RAG, combinando a capacidade de compreensão contextual dos LLMs com a necessidade de feedback estruturado e quantificável.

