rag02/index.html
<div id="outline-container-headline-25" class="outline-4">
<h4 id="headline-25">
Automação da Avaliação com LLMs como Juízes
</h4>
<div id="outline-text-headline-25" class="outline-text-4">
<div class="src src-mermaid">
<pre tabindex="0"><code class="language-mermaid" data-lang="mermaid">flowchart TD
    Q[Consulta do Usuário] --&gt; RAG[Sistema RAG]
    CTX[Contexto Recuperado] --&gt; RAG
    
    RAG --&gt; RESP[Resposta Gerada]
    
    subgraph &#34;Avaliação Automatizada&#34;
        RESP --&gt; JUDGE[LLM Avaliador]
        Q --&gt; JUDGE
        CTX --&gt; JUDGE
        CRIT[Critérios de Avaliação] --&gt; JUDGE
        
        JUDGE --&gt; EVAL[Avaliação Estruturada]
        EVAL --&gt; DB[(Banco de Dados)]
        
        EVAL --&gt; METRICS[Métricas de Qualidade]
        METRICS --&gt; DASH[Dashboard]
        
        EVAL --&gt; INSIGHT[Insights para Melhoria]
        INSIGHT --&gt; REFINE[Refinamento do Sistema]
        REFINE -.-&gt; RAG
    end
    
    style Q fill:#f9f,stroke:#333,stroke-width:2px
    style RESP fill:#9cf,stroke:#333,stroke-width:2px
    style JUDGE fill:#fc9,stroke:#333,stroke-width:2px
    style EVAL fill:#9f9,stroke:#333,stroke-width:2px
    style REFINE fill:#f99,stroke:#333,stroke-width:2px</code></pre>
</div>
<p>
O diagrama acima representando o fluxo desde a consulta do usuário até o refinamento contínuo do sistema. No centro do processo está o &#34;LLM Avaliador&#34; (JUDGE), que recebe três entradas cruciais: a consulta original do usuário, o contexto recuperado e a resposta gerada pelo sistema RAG. Adicionalmente, o avaliador utiliza critérios de avaliação predefinidos para realizar uma análise estruturada e imparcial.</p>
<p>
O aspecto mais valioso deste fluxo é o ciclo de feedback que ele estabelece: a avaliação estruturada não apenas alimenta um banco de dados para registro histórico e gera métricas de qualidade para visualização em dashboards, mas também produz insights acionáveis que direcionam o refinamento do sistema. Esta abordagem cíclica permite que o sistema RAG evolua continuamente, aprendendo com suas próprias limitações e melhorando progressivamente a qualidade das respostas, sem necessidade de intervenção humana constante em cada etapa do processo de avaliação. Uma abordagem emergente é usar LLMs como &#34;juízes&#34; para avaliar automaticamente a qualidade das respostas:</p>
<div class="src src-clojure">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-clojure" data-lang="clojure"><span class="line"><span class="cl"><span class="p">(</span><span class="kd">defn </span><span class="nv">llm-judge-evaluation</span>
</span></span><span class="line"><span class="cl">  <span class="s">&#34;Utiliza LLM como juiz para avaliar respostas RAG&#34;</span>
</span></span><span class="line"><span class="cl">  <span class="p">[</span><span class="nv">query</span> <span class="nv">context</span> <span class="nv">response</span> <span class="nv">evaluation-criteria</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">  <span class="p">(</span><span class="k">let </span><span class="p">[</span><span class="c1">;; Construir prompt para avaliação</span>
</span></span><span class="line"><span class="cl">        <span class="nv">evaluation-prompt</span> <span class="p">(</span><span class="nb">str </span><span class="s">&#34;Você é um avaliador especializado em sistemas RAG. &#34;</span>
</span></span><span class="line"><span class="cl">                              <span class="s">&#34;Analise a seguinte interação e avalie de acordo com os critérios especificados.\n\n&#34;</span>
</span></span><span class="line"><span class="cl">                              <span class="s">&#34;Consulta do usuário: &#34;</span> <span class="nv">query</span> <span class="s">&#34;\n\n&#34;</span>
</span></span><span class="line"><span class="cl">                              <span class="s">&#34;Contexto recuperado: &#34;</span> <span class="nv">context</span> <span class="s">&#34;\n\n&#34;</span>
</span></span><span class="line"><span class="cl">                              <span class="s">&#34;Resposta gerada: &#34;</span> <span class="nv">response</span> <span class="s">&#34;\n\n&#34;</span>
</span></span><span class="line"><span class="cl">                              <span class="s">&#34;Critérios de avaliação:\n&#34;</span>
</span></span><span class="line"><span class="cl">                              <span class="nv">evaluation-criteria</span> <span class="s">&#34;\n\n&#34;</span>
</span></span><span class="line"><span class="cl">                              <span class="s">&#34;Para cada critério, forneça:\n&#34;</span>
</span></span><span class="line"><span class="cl">                              <span class="s">&#34;1. Uma pontuação de 1-10\n&#34;</span>
</span></span><span class="line"><span class="cl">                              <span class="s">&#34;2. Justificativa para a pontuação\n&#34;</span>
</span></span><span class="line"><span class="cl">                              <span class="s">&#34;3. Sugestões específicas para melhoria\n&#34;</span>
</span></span><span class="line"><span class="cl">                              <span class="s">&#34;Formate sua resposta como JSON.&#34;</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        
</span></span><span class="line"><span class="cl">        <span class="c1">;; Chamar LLM avaliador (preferivelmente um modelo diferente do usado para gerar a resposta para evitar viés de auto-avaliação)](https://en.wikipedia.org/wiki/Self-assessment)</span>
</span></span><span class="line"><span class="cl">        <span class="nv">judge-response</span> <span class="p">(</span><span class="nf">call-evaluation-llm</span> <span class="nv">evaluation-prompt</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        
</span></span><span class="line"><span class="cl">        <span class="c1">;; Parsear resposta estruturada</span>
</span></span><span class="line"><span class="cl">        <span class="nv">evaluation-results</span> <span class="p">(</span><span class="nf">json/read-str</span> <span class="nv">judge-response</span><span class="p">)]</span>
</span></span><span class="line"><span class="cl">    
</span></span><span class="line"><span class="cl">    <span class="c1">;; Registrar avaliação no banco de dados</span>
</span></span><span class="line"><span class="cl">    <span class="p">(</span><span class="nf">log-evaluation</span> <span class="nv">query</span> <span class="nv">context</span> <span class="nv">response</span> <span class="nv">evaluation-results</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    
</span></span><span class="line"><span class="cl">    <span class="c1">;; Retornar resultados estruturados</span>
</span></span><span class="line"><span class="cl">    <span class="nv">evaluation-results</span><span class="p">))</span></span></span></code></pre></div>
</div>
<p>
A implementação segue um padrão elegante e prático: primeiro constrói um prompt detalhado que enquadra a tarefa de avaliação, depois chama um modelo <a href="https://en.wikipedia.org/wiki/Self-assessment">LLM dedicado (preferencialmente diferente do usado na geração da resposta para evitar viés de auto-avaliação)</a>, processa a resposta estruturada e finalmente registra os resultados para análise posterior. Esta abordagem permite avaliação contínua e escalável da qualidade do sistema RAG, fornecendo insights acionáveis para refinamento do pipeline sem necessidade de intervenção humana constante. </p>
<p>
A função representa uma evolução importante nas práticas de avaliação de RAG, combinando a capacidade de compreensão contextual dos LLMs com a necessidade de feedback estruturado e quantificável.</p>
