rag02/index.html
<div id="outline-container-headline-26" class="outline-5">
<h5 id="headline-26">
Configuração de um Dashboard de Qualidade RAG
</h5>
<div id="outline-text-headline-26" class="outline-text-5">
<p>
Para monitoramento contínuo, é essencial configurar um dashboard que acompanhe a evolução das métricas ao longo do tempo:</p>
<div class="src src-clojure">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-clojure" data-lang="clojure"><span class="line"><span class="cl"><span class="p">(</span><span class="kd">defn </span><span class="nv">generate-rag-quality-report</span>
</span></span><span class="line"><span class="cl">  <span class="s">&#34;Gera relatório diário de qualidade do sistema RAG&#34;</span>
</span></span><span class="line"><span class="cl">  <span class="p">[]</span>
</span></span><span class="line"><span class="cl">  <span class="p">(</span><span class="k">let </span><span class="p">[</span><span class="c1">;; Período de avaliação (último dia)</span>
</span></span><span class="line"><span class="cl">        <span class="nv">end-date</span> <span class="p">(</span><span class="nf">java.util.Date.</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="nv">start-date</span> <span class="p">(</span><span class="nb">-&gt; </span><span class="p">(</span><span class="nf">java.util.Calendar/getInstance</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">                       <span class="p">(</span><span class="nb">doto </span><span class="p">(</span><span class="nf">.setTime</span> <span class="nv">end-date</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">                             <span class="p">(</span><span class="nf">.add</span> <span class="nv">java.util.Calendar/DAY_OF_MONTH</span> <span class="mi">-1</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">                       <span class="p">(</span><span class="nf">.getTime</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">        
</span></span><span class="line"><span class="cl">        <span class="c1">;; Recuperar logs do período</span>
</span></span><span class="line"><span class="cl">        <span class="nv">logs</span> <span class="p">(</span><span class="nf">jdbc/execute!</span> <span class="nv">db-spec</span>
</span></span><span class="line"><span class="cl">                           <span class="p">[</span><span class="s">&#34;SELECT * FROM rag_logs 
</span></span></span><span class="line"><span class="cl"><span class="s">                             WHERE timestamp BETWEEN ? AND ?&#34;</span>
</span></span><span class="line"><span class="cl">                            <span class="nv">start-date</span> <span class="nv">end-date</span><span class="p">])</span>
</span></span><span class="line"><span class="cl">        
</span></span><span class="line"><span class="cl">        <span class="c1">;; Calcular métricas operacionais</span>
</span></span><span class="line"><span class="cl">        <span class="nv">operational-metrics</span> <span class="p">(</span><span class="nf">calculate-operational-metrics</span> <span class="nv">logs</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        
</span></span><span class="line"><span class="cl">        <span class="c1">;; Selecionar amostra aleatória para avaliação qualitativa</span>
</span></span><span class="line"><span class="cl">        <span class="nv">evaluation-sample</span> <span class="p">(</span><span class="nb">take </span><span class="mi">50</span> <span class="p">(</span><span class="nf">shuffle</span> <span class="nv">logs</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">        
</span></span><span class="line"><span class="cl">        <span class="c1">;; Avaliar qualidade das respostas na amostra</span>
</span></span><span class="line"><span class="cl">        <span class="nv">quality-metrics</span> <span class="p">(</span><span class="nf">evaluate-sample-quality</span> <span class="nv">evaluation-sample</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        
</span></span><span class="line"><span class="cl">        <span class="c1">;; Identificar tendências e anomalias</span>
</span></span><span class="line"><span class="cl">        <span class="nv">trends</span> <span class="p">(</span><span class="nf">detect-quality-trends</span> <span class="nv">quality-metrics</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="nv">anomalies</span> <span class="p">(</span><span class="nf">detect-quality-anomalies</span> <span class="nv">quality-metrics</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        
</span></span><span class="line"><span class="cl">        <span class="c1">;; Compilar relatório</span>
</span></span><span class="line"><span class="cl">        <span class="nv">report</span> <span class="p">{</span><span class="ss">:date</span> <span class="p">(</span><span class="nf">format-date</span> <span class="nv">end-date</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">                <span class="ss">:sample_size</span> <span class="p">(</span><span class="nb">count </span><span class="nv">evaluation-sample</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">                <span class="ss">:operational_metrics</span> <span class="nv">operational-metrics</span>
</span></span><span class="line"><span class="cl">                <span class="ss">:quality_metrics</span> <span class="nv">quality-metrics</span>
</span></span><span class="line"><span class="cl">                <span class="ss">:trends</span> <span class="nv">trends</span>
</span></span><span class="line"><span class="cl">                <span class="ss">:anomalies</span> <span class="nv">anomalies</span>
</span></span><span class="line"><span class="cl">                <span class="ss">:recommendations</span> <span class="p">(</span><span class="nf">generate-recommendations</span> <span class="nv">trends</span> <span class="nv">anomalies</span><span class="p">)}]</span>
</span></span><span class="line"><span class="cl">    
</span></span><span class="line"><span class="cl">    <span class="c1">;; Salvar relatório e enviar notificações se houver anomalias</span>
</span></span><span class="line"><span class="cl">    <span class="p">(</span><span class="nf">save-quality-report</span> <span class="nv">report</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="p">(</span><span class="nb">when </span><span class="p">(</span><span class="nf">not-empty</span> <span class="nv">anomalies</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">      <span class="p">(</span><span class="nf">send-quality-alert</span> <span class="nv">report</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">    
</span></span><span class="line"><span class="cl">    <span class="nv">report</span><span class="p">))</span></span></span></code></pre></div>
</div>
<p>
O código acima implementa uma função Clojure chamada <code>generate-rag-quality-report</code> que automatiza a geração de relatórios diários de qualidade para um sistema RAG. A função começa definindo um período de avaliação (último dia), recupera logs de interações RAG desse período do banco de dados, e calcula métricas operacionais básicas. Em seguida, seleciona uma amostra aleatória de 50 interações para uma avaliação qualitativa mais profunda.</p>
<p>
O núcleo da função está na avaliação da qualidade das respostas na amostra selecionada, seguida pela identificação de tendências e anomalias nos dados de qualidade. Isso permite que o sistema não apenas meça o desempenho atual, mas também detecte padrões emergentes ou problemas que possam exigir atenção. O relatório final é estruturado como um <a href="https://clojure.org/reference/data_structures">mapa Clojure</a> contendo a data, tamanho da amostra, métricas operacionais, métricas de qualidade, tendências identificadas, anomalias detectadas e recomendações geradas automaticamente.</p>
<p>
Um aspecto importante da função é seu mecanismo de alerta: após salvar o relatório no sistema, ela verifica se foram detectadas anomalias e, em caso positivo, envia alertas para os responsáveis. Esta abordagem proativa para monitoramento de qualidade permite que equipes de engenharia e produto intervenham rapidamente quando o desempenho do sistema RAG começa a degradar, antes que os usuários sejam significativamente afetados. O código exemplifica uma implementação prática de <a href="https://en.wikipedia.org/wiki/LLMOps">LLMOps</a>, focando na avaliação contínua e sistemática da qualidade das respostas em um sistema RAG.</p>
</div>
</div>
</div>
</div>
