rag02/index.html
<div id="outline-container-headline-27" class="outline-4">
<h4 id="headline-27">
Integração com Sistemas de Feedback do Usuário
</h4>
<div id="outline-text-headline-27" class="outline-text-4">
<p>
O feedback direto dos usuários é uma fonte valiosa para avaliar a qualidade das respostas:</p>
<div class="src src-clojure">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-clojure" data-lang="clojure"><span class="line"><span class="cl"><span class="p">(</span><span class="kd">defn </span><span class="nv">process-user-feedback</span>
</span></span><span class="line"><span class="cl">  <span class="s">&#34;Processa feedback explícito do usuário&#34;</span>
</span></span><span class="line"><span class="cl">  <span class="p">[</span><span class="nv">query-id</span> <span class="nv">response-id</span> <span class="nv">feedback-type</span> <span class="nv">feedback-text</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">  <span class="p">(</span><span class="k">let </span><span class="p">[</span><span class="c1">;; Registrar feedback no banco de dados</span>
</span></span><span class="line"><span class="cl">        <span class="nv">_</span> <span class="p">(</span><span class="nf">jdbc/execute!</span> <span class="nv">db-spec</span>
</span></span><span class="line"><span class="cl">                        <span class="p">[</span><span class="s">&#34;INSERT INTO user_feedback 
</span></span></span><span class="line"><span class="cl"><span class="s">                          (query_id, response_id, feedback_type, feedback_text, timestamp) 
</span></span></span><span class="line"><span class="cl"><span class="s">                          VALUES (?, ?, ?, ?, CURRENT_TIMESTAMP)&#34;</span>
</span></span><span class="line"><span class="cl">                         <span class="nv">query-id</span> <span class="nv">response-id</span> <span class="nv">feedback-type</span> <span class="nv">feedback-text</span><span class="p">])</span>
</span></span><span class="line"><span class="cl">        
</span></span><span class="line"><span class="cl">        <span class="c1">;; Recuperar detalhes da interação</span>
</span></span><span class="line"><span class="cl">        <span class="nv">interaction</span> <span class="p">(</span><span class="nf">jdbc/execute-one!</span> <span class="nv">db-spec</span>
</span></span><span class="line"><span class="cl">                                     <span class="p">[</span><span class="s">&#34;SELECT query, retrieved_docs, response 
</span></span></span><span class="line"><span class="cl"><span class="s">                                       FROM rag_logs WHERE id = ?&#34;</span>
</span></span><span class="line"><span class="cl">                                      <span class="nv">query-id</span><span class="p">])</span>
</span></span><span class="line"><span class="cl">        
</span></span><span class="line"><span class="cl">        <span class="c1">;; Analisar feedback para extrair insights</span>
</span></span><span class="line"><span class="cl">        <span class="nv">feedback-analysis</span> <span class="p">(</span><span class="nf">analyze-user-feedback</span> <span class="nv">feedback-type</span> 
</span></span><span class="line"><span class="cl">                                               <span class="nv">feedback-text</span> 
</span></span><span class="line"><span class="cl">                                               <span class="p">(</span><span class="ss">:query</span> <span class="nv">interaction</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">                                               <span class="p">(</span><span class="ss">:response</span> <span class="nv">interaction</span><span class="p">))]</span>
</span></span><span class="line"><span class="cl">    
</span></span><span class="line"><span class="cl">    <span class="c1">;; Atualizar métricas agregadas</span>
</span></span><span class="line"><span class="cl">    <span class="p">(</span><span class="nf">update-feedback-metrics</span> <span class="nv">feedback-type</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    
</span></span><span class="line"><span class="cl">    <span class="c1">;; Para feedback negativo, adicionar à fila de revisão manual</span>
</span></span><span class="line"><span class="cl">    <span class="p">(</span><span class="nb">when </span><span class="p">(</span><span class="nb">= </span><span class="nv">feedback-type</span> <span class="s">&#34;negative&#34;</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">      <span class="p">(</span><span class="nf">add-to-manual-review-queue</span> <span class="nv">query-id</span> <span class="nv">feedback-analysis</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">    
</span></span><span class="line"><span class="cl">    <span class="nv">feedback-analysis</span><span class="p">))</span></span></span></code></pre></div>
</div>
<p>A função registra o feedback no banco de dados, recupera os detalhes da interação original, analisa o feedback para extrair insights valiosos e atualiza métricas agregadas. Um aspecto importante é o tratamento especial para <a href="https://en.wikipedia.org/wiki/Negative_feedback">feedback negativo</a>, que é automaticamente adicionado a uma fila de revisão manual, permitindo que a equipe investigue e corrija problemas específicos.</p>
<p>
Esta implementação representa um componente crucial de um sistema LLMOps maduro, pois estabelece um ciclo de feedback contínuo entre usuários e desenvolvedores. Ao capturar sistematicamente as avaliações dos usuários e vinculá-las às consultas e respostas específicas, a função permite análises detalhadas sobre o desempenho do sistema, identificação de padrões de falha e oportunidades de melhoria. </p>
<hr>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-28" class="outline-3">
<h3 id="headline-28">
Implementando no DocAI
</h3>
<div id="outline-text-headline-28" class="outline-text-3">
<p>
Agora que exploramos várias técnicas avançadas, vamos ver como elas são implementadas no projeto DocAI. Nosso sistema atual já incorpora muitas dessas técnicas para criar um pipeline RAG avançado.</p>
<blockquote>
<p>Caso não saiba o que é o DocAI, você pode ver os artigos anteriores <a href="https://lobovit.github.io/2025/03/23/rag/">RAG Simples com Clojure e Ollama</a> e <a href="https://lobovit.github.io/2025/03/25/semantic-postgresql/">Busca Semântica com Ollama e PostgreSQL</a>.</p>
</blockquote>
