blog/content/post/rag02.org
*** Arquitetura Atual do DocAI

A arquitetura do DocAI implementa um sistema RAG completo com suporte a agentes para consultas complexas. Os principais componentes são:

1. [[https://github.com/docai-ai/docai/blob/main/src/core.clj][/Core (core.clj)/]]: Coordenação central do sistema, implementando a interface CLI e gerenciando o fluxo de dados entre componentes.

2. [[https://github.com/docai-ai/docai/blob/main/src/llm.clj][/LLM (llm.clj)/]]: Interface com o Ollama para geração de texto e embeddings, abstraindo detalhes de comunicação com a API.

3. [[https://github.com/docai-ai/docai/blob/main/src/pg.clj][/PostgreSQL (pg.clj)/]]: Implementação da busca semântica com pgvector, incluindo configuração e consultas otimizadas.

4. [[https://github.com/docai-ai/docai/blob/main/src/document.clj][/Processamento de Documentos (document.clj)/]]: Responsável pela extração, limpeza e preparação de texto de diferentes formatos.

5. [[https://github.com/docai-ai/docai/blob/main/src/advanced_rag.clj][/Advanced RAG (advanced_rag.clj)/]]: 
   - Cache em múltiplos níveis (embeddings e respostas)
   - Chunking dinâmico adaptado ao tipo de documento
   - Re-ranqueamento de resultados para melhorar precisão

6. [[https://github.com/docai-ai/docai/blob/main/src/agents.clj][/Sistema de Agentes (agents.clj)/]]:
   - Análise de complexidade de consultas
   - Decomposição em sub-tarefas
   - Agentes especializados (busca, raciocínio, cálculo)
   - Verificação de qualidade das respostas
   - Síntese de resultados parciais

7. [[https://github.com/docai-ai/docai/blob/main/src/metrics.clj][/Métricas (metrics.clj)/]]: Monitoramento de desempenho e qualidade das respostas.

O fluxo de processamento de consultas inicia em ~core.clj~, que identifica se a consulta requer um pipeline RAG simples ou avançado com agentes:

#+BEGIN_SRC clojure
(defn query-advanced-rag
  "Processa uma consulta usando o pipeline RAG avançado"
  [query]
  (println "DEBUG - Processando query com RAG avançado:" query)
  (let [start-time (System/currentTimeMillis)
        ;; Verificar se a consulta precisa do workflow com agentes
        need-agents (agents/needs-agent-workflow? query)
        _ (when need-agents
            (println "DEBUG - Consulta identificada como complexa, usando workflow com agentes"))
        
        ;; Escolher o processamento adequado
        response (if need-agents
                   (agents/process-with-agents query)
                   (adv-rag/advanced-rag-query query))
        
        end-time (System/currentTimeMillis)
        latency (- end-time start-time)]
    
    ;; Registrar métricas
    (metrics/log-rag-interaction query [] response latency)
    
    response))
#+END_SRC

Para consultas simples, o pipeline ~advanced-rag-query~ realiza:
1. Verificação de cache
2. Análise de complexidade da consulta
3. Busca semântica com chunking dinâmico
4. Formatação de prompt contextualizado
5. Geração de resposta com o LLM

Para consultas complexas, o sistema de agentes em ~agents.clj~ entra em ação:

#+BEGIN_SRC clojure
(defn execute-agent-workflow
  "Executa o workflow completo de agentes para uma consulta complexa"
  [query]
  (let [;; Verificar cache primeiro
        cached (@agent-cache query)]
    (if cached
      cached
      (let [start-time (System/currentTimeMillis)
            
            ;; Analisar a consulta para determinar intenção e sub-questões
            analysis (analyze-query query)
            primary-intent (get-agent-type (:intent analysis))
            subtasks (or (:sub_questions analysis) [query])
            
            ;; Resultados parciais
            results (atom [])
            
            ;; Executar cada subtarefa em sequência
            _ (doseq [subtask subtasks]
                (let [agent-result (execute-subtask 
                                     subtask 
                                     primary-intent
                                     @results)]
                  (swap! results conj (:response agent-result))))
            
            ;; Gerar resposta final sintetizada
            synthesis-prompt (str "Com base nas seguintes informações:\n\n"
                                 (str/join "\n\n" @results)
                                 "\n\nResponda à pergunta original de forma completa e coerente: " query)
            
            initial-response (llm/call-ollama-api synthesis-prompt)
            
            ;; Obter contexto combinado para verificação
            combined-context (str/join "\n\n" @results)
            
            ;; Verificar a qualidade da resposta
            final-response (verify-response query combined-context initial-response)
            
            duration (- (System/currentTimeMillis) start-time)]
        
        ;; Registrar métricas e resultados
        final-response))))
#+END_SRC

O sistema de agentes implementa um workflow sofisticado para consultas complexas:
1. Análise da consulta para identificar intenção e subtarefas
2. Execução de cada subtarefa com agentes especializados
3. Acumulação de resultados parciais
4. Síntese de uma resposta final coerente
5. Verificação da qualidade da resposta
6. Armazenamento em cache para consultas futuras

