rag02/index.html
<div id="outline-container-headline-29" class="outline-4">
<h4 id="headline-29">
Arquitetura Atual do DocAI
</h4>
<div id="outline-text-headline-29" class="outline-text-4">
<p>
A arquitetura do DocAI implementa um sistema RAG completo com suporte a agentes para consultas complexas. Os principais componentes são:</p>
<ol>
<li><a href="https://github.com/docai-ai/docai/blob/main/src/core.clj"><em>Core (core.clj)</em></a>: Coordenação central do sistema, implementando a interface CLI e gerenciando o fluxo de dados entre componentes.</li>
<li><a href="https://github.com/docai-ai/docai/blob/main/src/llm.clj"><em>LLM (llm.clj)</em></a>: Interface com o Ollama para geração de texto e embeddings, abstraindo detalhes de comunicação com a API.</li>
<li><a href="https://github.com/docai-ai/docai/blob/main/src/pg.clj"><em>PostgreSQL (pg.clj)</em></a>: Implementação da busca semântica com pgvector, incluindo configuração e consultas otimizadas.</li>
<li><a href="https://github.com/docai-ai/docai/blob/main/src/document.clj"><em>Processamento de Documentos (document.clj)</em></a>: Responsável pela extração, limpeza e preparação de texto de diferentes formatos.</li>
<li>
<p><a href="https://github.com/docai-ai/docai/blob/main/src/advanced_rag.clj"><em>Advanced RAG (advanced_rag.clj)</em></a>: </p>
<ul>
<li>Cache em múltiplos níveis (embeddings e respostas)</li>
<li>Chunking dinâmico adaptado ao tipo de documento</li>
<li>Re-ranqueamento de resultados para melhorar precisão</li>
</ul>
</li>
<li>
<p><a href="https://github.com/docai-ai/docai/blob/main/src/agents.clj"><em>Sistema de Agentes (agents.clj)</em></a>:</p>
<ul>
<li>Análise de complexidade de consultas</li>
<li>Decomposição em sub-tarefas</li>
<li>Agentes especializados (busca, raciocínio, cálculo)</li>
<li>Verificação de qualidade das respostas</li>
<li>Síntese de resultados parciais</li>
</ul>
</li>
<li><a href="https://github.com/docai-ai/docai/blob/main/src/metrics.clj"><em>Métricas (metrics.clj)</em></a>: Monitoramento de desempenho e qualidade das respostas.</li>
</ol>
<p>O fluxo de processamento de consultas inicia em <code>core.clj</code>, que identifica se a consulta requer um pipeline RAG simples ou avançado com agentes:</p>
<div class="src src-clojure">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-clojure" data-lang="clojure"><span class="line"><span class="cl"><span class="p">(</span><span class="kd">defn </span><span class="nv">query-advanced-rag</span>
</span></span><span class="line"><span class="cl">  <span class="s">&#34;Processa uma consulta usando o pipeline RAG avançado&#34;</span>
</span></span><span class="line"><span class="cl">  <span class="p">[</span><span class="nv">query</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">  <span class="p">(</span><span class="nb">println </span><span class="s">&#34;DEBUG - Processando query com RAG avançado:&#34;</span> <span class="nv">query</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">  <span class="p">(</span><span class="k">let </span><span class="p">[</span><span class="nv">start-time</span> <span class="p">(</span><span class="nf">System/currentTimeMillis</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="c1">;; Verificar se a consulta precisa do workflow com agentes</span>
</span></span><span class="line"><span class="cl">        <span class="nv">need-agents</span> <span class="p">(</span><span class="nf">agents/needs-agent-workflow?</span> <span class="nv">query</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="nv">_</span> <span class="p">(</span><span class="nb">when </span><span class="nv">need-agents</span>
</span></span><span class="line"><span class="cl">            <span class="p">(</span><span class="nb">println </span><span class="s">&#34;DEBUG - Consulta identificada como complexa, usando workflow com agentes&#34;</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">        
</span></span><span class="line"><span class="cl">        <span class="c1">;; Escolher o processamento adequado</span>
</span></span><span class="line"><span class="cl">        <span class="nv">response</span> <span class="p">(</span><span class="k">if </span><span class="nv">need-agents</span>
</span></span><span class="line"><span class="cl">                   <span class="p">(</span><span class="nf">agents/process-with-agents</span> <span class="nv">query</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">                   <span class="p">(</span><span class="nf">adv-rag/advanced-rag-query</span> <span class="nv">query</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">        
</span></span><span class="line"><span class="cl">        <span class="nv">end-time</span> <span class="p">(</span><span class="nf">System/currentTimeMillis</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="nv">latency</span> <span class="p">(</span><span class="nb">- </span><span class="nv">end-time</span> <span class="nv">start-time</span><span class="p">)]</span>
</span></span><span class="line"><span class="cl">    
</span></span><span class="line"><span class="cl">    <span class="c1">;; Registrar métricas</span>
</span></span><span class="line"><span class="cl">    <span class="p">(</span><span class="nf">metrics/log-rag-interaction</span> <span class="nv">query</span> <span class="p">[]</span> <span class="nv">response</span> <span class="nv">latency</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    
</span></span><span class="line"><span class="cl">    <span class="nv">response</span><span class="p">))</span></span></span></code></pre></div>
</div>
<p>
Para consultas simples, o pipeline <code>advanced-rag-query</code> realiza:</p>
<ol>
<li>Verificação de cache</li>
<li>Análise de complexidade da consulta</li>
<li>Busca semântica com chunking dinâmico</li>
<li>Formatação de prompt contextualizado</li>
<li>Geração de resposta com o LLM</li>
</ol>
<p>Para consultas complexas, o sistema de agentes em <code>agents.clj</code> entra em ação:</p>
<div class="src src-clojure">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-clojure" data-lang="clojure"><span class="line"><span class="cl"><span class="p">(</span><span class="kd">defn </span><span class="nv">execute-agent-workflow</span>
</span></span><span class="line"><span class="cl">  <span class="s">&#34;Executa o workflow completo de agentes para uma consulta complexa&#34;</span>
</span></span><span class="line"><span class="cl">  <span class="p">[</span><span class="nv">query</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">  <span class="p">(</span><span class="k">let </span><span class="p">[</span><span class="c1">;; Verificar cache primeiro</span>
</span></span><span class="line"><span class="cl">        <span class="nv">cached</span> <span class="p">(</span><span class="o">@</span><span class="nv">agent-cache</span> <span class="nv">query</span><span class="p">)]</span>
</span></span><span class="line"><span class="cl">    <span class="p">(</span><span class="k">if </span><span class="nv">cached</span>
</span></span><span class="line"><span class="cl">      <span class="nv">cached</span>
</span></span><span class="line"><span class="cl">      <span class="p">(</span><span class="k">let </span><span class="p">[</span><span class="nv">start-time</span> <span class="p">(</span><span class="nf">System/currentTimeMillis</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">            
</span></span><span class="line"><span class="cl">            <span class="c1">;; Analisar a consulta para determinar intenção e sub-questões</span>
</span></span><span class="line"><span class="cl">            <span class="nv">analysis</span> <span class="p">(</span><span class="nf">analyze-query</span> <span class="nv">query</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">            <span class="nv">primary-intent</span> <span class="p">(</span><span class="nf">get-agent-type</span> <span class="p">(</span><span class="ss">:intent</span> <span class="nv">analysis</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">            <span class="nv">subtasks</span> <span class="p">(</span><span class="nb">or </span><span class="p">(</span><span class="ss">:sub_questions</span> <span class="nv">analysis</span><span class="p">)</span> <span class="p">[</span><span class="nv">query</span><span class="p">])</span>
</span></span><span class="line"><span class="cl">            
</span></span><span class="line"><span class="cl">            <span class="c1">;; Resultados parciais</span>
</span></span><span class="line"><span class="cl">            <span class="nv">results</span> <span class="p">(</span><span class="nf">atom</span> <span class="p">[])</span>
</span></span><span class="line"><span class="cl">            
</span></span><span class="line"><span class="cl">            <span class="c1">;; Executar cada subtarefa em sequência</span>
</span></span><span class="line"><span class="cl">            <span class="nv">_</span> <span class="p">(</span><span class="nb">doseq </span><span class="p">[</span><span class="nv">subtask</span> <span class="nv">subtasks</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">                <span class="p">(</span><span class="k">let </span><span class="p">[</span><span class="nv">agent-result</span> <span class="p">(</span><span class="nf">execute-subtask</span> 
</span></span><span class="line"><span class="cl">                                     <span class="nv">subtask</span> 
</span></span><span class="line"><span class="cl">                                     <span class="nv">primary-intent</span>
</span></span><span class="line"><span class="cl">                                     <span class="o">@</span><span class="nv">results</span><span class="p">)]</span>
</span></span><span class="line"><span class="cl">                  <span class="p">(</span><span class="nf">swap!</span> <span class="nv">results</span> <span class="nb">conj </span><span class="p">(</span><span class="ss">:response</span> <span class="nv">agent-result</span><span class="p">))))</span>
</span></span><span class="line"><span class="cl">            
</span></span><span class="line"><span class="cl">            <span class="c1">;; Gerar resposta final sintetizada</span>
</span></span><span class="line"><span class="cl">            <span class="nv">synthesis-prompt</span> <span class="p">(</span><span class="nb">str </span><span class="s">&#34;Com base nas seguintes informações:\n\n&#34;</span>
</span></span><span class="line"><span class="cl">                                 <span class="p">(</span><span class="nf">str/join</span> <span class="s">&#34;\n\n&#34;</span> <span class="o">@</span><span class="nv">results</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">                                 <span class="s">&#34;\n\nResponda à pergunta original de forma completa e coerente: &#34;</span> <span class="nv">query</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">            
</span></span><span class="line"><span class="cl">            <span class="nv">initial-response</span> <span class="p">(</span><span class="nf">llm/call-ollama-api</span> <span class="nv">synthesis-prompt</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">            
</span></span><span class="line"><span class="cl">            <span class="c1">;; Obter contexto combinado para verificação</span>
</span></span><span class="line"><span class="cl">            <span class="nv">combined-context</span> <span class="p">(</span><span class="nf">str/join</span> <span class="s">&#34;\n\n&#34;</span> <span class="o">@</span><span class="nv">results</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">            
</span></span><span class="line"><span class="cl">            <span class="c1">;; Verificar a qualidade da resposta</span>
</span></span><span class="line"><span class="cl">            <span class="nv">final-response</span> <span class="p">(</span><span class="nf">verify-response</span> <span class="nv">query</span> <span class="nv">combined-context</span> <span class="nv">initial-response</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">            
</span></span><span class="line"><span class="cl">            <span class="nv">duration</span> <span class="p">(</span><span class="nb">- </span><span class="p">(</span><span class="nf">System/currentTimeMillis</span><span class="p">)</span> <span class="nv">start-time</span><span class="p">)]</span>
</span></span><span class="line"><span class="cl">        
</span></span><span class="line"><span class="cl">        <span class="c1">;; Registrar métricas e resultados</span>
</span></span><span class="line"><span class="cl">        <span class="nv">final-response</span><span class="p">))))</span></span></span></code></pre></div>
</div>
<p>
O sistema de agentes implementa um workflow sofisticado para consultas complexas:</p>
<ol>
<li>Análise da consulta para identificar intenção e subtarefas</li>
<li>Execução de cada subtarefa com agentes especializados</li>
<li>Acumulação de resultados parciais</li>
<li>Síntese de uma resposta final coerente</li>
<li>Verificação da qualidade da resposta</li>
<li>Armazenamento em cache para consultas futuras</li>
</ol>
</div>
</div>
