blog/content/post/rag02.org
*** Diferenciais do DocAI

O DocAI se destaca por implementar várias técnicas avançadas de RAG em um sistema integrado e modular:

- /Chunking Adaptativo/: Diferentes estratégias de chunking baseadas no tipo de documento:
#+BEGIN_SRC clojure
  (defn adaptive-chunking-strategy
    "Determina estratégia de chunking com base no tipo de documento"
    [document-type]
    (case document-type
      "article" {:chunk-size 1000 :chunk-overlap 150}
      "code" {:chunk-size 500 :chunk-overlap 50}
      "legal" {:chunk-size 1500 :chunk-overlap 200}
      "qa" {:chunk-size 800 :chunk-overlap 100}
      ;; Default
      {:chunk-size 1000 :chunk-overlap 100}))
#+END_SRC

O sistema implementa estratégias de [[https://en.wikipedia.org/wiki/Chunking_(data_storage][chunking adaptativas]]) que otimizam a segmentação de documentos conforme seu tipo específico. Esta abordagem reconhece que diferentes conteúdos possuem características únicas que afetam como devem ser divididos para processamento:

- /Artigos/: Chunks maiores (1000 tokens) com sobreposição significativa (150 tokens), preservando o fluxo narrativo e argumentativo
- /Código-fonte/: Chunks menores (500 tokens) com sobreposição reduzida (50 tokens), respeitando a estrutura modular do código
- /Documentos legais/: Chunks extensos (1500 tokens) com alta sobreposição (200 tokens), mantendo intactas cláusulas e referências cruzadas
- /Conteúdo Q&A/: Chunks de tamanho médio (800 tokens) com sobreposição moderada (100 tokens), preservando pares de perguntas e respostas

Esta estratégia contextual melhora significativamente a qualidade da recuperação, garantindo que cada tipo de documento seja processado de forma otimizada para seu formato e densidade informacional específicos. A função ~adaptive-chunking-strategy~ demonstra uma implementação elegante deste conceito, utilizando pattern matching para selecionar parâmetros otimizados para cada categoria de documento. 

Documentos legais, por exemplo, recebem chunks maiores (1500 tokens) devido à sua natureza densa e interconectada, enquanto documentos de perguntas e respostas utilizam uma configuração intermediária (800 tokens). Esta estratégia de chunking contextual melhora significativamente a qualidade da recuperação, garantindo que o contexto semântico seja preservado de forma apropriada para cada tipo específico de conteúdo.


- /Cache Multinível/: Implementação de cache para embeddings e respostas, reduzindo latência e custos:
#+BEGIN_SRC clojure
  ;; Cache para embeddings
  (def embedding-cache (atom {}))
  ;; Cache para respostas
  (def response-cache (atom {}))
  ;; Cache para resultados de agentes
  (def agent-cache (atom {}))
#+END_SRC

O sistema implementa uma estratégia de [[https://en.wikipedia.org/wiki/Cache_hierarchy][cache multinível]] para otimizar o desempenho e reduzir custos operacionais. Utilizando estruturas de dados atômicas [[https://en.wikipedia.org/wiki/Atom_(data_structure][(~atom~)]]), o [[https://github.com/scovl/docai][DocAI]] mantém três camadas distintas de cache: para embeddings, respostas completas e resultados de agentes. Esta abordagem permite reutilizar cálculos computacionalmente intensivos como a geração de embeddings, evitando processamento redundante de textos idênticos. 

O cache de respostas armazena resultados finais para consultas frequentes, enquanto o cache de agentes preserva resultados intermediários de subtarefas específicas. Esta implementação reduz significativamente a latência do sistema, especialmente para consultas recorrentes, e diminui custos associados a chamadas de API para modelos externos. A estrutura atômica escolhida garante [[https://en.wikipedia.org/wiki/Thread_safety][thread-safety]] em ambientes concorrentes, permitindo atualizações seguras do cache mesmo com múltiplas consultas simultâneas.

- /Verificação de Respostas/: Sistema que avalia e melhora automaticamente as respostas:
#+BEGIN_SRC clojure
  (defn verify-response
    "Usa um agente crítico para verificar e melhorar uma resposta"
    [query context response]
    (let [prompt (str "Avalie criticamente a seguinte resposta para a consulta do usuário. 
                      Verifique se a resposta é:\n"
                      "1. Fiel ao contexto fornecido\n"
                      "2. Completa (responde todos os aspectos da pergunta)\n"
                      "3. Precisa (não contém informações incorretas)\n\n"
                      "Consulta: " query "\n\n"
                      "Contexto: " (if (> (count context) 300) 
                                    (str (subs context 0 300) "...") context) "\n\n"
                      "Resposta: " response "\n\n"
                      "Se a resposta for adequada, apenas responda 'A resposta está correta'. "
                      "Caso contrário, forneça uma versão melhorada.")
          verification (llm/call-ollama-api prompt)]
      
      (if (str/includes? verification "A resposta está correta")
        response
        (let [improved-version (str/replace verification 
                                           #"(?i).*?\b(a resposta melhorada seria:|versão melhorada:|resposta corrigida:|sugestão de resposta:|aqui está uma versão melhorada:)\s*" 
                                           "")]
          improved-version))))
#+END_SRC

O código acima implementa um sistema de verificação e melhoria automática de respostas, um componente crítico em sistemas [[https://en.wikipedia.org/wiki/Retrieval-Augmented_Generation][RAG]] avançados. A função ~verify-response~ atua como um "agente crítico" que avalia a qualidade das respostas geradas com base em três critérios fundamentais: fidelidade ao contexto fornecido, completude em relação à pergunta original e precisão factual. Este mecanismo de auto-verificação representa uma camada adicional de controle de qualidade que ajuda a mitigar alucinações e imprecisões comuns em sistemas baseados em LLMs.

A implementação utiliza uma abordagem elegante de [[https://en.wikipedia.org/wiki/Prompt_engineering][prompt engineering]], onde o sistema solicita explicitamente uma avaliação crítica da resposta original. O prompt estruturado inclui a consulta do usuário, um resumo do contexto (limitado a 300 caracteres para evitar sobrecarga) e a resposta gerada, orientando o modelo a realizar uma análise meticulosa. A função então analisa o resultado da verificação, mantendo a resposta original quando considerada adequada ou extraindo uma versão aprimorada quando necessário, utilizando expressões regulares para limpar metadados desnecessários da resposta melhorada.

Este mecanismo de verificação representa uma implementação prática do conceito de [[https://en.wikipedia.org/wiki/Constitutional_AI][Constitutional AI]] ou "AI com princípios orientadores", onde um sistema é projetado para avaliar criticamente suas próprias saídas. Ao incorporar esta camada de verificação no pipeline [[https://en.wikipedia.org/wiki/Retrieval-Augmented_Generation][RAG]], o [[https://github.com/scovl/docai][DocAI]] consegue oferecer respostas mais confiáveis e precisas, reduzindo significativamente o risco de fornecer informações incorretas ou incompletas. Esta abordagem reflexiva é particularmente valiosa em domínios onde a precisão é crucial, como documentação técnica, informações médicas ou análises legais.


- /Métricas Detalhadas/: Sistema de monitoramento que registra todos os aspectos das interações:
#+BEGIN_SRC clojure
  (metrics/log-rag-interaction query [] response latency)
#+END_SRC

O código acima implementa um sistema de monitoramento que registra todos os aspectos das interações, incluindo a consulta do usuário, o tempo de resposta, e a resposta gerada. Este sistema permite acompanhar o desempenho do sistema ao longo do tempo e identificar possíveis problemas ou pontos de melhoria. Isso é essencial para manter o sistema funcionando de forma eficiente e para continuar evoluindo para novas funcionalidades.

Estas implementações demonstram como as técnicas avançadas de RAG discutidas neste artigo podem ser integradas em um sistema coeso, resultando em um assistente de documentação mais inteligente e eficiente.

