rag02/index.html
<div id="outline-container-headline-30" class="outline-4">
<h4 id="headline-30">
Diferenciais do DocAI
</h4>
<div id="outline-text-headline-30" class="outline-text-4">
<p>
O DocAI se destaca por implementar várias técnicas avançadas de RAG em um sistema integrado e modular:</p>
<ul>
<li><em>Chunking Adaptativo</em>: Diferentes estratégias de chunking baseadas no tipo de documento:</li>
</ul>
<div class="src src-clojure">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-clojure" data-lang="clojure"><span class="line"><span class="cl">  <span class="p">(</span><span class="kd">defn </span><span class="nv">adaptive-chunking-strategy</span>
</span></span><span class="line"><span class="cl">    <span class="s">&#34;Determina estratégia de chunking com base no tipo de documento&#34;</span>
</span></span><span class="line"><span class="cl">    <span class="p">[</span><span class="nv">document-type</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">    <span class="p">(</span><span class="nf">case</span> <span class="nv">document-type</span>
</span></span><span class="line"><span class="cl">      <span class="s">&#34;article&#34;</span> <span class="p">{</span><span class="ss">:chunk-size</span> <span class="mi">1000</span> <span class="ss">:chunk-overlap</span> <span class="mi">150</span><span class="p">}</span>
</span></span><span class="line"><span class="cl">      <span class="s">&#34;code&#34;</span> <span class="p">{</span><span class="ss">:chunk-size</span> <span class="mi">500</span> <span class="ss">:chunk-overlap</span> <span class="mi">50</span><span class="p">}</span>
</span></span><span class="line"><span class="cl">      <span class="s">&#34;legal&#34;</span> <span class="p">{</span><span class="ss">:chunk-size</span> <span class="mi">1500</span> <span class="ss">:chunk-overlap</span> <span class="mi">200</span><span class="p">}</span>
</span></span><span class="line"><span class="cl">      <span class="s">&#34;qa&#34;</span> <span class="p">{</span><span class="ss">:chunk-size</span> <span class="mi">800</span> <span class="ss">:chunk-overlap</span> <span class="mi">100</span><span class="p">}</span>
</span></span><span class="line"><span class="cl">      <span class="c1">;; Default</span>
</span></span><span class="line"><span class="cl">      <span class="p">{</span><span class="ss">:chunk-size</span> <span class="mi">1000</span> <span class="ss">:chunk-overlap</span> <span class="mi">100</span><span class="p">}))</span></span></span></code></pre></div>
</div>
<p>
O sistema implementa estratégias de <a href="https://en.wikipedia.org/wiki/Chunking_(data_storage">chunking adaptativas</a>) que otimizam a segmentação de documentos conforme seu tipo específico. Esta abordagem reconhece que diferentes conteúdos possuem características únicas que afetam como devem ser divididos para processamento:</p>
<ul>
<li><em>Artigos</em>: Chunks maiores (1000 tokens) com sobreposição significativa (150 tokens), preservando o fluxo narrativo e argumentativo</li>
<li><em>Código-fonte</em>: Chunks menores (500 tokens) com sobreposição reduzida (50 tokens), respeitando a estrutura modular do código</li>
<li><em>Documentos legais</em>: Chunks extensos (1500 tokens) com alta sobreposição (200 tokens), mantendo intactas cláusulas e referências cruzadas</li>
<li><em>Conteúdo Q&amp;A</em>: Chunks de tamanho médio (800 tokens) com sobreposição moderada (100 tokens), preservando pares de perguntas e respostas</li>
</ul>
<p>Esta estratégia contextual melhora significativamente a qualidade da recuperação, garantindo que cada tipo de documento seja processado de forma otimizada para seu formato e densidade informacional específicos. A função <code>adaptive-chunking-strategy</code> demonstra uma implementação elegante deste conceito, utilizando pattern matching para selecionar parâmetros otimizados para cada categoria de documento. </p>
<p>
Documentos legais, por exemplo, recebem chunks maiores (1500 tokens) devido à sua natureza densa e interconectada, enquanto documentos de perguntas e respostas utilizam uma configuração intermediária (800 tokens). Esta estratégia de chunking contextual melhora significativamente a qualidade da recuperação, garantindo que o contexto semântico seja preservado de forma apropriada para cada tipo específico de conteúdo.</p>
<ul>
<li><em>Cache Multinível</em>: Implementação de cache para embeddings e respostas, reduzindo latência e custos:</li>
</ul>
<div class="src src-clojure">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-clojure" data-lang="clojure"><span class="line"><span class="cl">  <span class="c1">;; Cache para embeddings</span>
</span></span><span class="line"><span class="cl">  <span class="p">(</span><span class="k">def </span><span class="nv">embedding-cache</span> <span class="p">(</span><span class="nf">atom</span> <span class="p">{}))</span>
</span></span><span class="line"><span class="cl">  <span class="c1">;; Cache para respostas</span>
</span></span><span class="line"><span class="cl">  <span class="p">(</span><span class="k">def </span><span class="nv">response-cache</span> <span class="p">(</span><span class="nf">atom</span> <span class="p">{}))</span>
</span></span><span class="line"><span class="cl">  <span class="c1">;; Cache para resultados de agentes</span>
</span></span><span class="line"><span class="cl">  <span class="p">(</span><span class="k">def </span><span class="nv">agent-cache</span> <span class="p">(</span><span class="nf">atom</span> <span class="p">{}))</span></span></span></code></pre></div>
</div>
<p>
O sistema implementa uma estratégia de <a href="https://en.wikipedia.org/wiki/Cache_hierarchy">cache multinível</a> para otimizar o desempenho e reduzir custos operacionais. Utilizando estruturas de dados atômicas <a href="https://en.wikipedia.org/wiki/Atom_(data_structure">(<code>atom</code>)</a>), o <a href="https://github.com/lobovit/docai">DocAI</a> mantém três camadas distintas de cache: para embeddings, respostas completas e resultados de agentes. Esta abordagem permite reutilizar cálculos computacionalmente intensivos como a geração de embeddings, evitando processamento redundante de textos idênticos. </p>
<p>
O cache de respostas armazena resultados finais para consultas frequentes, enquanto o cache de agentes preserva resultados intermediários de subtarefas específicas. Esta implementação reduz significativamente a latência do sistema, especialmente para consultas recorrentes, e diminui custos associados a chamadas de API para modelos externos. A estrutura atômica escolhida garante <a href="https://en.wikipedia.org/wiki/Thread_safety">thread-safety</a> em ambientes concorrentes, permitindo atualizações seguras do cache mesmo com múltiplas consultas simultâneas.</p>
<ul>
<li><em>Verificação de Respostas</em>: Sistema que avalia e melhora automaticamente as respostas:</li>
</ul>
<div class="src src-clojure">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-clojure" data-lang="clojure"><span class="line"><span class="cl">  <span class="p">(</span><span class="kd">defn </span><span class="nv">verify-response</span>
</span></span><span class="line"><span class="cl">    <span class="s">&#34;Usa um agente crítico para verificar e melhorar uma resposta&#34;</span>
</span></span><span class="line"><span class="cl">    <span class="p">[</span><span class="nv">query</span> <span class="nv">context</span> <span class="nv">response</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">    <span class="p">(</span><span class="k">let </span><span class="p">[</span><span class="nv">prompt</span> <span class="p">(</span><span class="nb">str </span><span class="s">&#34;Avalie criticamente a seguinte resposta para a consulta do usuário. 
</span></span></span><span class="line"><span class="cl"><span class="s">                      Verifique se a resposta é:\n&#34;</span>
</span></span><span class="line"><span class="cl">                      <span class="s">&#34;1. Fiel ao contexto fornecido\n&#34;</span>
</span></span><span class="line"><span class="cl">                      <span class="s">&#34;2. Completa (responde todos os aspectos da pergunta)\n&#34;</span>
</span></span><span class="line"><span class="cl">                      <span class="s">&#34;3. Precisa (não contém informações incorretas)\n\n&#34;</span>
</span></span><span class="line"><span class="cl">                      <span class="s">&#34;Consulta: &#34;</span> <span class="nv">query</span> <span class="s">&#34;\n\n&#34;</span>
</span></span><span class="line"><span class="cl">                      <span class="s">&#34;Contexto: &#34;</span> <span class="p">(</span><span class="k">if </span><span class="p">(</span><span class="nb">&gt; </span><span class="p">(</span><span class="nb">count </span><span class="nv">context</span><span class="p">)</span> <span class="mi">300</span><span class="p">)</span> 
</span></span><span class="line"><span class="cl">                                    <span class="p">(</span><span class="nb">str </span><span class="p">(</span><span class="nb">subs </span><span class="nv">context</span> <span class="mi">0</span> <span class="mi">300</span><span class="p">)</span> <span class="s">&#34;...&#34;</span><span class="p">)</span> <span class="nv">context</span><span class="p">)</span> <span class="s">&#34;\n\n&#34;</span>
</span></span><span class="line"><span class="cl">                      <span class="s">&#34;Resposta: &#34;</span> <span class="nv">response</span> <span class="s">&#34;\n\n&#34;</span>
</span></span><span class="line"><span class="cl">                      <span class="s">&#34;Se a resposta for adequada, apenas responda &#39;A resposta está correta&#39;. &#34;</span>
</span></span><span class="line"><span class="cl">                      <span class="s">&#34;Caso contrário, forneça uma versão melhorada.&#34;</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">          <span class="nv">verification</span> <span class="p">(</span><span class="nf">llm/call-ollama-api</span> <span class="nv">prompt</span><span class="p">)]</span>
</span></span><span class="line"><span class="cl">      
</span></span><span class="line"><span class="cl">      <span class="p">(</span><span class="k">if </span><span class="p">(</span><span class="nf">str/includes?</span> <span class="nv">verification</span> <span class="s">&#34;A resposta está correta&#34;</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="nv">response</span>
</span></span><span class="line"><span class="cl">        <span class="p">(</span><span class="k">let </span><span class="p">[</span><span class="nv">improved-version</span> <span class="p">(</span><span class="nf">str/replace</span> <span class="nv">verification</span> 
</span></span><span class="line"><span class="cl">                                           <span class="o">#</span><span class="s">&#34;(?i).*?\b(a resposta melhorada seria:|versão melhorada:|resposta corrigida:|sugestão de resposta:|aqui está uma versão melhorada:)\s*&#34;</span> 
</span></span><span class="line"><span class="cl">                                           <span class="s">&#34;&#34;</span><span class="p">)]</span>
</span></span><span class="line"><span class="cl">          <span class="nv">improved-version</span><span class="p">))))</span></span></span></code></pre></div>
</div>
<p>
O código acima implementa um sistema de verificação e melhoria automática de respostas, um componente crítico em sistemas <a href="https://en.wikipedia.org/wiki/Retrieval-Augmented_Generation">RAG</a> avançados. A função <code>verify-response</code> atua como um &#34;agente crítico&#34; que avalia a qualidade das respostas geradas com base em três critérios fundamentais: fidelidade ao contexto fornecido, completude em relação à pergunta original e precisão factual. Este mecanismo de auto-verificação representa uma camada adicional de controle de qualidade que ajuda a mitigar alucinações e imprecisões comuns em sistemas baseados em LLMs.</p>
<p>
A implementação utiliza uma abordagem elegante de <a href="https://en.wikipedia.org/wiki/Prompt_engineering">prompt engineering</a>, onde o sistema solicita explicitamente uma avaliação crítica da resposta original. O prompt estruturado inclui a consulta do usuário, um resumo do contexto (limitado a 300 caracteres para evitar sobrecarga) e a resposta gerada, orientando o modelo a realizar uma análise meticulosa. A função então analisa o resultado da verificação, mantendo a resposta original quando considerada adequada ou extraindo uma versão aprimorada quando necessário, utilizando expressões regulares para limpar metadados desnecessários da resposta melhorada.</p>
<p>
Este mecanismo de verificação representa uma implementação prática do conceito de <a href="https://en.wikipedia.org/wiki/Constitutional_AI">Constitutional AI</a> ou &#34;AI com princípios orientadores&#34;, onde um sistema é projetado para avaliar criticamente suas próprias saídas. Ao incorporar esta camada de verificação no pipeline <a href="https://en.wikipedia.org/wiki/Retrieval-Augmented_Generation">RAG</a>, o <a href="https://github.com/lobovit/docai">DocAI</a> consegue oferecer respostas mais confiáveis e precisas, reduzindo significativamente o risco de fornecer informações incorretas ou incompletas. Esta abordagem reflexiva é particularmente valiosa em domínios onde a precisão é crucial, como documentação técnica, informações médicas ou análises legais.</p>
<ul>
<li><em>Métricas Detalhadas</em>: Sistema de monitoramento que registra todos os aspectos das interações:</li>
</ul>
<div class="src src-clojure">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-clojure" data-lang="clojure"><span class="line"><span class="cl">  <span class="p">(</span><span class="nf">metrics/log-rag-interaction</span> <span class="nv">query</span> <span class="p">[]</span> <span class="nv">response</span> <span class="nv">latency</span><span class="p">)</span></span></span></code></pre></div>
</div>
<p>
O código acima implementa um sistema de monitoramento que registra todos os aspectos das interações, incluindo a consulta do usuário, o tempo de resposta, e a resposta gerada. Este sistema permite acompanhar o desempenho do sistema ao longo do tempo e identificar possíveis problemas ou pontos de melhoria. Isso é essencial para manter o sistema funcionando de forma eficiente e para continuar evoluindo para novas funcionalidades.</p>
<p>
Estas implementações demonstram como as técnicas avançadas de RAG discutidas neste artigo podem ser integradas em um sistema coeso, resultando em um assistente de documentação mais inteligente e eficiente.</p>
</div>
</div>
