blog/content/post/rag02.org
*** Próximos Passos para o DocAI

Conforme detalhado no ~plan.md~, o DocAI evoluirá para um sistema RAG Agêntico mais completo, implementando as seguintes melhorias:

1. /Reescrita de Consultas/
   - Módulo de reformulação para melhorar a precisão da busca
   - Expansão de consultas curtas e foco em consultas abrangentes

2. /Seleção Dinâmica de Fontes/
   - Workflow de agentes aprimorado para decidir quais fontes consultar
   - Integração com APIs externas e pesquisa web

3. /Framework de Ferramentas para Agentes/
   - Sistema de ferramentas para ações específicas
   - Executores de código, calculadoras e formatadores

4. /Interface Multimodal/
   - Processamento de imagens e geração de gráficos
   - Suporte a diversos formatos além de texto

Estas evoluções manterão a arquitetura modular e extensível do DocAI, permitindo adaptação a diferentes casos de uso e domínios de conhecimento.

** Integração com o Ecossistema

#+BEGIN_SRC mermaid
flowchart TB
    subgraph "Ecossistema DocAI"
        direction TB
        
        DOCAI[Sistema DocAI] --- OLLAMA[Ollama]
        DOCAI --- POSTGRES[PostgreSQL + pgvector]
        
        DOCAI --- API_GATE[API Gateway]
        API_GATE --- WEB_APP[Aplicação Web]
        API_GATE --- CLI[Interface CLI]
        
        DOCAI --- MONITORING[Sistema de Monitoramento]
        MONITORING --- DASHBOARD[Dashboard de Métricas]
        
        DOCAI -.-> FUTURE_INT[Integrações Futuras]
        FUTURE_INT -.-> EXT_API[APIs Externas]
        FUTURE_INT -.-> SEARCH[Motores de Busca]
        FUTURE_INT -.-> TOOLS[Ferramentas de Produtividade]
        
        style DOCAI fill:#f99,stroke:#333,stroke-width:3px
        style OLLAMA fill:#9f9,stroke:#333,stroke-width:2px
        style POSTGRES fill:#99f,stroke:#333,stroke-width:2px
        style FUTURE_INT fill:#ddd,stroke:#333,stroke-width:2px,stroke-dasharray: 5 5
    end
#+END_SRC

O diagrama acima mostra como o DocAI se integra ao ecossistema mais amplo de ferramentas e serviços. No centro está o sistema [[https://github.com/docai-ai/docai][DocAI]], que se conecta diretamente com [[https://github.com/ollama/ollama][Ollama]] para geração de texto e embeddings, e com [[https://www.postgresql.org/][PostgreSQL]] (com [[https://github.com/pgvector/pgvector][pgvector]]) para armazenamento e recuperação de dados vetoriais.

Para interação com usuários, o DocAI se conecta a um [[https://en.wikipedia.org/wiki/API_gateway][API Gateway]] que fornece acesso tanto para uma aplicação web quanto para uma interface de linha de comando (CLI). Um sistema dedicado de monitoramento coleta métricas e as exibe em um dashboard para análise de desempenho.

As linhas tracejadas indicam integrações futuras planejadas, incluindo [[https://en.wikipedia.org/wiki/API][APIs externas]] para busca de informações adicionais, [[https://en.wikipedia.org/wiki/Search_engine][motores de busca]] para ampliar o alcance de recuperação, e [[https://en.wikipedia.org/wiki/Productivity][ferramentas de produtividade]] para aumentar as capacidades do sistema.

Esta arquitetura modular permite que o DocAI se mantenha flexível e adaptável, podendo ser expandido conforme novos requisitos e oportunidades surgem, sempre mantendo seu núcleo robusto de funcionalidades RAG avançadas.

-----

** Conclusão

Transformar um sistema [[https://en.wikipedia.org/wiki/Retrieval-Augmented_Generation][RAG]] de protótipo para produção requer mais do que apenas escolher as melhores ferramentas - exige uma compreensão profunda de cada componente e como eles trabalham juntos para produzir resultados confiáveis.

O projeto [[https://github.com/scovl/docai][DocAI]] representa uma implementação robusta das técnicas avançadas de RAG discutidas neste artigo. Sua arquitetura modular, com componentes especializados em diferentes aspectos do processo (como Core, LLM, PostgreSQL, Sistema de Agentes e Métricas), demonstra a importância de um design bem estruturado para sistemas RAG em produção.

As técnicas que exploramos - desde re-ranqueamento e chunking dinâmico até workflows com agentes e monitoramento avançado - representam as práticas que separam implementações amadoras de sistemas robustos e prontos para uso em escala.

#+BEGIN_SRC mermaid
flowchart LR
    subgraph "Evolução do DocAI"
    direction LR
    BASIC[RAG Básico com TF-IDF] --> PGSQL[PostgreSQL + Embeddings] --> ADV[Sistema RAG Avançado] --> AGT[Sistema RAG Agêntico]
    end
    
    style BASIC fill:#ddf,stroke:#333,stroke-width:2px
    style PGSQL fill:#fdf,stroke:#333,stroke-width:2px
    style ADV fill:#dfd,stroke:#333,stroke-width:2px
    style AGT fill:#ffd,stroke:#333,stroke-width:2px
#+END_SRC

Nossa jornada com o [[https://github.com/scovl/docai][DocAI]] evoluiu significativamente, de uma implementação básica com TF-IDF, passando por um sistema com PostgreSQL e embeddings, e agora para uma arquitetura avançada com agentes que pode lidar com casos de uso complexos do mundo real. O próximo passo, conforme detalhado no plano de evolução, será expandir ainda mais essas capacidades para criar um sistema RAG Agêntico completo.

O futuro dos sistemas de IA não está em modelos cada vez maiores, mas na combinação inteligente de componentes especializados que trabalham juntos para superar limitações individuais. O [[https://github.com/scovl/docai][DocAI]] exemplifica esta abordagem, demonstrando como a integração de técnicas avançadas de RAG pode resultar em um sistema mais inteligente, preciso e útil para seus usuários.

-----

