rag02/index.html
<div id="outline-container-headline-31" class="outline-4">
<h4 id="headline-31">
Próximos Passos para o DocAI
</h4>
<div id="outline-text-headline-31" class="outline-text-4">
<p>
Conforme detalhado no <code>plan.md</code>, o DocAI evoluirá para um sistema RAG Agêntico mais completo, implementando as seguintes melhorias:</p>
<ol>
<li>
<p><em>Reescrita de Consultas</em></p>
<ul>
<li>Módulo de reformulação para melhorar a precisão da busca</li>
<li>Expansão de consultas curtas e foco em consultas abrangentes</li>
</ul>
</li>
<li>
<p><em>Seleção Dinâmica de Fontes</em></p>
<ul>
<li>Workflow de agentes aprimorado para decidir quais fontes consultar</li>
<li>Integração com APIs externas e pesquisa web</li>
</ul>
</li>
<li>
<p><em>Framework de Ferramentas para Agentes</em></p>
<ul>
<li>Sistema de ferramentas para ações específicas</li>
<li>Executores de código, calculadoras e formatadores</li>
</ul>
</li>
<li>
<p><em>Interface Multimodal</em></p>
<ul>
<li>Processamento de imagens e geração de gráficos</li>
<li>Suporte a diversos formatos além de texto</li>
</ul>
</li>
</ol>
<p>Estas evoluções manterão a arquitetura modular e extensível do DocAI, permitindo adaptação a diferentes casos de uso e domínios de conhecimento.</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-32" class="outline-3">
<h3 id="headline-32">
Integração com o Ecossistema
</h3>
<div id="outline-text-headline-32" class="outline-text-3">
<div class="src src-mermaid">
<pre tabindex="0"><code class="language-mermaid" data-lang="mermaid">flowchart TB
    subgraph &#34;Ecossistema DocAI&#34;
        direction TB
        
        DOCAI[Sistema DocAI] --- OLLAMA[Ollama]
        DOCAI --- POSTGRES[PostgreSQL + pgvector]
        
        DOCAI --- API_GATE[API Gateway]
        API_GATE --- WEB_APP[Aplicação Web]
        API_GATE --- CLI[Interface CLI]
        
        DOCAI --- MONITORING[Sistema de Monitoramento]
        MONITORING --- DASHBOARD[Dashboard de Métricas]
        
        DOCAI -.-&gt; FUTURE_INT[Integrações Futuras]
        FUTURE_INT -.-&gt; EXT_API[APIs Externas]
        FUTURE_INT -.-&gt; SEARCH[Motores de Busca]
        FUTURE_INT -.-&gt; TOOLS[Ferramentas de Produtividade]
        
        style DOCAI fill:#f99,stroke:#333,stroke-width:3px
        style OLLAMA fill:#9f9,stroke:#333,stroke-width:2px
        style POSTGRES fill:#99f,stroke:#333,stroke-width:2px
        style FUTURE_INT fill:#ddd,stroke:#333,stroke-width:2px,stroke-dasharray: 5 5
    end</code></pre>
</div>
<p>
O diagrama acima mostra como o DocAI se integra ao ecossistema mais amplo de ferramentas e serviços. No centro está o sistema <a href="https://github.com/docai-ai/docai">DocAI</a>, que se conecta diretamente com <a href="https://github.com/ollama/ollama">Ollama</a> para geração de texto e embeddings, e com <a href="https://www.postgresql.org/">PostgreSQL</a> (com <a href="https://github.com/pgvector/pgvector">pgvector</a>) para armazenamento e recuperação de dados vetoriais.</p>
<p>
Para interação com usuários, o DocAI se conecta a um <a href="https://en.wikipedia.org/wiki/API_gateway">API Gateway</a> que fornece acesso tanto para uma aplicação web quanto para uma interface de linha de comando (CLI). Um sistema dedicado de monitoramento coleta métricas e as exibe em um dashboard para análise de desempenho.</p>
<p>
As linhas tracejadas indicam integrações futuras planejadas, incluindo <a href="https://en.wikipedia.org/wiki/API">APIs externas</a> para busca de informações adicionais, <a href="https://en.wikipedia.org/wiki/Search_engine">motores de busca</a> para ampliar o alcance de recuperação, e <a href="https://en.wikipedia.org/wiki/Productivity">ferramentas de produtividade</a> para aumentar as capacidades do sistema.</p>
<p>
Esta arquitetura modular permite que o DocAI se mantenha flexível e adaptável, podendo ser expandido conforme novos requisitos e oportunidades surgem, sempre mantendo seu núcleo robusto de funcionalidades RAG avançadas.</p>
<hr>
</div>
</div>
<div id="outline-container-headline-33" class="outline-3">
<h3 id="headline-33">
Conclusão
</h3>
<div id="outline-text-headline-33" class="outline-text-3">
<p>
Transformar um sistema <a href="https://en.wikipedia.org/wiki/Retrieval-Augmented_Generation">RAG</a> de protótipo para produção requer mais do que apenas escolher as melhores ferramentas - exige uma compreensão profunda de cada componente e como eles trabalham juntos para produzir resultados confiáveis.</p>
<p>
O projeto <a href="https://github.com/lobovit/docai">DocAI</a> representa uma implementação robusta das técnicas avançadas de RAG discutidas neste artigo. Sua arquitetura modular, com componentes especializados em diferentes aspectos do processo (como Core, LLM, PostgreSQL, Sistema de Agentes e Métricas), demonstra a importância de um design bem estruturado para sistemas RAG em produção.</p>
<p>
As técnicas que exploramos - desde re-ranqueamento e chunking dinâmico até workflows com agentes e monitoramento avançado - representam as práticas que separam implementações amadoras de sistemas robustos e prontos para uso em escala.</p>
<div class="src src-mermaid">
<pre tabindex="0"><code class="language-mermaid" data-lang="mermaid">flowchart LR
    subgraph &#34;Evolução do DocAI&#34;
    direction LR
    BASIC[RAG Básico com TF-IDF] --&gt; PGSQL[PostgreSQL + Embeddings] --&gt; ADV[Sistema RAG Avançado] --&gt; AGT[Sistema RAG Agêntico]
    end
    
    style BASIC fill:#ddf,stroke:#333,stroke-width:2px
    style PGSQL fill:#fdf,stroke:#333,stroke-width:2px
    style ADV fill:#dfd,stroke:#333,stroke-width:2px
    style AGT fill:#ffd,stroke:#333,stroke-width:2px</code></pre>
</div>
<p>
Nossa jornada com o <a href="https://github.com/lobovit/docai">DocAI</a> evoluiu significativamente, de uma implementação básica com TF-IDF, passando por um sistema com PostgreSQL e embeddings, e agora para uma arquitetura avançada com agentes que pode lidar com casos de uso complexos do mundo real. O próximo passo, conforme detalhado no plano de evolução, será expandir ainda mais essas capacidades para criar um sistema RAG Agêntico completo.</p>
<p>
O futuro dos sistemas de IA não está em modelos cada vez maiores, mas na combinação inteligente de componentes especializados que trabalham juntos para superar limitações individuais. O <a href="https://github.com/lobovit/docai">DocAI</a> exemplifica esta abordagem, demonstrando como a integração de técnicas avançadas de RAG pode resultar em um sistema mais inteligente, preciso e útil para seus usuários.</p>
<hr>
</div>
</div>
